{"":[{"content":"Images","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8755930010386553},{"content":"Edit: 1/6/2021","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8686066054110362},{"content":"Conclusion","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8627111729312937},{"content":"Key Features","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8621480151447609},{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8593290080388},{"content":"Yes.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.859011141952105},{"content":"The club does 2 things.","parent":"posts/untitled-9-24-2021.txt","score":0.8589669169415844},{"content":"|___Practice Routine","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8583546625772834},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8577220980911441},{"content":"Code:","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.856649564390397},{"content":"Executing","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8556654491388678},{"content":"A minimap makes all of this accessible from anywhere. You can access it by clicking the green button at the bottom, or by pressing command K.","parent":"posts/Fragments.txt","score":0.8555190150006605},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8537043599402795},{"content":"Long Term goals","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8537012688171842},{"content":"Target Users","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8512910151541713},{"content":"Page tags","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8512275077312982},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8499151373626692},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8497861585687644},{"content":"[https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q](https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q)","parent":"posts/untitled-9-22-2021.txt","score":0.8497647970149683},{"content":"Namespaces","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8497010761916202}],"The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.":[{"content":"The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.9999999999999999},{"content":"The problem with the view that technology is meant to solve problems is that technology always ends up doing so much more than that. Take any technology and its original intended purpose (fire, automobiles, airplanes, etc.) and you will find it has created a cascade of second order effects far beyond what it was originally intended to do. Sometimes these impacts are good, sometimes they're bad, sometimes they're just strange.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8902703061419613},{"content":"If you share some infrastructure that lets you play around with ideas quickly and also share them quickly, that solves the problem. Stuff like Repl.it does this, but I feel less of a sense of ownership over it.","parent":"posts/Fragments.txt","score":0.8628310287283203},{"content":"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data.","parent":"posts/Controlling what you see-6-23-2021.txt","score":0.8583249574581804},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8552798902672715},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see-6-23-2021.txt","score":0.8545319826223337},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8485290825108998},{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8481927512507662},{"content":"Of course, it is impossible to create a new kind of person out of thin air. Without traction with existing customers, it is impossible to gain the momentum needed to have enough cultural impact to create a new type of person. The synthesis between these two extremes is this: an innovative product is not one that merely solves problems for an existing kind of person, or one that creates an entirely new kind of person. Rather, it recognizes some kind of latent potential in existing people, and then transforms them into a new kind of person. For example, influencers did not exist when Instagram was created. However, there were people who wanted to share their photos with the world, and people that wanted to be recognized for their photos/beauty - it was this latent potential that Instagram unleashed.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8477029603949464},{"content":"Technology that you control","parent":"posts/Giant Robots-2-28-2021.txt","score":0.8429574375647065},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto-4-23-2020.txt","score":0.8425529933034895},{"content":"I strongly believe tools for thought have leaned too much towards knowledge management and underindexed on enabling creatives. The latest advances in the space - backlinks, transclusion, spatial interfaces, language models/NLP - will be useful for knowledge work, but they will prove even more powerful in the hands of creatives.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.84253686706515},{"content":"Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8415452057994337},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.8398329523925887},{"content":"This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"","parent":"posts/Second Brains-2-13-2021.txt","score":0.8395304022802076},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8383980543992297},{"content":"For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8381097006020547},{"content":"This is not the case for programming. Making better tools for programming (new languages, new frameworks, new libraries) itself requires programming, and while making programming tools is different in important respects from writing regular programs, it is still programming. Making guitars is not playing guitars, making paints is not painting, but making better programming tools is programming. Programming, then, is an, intrinsically recursive creative medium.","parent":"posts/Prometheus-2-13-2021.txt","score":0.8379695443712485},{"content":"For a while, I exclusively worked on a long, serious projects. I wanted to build a billion dollar product. I wanted to be the founder of a successful startup. I wanted to write, but I wanted to write on my own platform that everybody else would also write on, that would have all the features I wanted that everybody else would love.","parent":"posts/Fragments.txt","score":0.8371211003051424},{"content":"That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]]","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.836848856195858}],"I don't just mean that technologies create new sorts of jobs, which is a true statement but in my opinion understates the significance of what is being done. Each of the examples given above did not merely create a new kind of occupation - they created a nexus of richly interlinked cultural artifacts, characters, and identities. The introduction of the social media influencer did far more than just introduce a new kind of occupation. It also created a new social hierarchy, threatened old social hierarchies (the beef between old Hollywood elites and new internet stars, etc. etc.), [influenced the goals of an entire generation](https://www.fastcompany.com/90432765/why-do-kids-want-to-be-influencers), and resulted in a reordering of values where old values like modesty and moderation gave way to exuberance and excess. The sum of these new hierarchies, values, and occupations is the creation of a new type of person.":[{"content":"I don't just mean that technologies create new sorts of jobs, which is a true statement but in my opinion understates the significance of what is being done. Each of the examples given above did not merely create a new kind of occupation - they created a nexus of richly interlinked cultural artifacts, characters, and identities. The introduction of the social media influencer did far more than just introduce a new kind of occupation. It also created a new social hierarchy, threatened old social hierarchies (the beef between old Hollywood elites and new internet stars, etc. etc.), [influenced the goals of an entire generation](https://www.fastcompany.com/90432765/why-do-kids-want-to-be-influencers), and resulted in a reordering of values where old values like modesty and moderation gave way to exuberance and excess. The sum of these new hierarchies, values, and occupations is the creation of a new type of person.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":1},{"content":"There is a particular kind of second order effect that is of special interest: technologies can create entire new types of people. Instagram created the influencer, Youtube produced the Youtuber, Soundcloud spawned its own eponymous kind of rapper. The more extreme political factions in America trace their lineages to 4Chan and Tumblr. To give an older example, the factory birthed the proletariat a century ago.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8893671569882067},{"content":"Of course, it is impossible to create a new kind of person out of thin air. Without traction with existing customers, it is impossible to gain the momentum needed to have enough cultural impact to create a new type of person. The synthesis between these two extremes is this: an innovative product is not one that merely solves problems for an existing kind of person, or one that creates an entirely new kind of person. Rather, it recognizes some kind of latent potential in existing people, and then transforms them into a new kind of person. For example, influencers did not exist when Instagram was created. However, there were people who wanted to share their photos with the world, and people that wanted to be recognized for their photos/beauty - it was this latent potential that Instagram unleashed.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8839916028382577},{"content":"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.","parent":"posts/untitled-9-20-2021.txt","score":0.8554358430236206},{"content":"The problem with the view that technology is meant to solve problems is that technology always ends up doing so much more than that. Take any technology and its original intended purpose (fire, automobiles, airplanes, etc.) and you will find it has created a cascade of second order effects far beyond what it was originally intended to do. Sometimes these impacts are good, sometimes they're bad, sometimes they're just strange.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8314158569618333},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8308697960559285},{"content":"In general, computers have enabled the Promethean task of stealing creative abilities previously reserved for deities. Musicians have their electrically amplified instruments, their DAWs, the vast oceans of samples available on the internet; artists have been blessed with digital canvases, 3D modeling, and the ubiquity of screens that renders a possible canvas in every man's pocket.","parent":"posts/Prometheus-2-13-2021.txt","score":0.8252502724310061},{"content":"That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]]","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8239074579985747},{"content":"Traditional market research asks the question, what sorts of people would use our product? A useful question, to be sure, but the more interesting one is what new sort of person would our product create?","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8235568048957876},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8231963849115056},{"content":"The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8231474890233326},{"content":"In a tantalizingly dialectical fashion, this phenomenon contains its own contradiction - on the very apps that have engineered the collapse of your attention span, you scroll past countless posts on social media addiction, hacks to improve your attention span, dopamine fasts, meditation routines, and even posts urging you to delete the apps on which they are hosted. But these hacks are nothing more than empty promises. The truth is that the world has changed, and you with it. There is no going back to the world where information was scarcer than attention.","parent":"posts/Manifesto-4-23-2020.txt","score":0.8220307107428354},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots-2-28-2021.txt","score":0.821076387386494},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see-6-23-2021.txt","score":0.8200852603160261},{"content":"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8196915441043271},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.817554337710938},{"content":"2. My critique here is nothing original - it echoes a lot of what Andy [[Matuschak]] and [[Linus Lee]] have touched upon in their essays. Here's a brief excerpt from [Linus' blog post](https://thesephist.com/posts/browser/) that expresses the point more eloquently:","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8168828530264843},{"content":"It is current year. Armed with fleets of server racks and neural nets trained upon eons of GPU compute time, social media conglomerates have razed and pillaged your attention span with a steady drip feed of content algorithmically optimized to deliver maximal doses of dopamine. Half the time you open your phone, you forget what you opened it for in the first place (checking the weather? for an important email?) and somehow end up on one of the many like farms installed on your phone, your thumbs scrolling like runners on a treadmill.","parent":"posts/Manifesto-4-23-2020.txt","score":0.8140466797640885},{"content":"I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.","parent":"posts/Fragments.txt","score":0.8136722916992589},{"content":"Consider two things I think to be missing from modern music: context and community. While its nothing compared to live music, I think certain Youtube videos capture these elements in a novel and exciting way.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.813084187552209}],"There is a particular kind of second order effect that is of special interest: technologies can create entire new types of people. Instagram created the influencer, Youtube produced the Youtuber, Soundcloud spawned its own eponymous kind of rapper. The more extreme political factions in America trace their lineages to 4Chan and Tumblr. To give an older example, the factory birthed the proletariat a century ago. ":[{"content":"There is a particular kind of second order effect that is of special interest: technologies can create entire new types of people. Instagram created the influencer, Youtube produced the Youtuber, Soundcloud spawned its own eponymous kind of rapper. The more extreme political factions in America trace their lineages to 4Chan and Tumblr. To give an older example, the factory birthed the proletariat a century ago.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":1},{"content":"Of course, it is impossible to create a new kind of person out of thin air. Without traction with existing customers, it is impossible to gain the momentum needed to have enough cultural impact to create a new type of person. The synthesis between these two extremes is this: an innovative product is not one that merely solves problems for an existing kind of person, or one that creates an entirely new kind of person. Rather, it recognizes some kind of latent potential in existing people, and then transforms them into a new kind of person. For example, influencers did not exist when Instagram was created. However, there were people who wanted to share their photos with the world, and people that wanted to be recognized for their photos/beauty - it was this latent potential that Instagram unleashed.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8969295470609125},{"content":"I don't just mean that technologies create new sorts of jobs, which is a true statement but in my opinion understates the significance of what is being done. Each of the examples given above did not merely create a new kind of occupation - they created a nexus of richly interlinked cultural artifacts, characters, and identities. The introduction of the social media influencer did far more than just introduce a new kind of occupation. It also created a new social hierarchy, threatened old social hierarchies (the beef between old Hollywood elites and new internet stars, etc. etc.), [influenced the goals of an entire generation](https://www.fastcompany.com/90432765/why-do-kids-want-to-be-influencers), and resulted in a reordering of values where old values like modesty and moderation gave way to exuberance and excess. The sum of these new hierarchies, values, and occupations is the creation of a new type of person.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8893671569882067},{"content":"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.","parent":"posts/untitled-9-20-2021.txt","score":0.8449859357062585},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8404630052370634},{"content":"As I looked further into these tools, I found that some had taken to calling them [Second Brains](https://fortelabs.co/blog/basboverview/). I thought this was incredibly exciting. The term sounds cyberpunk; building a \"second brain\" sounds way cooler than building a \"note taking app.\" At the same time, something about it unsettled me.","parent":"posts/Second Brains-2-13-2021.txt","score":0.8390053277969106},{"content":"The problem with the view that technology is meant to solve problems is that technology always ends up doing so much more than that. Take any technology and its original intended purpose (fire, automobiles, airplanes, etc.) and you will find it has created a cascade of second order effects far beyond what it was originally intended to do. Sometimes these impacts are good, sometimes they're bad, sometimes they're just strange.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8369358294632223},{"content":"It is current year. Armed with fleets of server racks and neural nets trained upon eons of GPU compute time, social media conglomerates have razed and pillaged your attention span with a steady drip feed of content algorithmically optimized to deliver maximal doses of dopamine. Half the time you open your phone, you forget what you opened it for in the first place (checking the weather? for an important email?) and somehow end up on one of the many like farms installed on your phone, your thumbs scrolling like runners on a treadmill.","parent":"posts/Manifesto-4-23-2020.txt","score":0.8369209156281741},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8359404816587827},{"content":"The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8353109553817152},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8352929415643877},{"content":"Traditional market research asks the question, what sorts of people would use our product? A useful question, to be sure, but the more interesting one is what new sort of person would our product create?","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8343144217863707},{"content":"In general, computers have enabled the Promethean task of stealing creative abilities previously reserved for deities. Musicians have their electrically amplified instruments, their DAWs, the vast oceans of samples available on the internet; artists have been blessed with digital canvases, 3D modeling, and the ubiquity of screens that renders a possible canvas in every man's pocket.","parent":"posts/Prometheus-2-13-2021.txt","score":0.8327060603396322},{"content":"Higher-order creativity","parent":"posts/Prometheus-2-13-2021.txt","score":0.8311480615859759},{"content":"Consider two things I think to be missing from modern music: context and community. While its nothing compared to live music, I think certain Youtube videos capture these elements in a novel and exciting way.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8279999121834125},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto-4-23-2020.txt","score":0.8273843867687442},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8265860477823226},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto-4-23-2020.txt","score":0.8265322660055059},{"content":"There is a political consequence to this: More often than not, two parties with opposing aims will have entirely ontologies. They will not even be able to agree over what exists in the first place.","parent":"posts/untitled-1-4-2022.txt","score":0.825865652439482},{"content":"That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]]","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8258052407681867}],"Traditional market research asks the question, what sorts of people would use our product? A useful question, to be sure, but the more interesting one is what new sort of person would our product create? ":[{"content":"Traditional market research asks the question, what sorts of people would use our product? A useful question, to be sure, but the more interesting one is what new sort of person would our product create?","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":1.0000000000000002},{"content":"Of course, it is impossible to create a new kind of person out of thin air. Without traction with existing customers, it is impossible to gain the momentum needed to have enough cultural impact to create a new type of person. The synthesis between these two extremes is this: an innovative product is not one that merely solves problems for an existing kind of person, or one that creates an entirely new kind of person. Rather, it recognizes some kind of latent potential in existing people, and then transforms them into a new kind of person. For example, influencers did not exist when Instagram was created. However, there were people who wanted to share their photos with the world, and people that wanted to be recognized for their photos/beauty - it was this latent potential that Instagram unleashed.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8795278782045575},{"content":"I understand this space intimately, have a personal need for the product, and have the technical capability to build the product - this makes me especially suited to take on this challenge.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8537495644564744},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8374166687395762},{"content":"The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8345904893157617},{"content":"There is a particular kind of second order effect that is of special interest: technologies can create entire new types of people. Instagram created the influencer, Youtube produced the Youtuber, Soundcloud spawned its own eponymous kind of rapper. The more extreme political factions in America trace their lineages to 4Chan and Tumblr. To give an older example, the factory birthed the proletariat a century ago.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8343144217863707},{"content":"Target Users","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8290302186184123},{"content":"How will you make money?","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8267627039146848},{"content":"What makes you suited to take on this challenge?","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8244961720180501},{"content":"I don't just mean that technologies create new sorts of jobs, which is a true statement but in my opinion understates the significance of what is being done. Each of the examples given above did not merely create a new kind of occupation - they created a nexus of richly interlinked cultural artifacts, characters, and identities. The introduction of the social media influencer did far more than just introduce a new kind of occupation. It also created a new social hierarchy, threatened old social hierarchies (the beef between old Hollywood elites and new internet stars, etc. etc.), [influenced the goals of an entire generation](https://www.fastcompany.com/90432765/why-do-kids-want-to-be-influencers), and resulted in a reordering of values where old values like modesty and moderation gave way to exuberance and excess. The sum of these new hierarchies, values, and occupations is the creation of a new type of person.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8235568048957876},{"content":"Business vision is not totally fleshed out. I have ideas, but I will need your help developing and refining them.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8217721219682531},{"content":"[By their own admission, Roam Research are trying to summon the energies of a cult](https://twitter.com/conaw/status/1351233430579769345). They have a quality product, but the rhetoric surrounding it is incredibly strange, and there is a steep learning curve to picking it up.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8197089029107091},{"content":"Before working on exegesis, I released a proof-of-concept called [YANA](https://yananotes.com/). It made the front page of [ProductHunt](https://www.producthunt.com/posts/yana), accrued almost 400 users, and put a few enthusiastic emails in my inbox. Because YANA was built with a rudimentary text engine that I wanted to upgrade, I decided to start over - the product of which is exegesis. Though it is not actively maintained, there are still a dozen or so active YANA users.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8183973936599361},{"content":"For a while, I exclusively worked on a long, serious projects. I wanted to build a billion dollar product. I wanted to be the founder of a successful startup. I wanted to write, but I wanted to write on my own platform that everybody else would also write on, that would have all the features I wanted that everybody else would love.","parent":"posts/Fragments.txt","score":0.8183681539912824},{"content":"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.","parent":"posts/untitled-9-20-2021.txt","score":0.8181068183656673},{"content":"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8152159806495489},{"content":"If you share some infrastructure that lets you play around with ideas quickly and also share them quickly, that solves the problem. Stuff like Repl.it does this, but I feel less of a sense of ownership over it.","parent":"posts/Fragments.txt","score":0.8150184901906794},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.8142918820390408},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see-6-23-2021.txt","score":0.8142030980452197},{"content":"The last option is less appealing to me personally, and it would be technically difficult (building all the permissioning code for a company's knowledge base, allowing multiple edits, etc. etc.), but it could be an interesting avenue to explore further, and I'm not counting it out.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8138101473795823}],"Of course, it is impossible to create a new kind of person out of thin air. Without traction with existing customers, it is impossible to gain the momentum needed to have enough cultural impact to create a new type of person. The synthesis between these two extremes is this: an innovative product is not one that merely solves problems for an existing kind of person, or one that creates an entirely new kind of person. Rather, it recognizes some kind of latent potential in existing people, and then transforms them into a new kind of person. For example, influencers did not exist when Instagram was created. However, there were people who wanted to share their photos with the world, and people that wanted to be recognized for their photos/beauty - it was this latent potential that Instagram unleashed.":[{"content":"Of course, it is impossible to create a new kind of person out of thin air. Without traction with existing customers, it is impossible to gain the momentum needed to have enough cultural impact to create a new type of person. The synthesis between these two extremes is this: an innovative product is not one that merely solves problems for an existing kind of person, or one that creates an entirely new kind of person. Rather, it recognizes some kind of latent potential in existing people, and then transforms them into a new kind of person. For example, influencers did not exist when Instagram was created. However, there were people who wanted to share their photos with the world, and people that wanted to be recognized for their photos/beauty - it was this latent potential that Instagram unleashed.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.9999999999999999},{"content":"There is a particular kind of second order effect that is of special interest: technologies can create entire new types of people. Instagram created the influencer, Youtube produced the Youtuber, Soundcloud spawned its own eponymous kind of rapper. The more extreme political factions in America trace their lineages to 4Chan and Tumblr. To give an older example, the factory birthed the proletariat a century ago.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8969295470609125},{"content":"I don't just mean that technologies create new sorts of jobs, which is a true statement but in my opinion understates the significance of what is being done. Each of the examples given above did not merely create a new kind of occupation - they created a nexus of richly interlinked cultural artifacts, characters, and identities. The introduction of the social media influencer did far more than just introduce a new kind of occupation. It also created a new social hierarchy, threatened old social hierarchies (the beef between old Hollywood elites and new internet stars, etc. etc.), [influenced the goals of an entire generation](https://www.fastcompany.com/90432765/why-do-kids-want-to-be-influencers), and resulted in a reordering of values where old values like modesty and moderation gave way to exuberance and excess. The sum of these new hierarchies, values, and occupations is the creation of a new type of person.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8839916028382577},{"content":"Traditional market research asks the question, what sorts of people would use our product? A useful question, to be sure, but the more interesting one is what new sort of person would our product create?","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8795278782045575},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.850525585058688},{"content":"The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8477029603949464},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see-6-23-2021.txt","score":0.8385015382575444},{"content":"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8372245940540868},{"content":"There are few feelings worse than wanting desperately to make something, and feeling as if you do not have the capability to make it.","parent":"posts/untitled-9-22-2021.txt","score":0.835989859588224},{"content":"The auteur believes something similar about ideas. A description of an idea is never the idea itself, it is a second rate copy of an original - another thing added to the world's contents. Preferring not to clutter the world with such refuse, he becomes reclusive, reluctant to even speak of what he wishes to create. The result is either pure creativity untarnished by the translation of ideas into words, or something tantamount to the work of a madman - full of meaning to its creator but incomprehensible and useless to everyone else.","parent":"posts/On auteurs and language-10-9-2021.txt","score":0.8353964310300829},{"content":"I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.","parent":"posts/Fragments.txt","score":0.8346612210342353},{"content":"Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all.","parent":"posts/On auteurs and language-10-9-2021.txt","score":0.8332191211209349},{"content":"Creative inadequacy","parent":"posts/untitled-9-22-2021.txt","score":0.8325058724307639},{"content":"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.","parent":"posts/untitled-9-20-2021.txt","score":0.8314622343826301},{"content":"In a tantalizingly dialectical fashion, this phenomenon contains its own contradiction - on the very apps that have engineered the collapse of your attention span, you scroll past countless posts on social media addiction, hacks to improve your attention span, dopamine fasts, meditation routines, and even posts urging you to delete the apps on which they are hosted. But these hacks are nothing more than empty promises. The truth is that the world has changed, and you with it. There is no going back to the world where information was scarcer than attention.","parent":"posts/Manifesto-4-23-2020.txt","score":0.8314422958937594},{"content":"Neither perspective is completely correct. The reality is that there is a tradeoff between the approach of creative collaboration and the approach of an auteur. What creative collaborators gain through specialization and the combination of talents, they lose in the fidelity of their ideas' expression; what the auteur loses through not being able to harness others' talents, he gains through the ability to express an idea to its fullest. Naturally, the more talents the auteur is able to accrue, the less he needs others, and the more worthwhile the tradeoff of solo work becomes.","parent":"posts/On auteurs and language-10-9-2021.txt","score":0.8311449739748301},{"content":"But this is something forbidden to mortal men. We face a kind of creative asymmetry - to bring beauty into the world, it is neccessary to confront ugliness. Creating beautiful, original music requires endless, stupid, and frustrating scale practice, finger exercises, and theory study; behind the sublime beauty of a master's painting lies hours of practice filling sketchbooks with mind numbing still lifes and ugly anatomical mistakes. On the one hand, it seems paradoxical that beauty, freedom and originality require ugliness, servitude, and repetition. On the other hand, it is almost coldly rational - perhaps there is a kind of aesthetic entropy at play, like there's a set amount of beauty in the universe, and to \"produce\" any more of it, you first have to take on ugliness as a burden.[[music]] [[aesthetics]] [[art]]","parent":"posts/Prometheus-2-13-2021.txt","score":0.8279726856275649},{"content":"For a while, I exclusively worked on a long, serious projects. I wanted to build a billion dollar product. I wanted to be the founder of a successful startup. I wanted to write, but I wanted to write on my own platform that everybody else would also write on, that would have all the features I wanted that everybody else would love.","parent":"posts/Fragments.txt","score":0.8272228992188362},{"content":"2. My critique here is nothing original - it echoes a lot of what Andy [[Matuschak]] and [[Linus Lee]] have touched upon in their essays. Here's a brief excerpt from [Linus' blog post](https://thesephist.com/posts/browser/) that expresses the point more eloquently:","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8270889680695036},{"content":"I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.","parent":"posts/Fragments.txt","score":0.8259699539330829}],"The problem with the view that technology is meant to solve problems is that technology always ends up doing so much more than that. Take any technology and its original intended purpose (fire, automobiles, airplanes, etc.) and you will find it has created a cascade of second order effects far beyond what it was originally intended to do. Sometimes these impacts are good, sometimes they're bad, sometimes they're just strange. ":[{"content":"The problem with the view that technology is meant to solve problems is that technology always ends up doing so much more than that. Take any technology and its original intended purpose (fire, automobiles, airplanes, etc.) and you will find it has created a cascade of second order effects far beyond what it was originally intended to do. Sometimes these impacts are good, sometimes they're bad, sometimes they're just strange.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":1.0000000000000002},{"content":"The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8902703061419613},{"content":"Technology that you control","parent":"posts/Giant Robots-2-28-2021.txt","score":0.8641404915995702},{"content":"I don't think it's possible to fix our information ecosystem. In fact, I don't even know if it'd be desirable to fix it - as perverse as it is, there is also a chaotically beautiful side to the internet.","parent":"posts/Giant Robots-2-28-2021.txt","score":0.8504066326151378},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto-4-23-2020.txt","score":0.8444972960099688},{"content":"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data.","parent":"posts/Controlling what you see-6-23-2021.txt","score":0.843607471037773},{"content":"If you think about that a bit, it's a very quaint idea. Can you imagine a world where technology has developed to the point where we have giant robots, but technology is not somehow advanced enough to autopilot them? The idea seems strange to us, because in many respects, we live in a world diametrically opposed to the one portrayed in mecha science fiction. In their world, human beings control towering 50-foot humanoid war mechs. In ours, we are ruled by 5 inch screens in our pockets.","parent":"posts/Giant Robots-2-28-2021.txt","score":0.8431874034973154},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8411964662452646},{"content":"I think Computer Science is also subject to this double hermeneutic. The best example of this is computer security. Best practices are researched by computer scientists, and strategies against them are developed by security researchers and malicious actors. Conclusions are reached about how to best design computer systems, but these conclusions never last very long, because hostile actors have incentives to disrupt these conclusions. In the same way that social theories can be invalidated by people's awareness of those social theories, conclusions on computer system can as well.","parent":"posts/untitled-10-11-2021.txt","score":0.8404493602568549},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8399502142715085},{"content":"There is a particular kind of second order effect that is of special interest: technologies can create entire new types of people. Instagram created the influencer, Youtube produced the Youtuber, Soundcloud spawned its own eponymous kind of rapper. The more extreme political factions in America trace their lineages to 4Chan and Tumblr. To give an older example, the factory birthed the proletariat a century ago.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8369358294632223},{"content":"Instead of fixing the information ecosystem, we should build tools that help us navigate it - to minimize the deleterious effects, and amplify the benefits. The antidote to an information ecosystem beyond our personal control is to create robust tools for information consumption and information processing that we can control.","parent":"posts/Giant Robots-2-28-2021.txt","score":0.8344160395620894},{"content":"None of it worked. Why? It's not that these tools don't work in general - plenty of people swear by them. The problem was either with the tools, or with me. Technology exists for the utility of the user, not the other way around, so I rejected the latter answer.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8324811224885331},{"content":"I don't just mean that technologies create new sorts of jobs, which is a true statement but in my opinion understates the significance of what is being done. Each of the examples given above did not merely create a new kind of occupation - they created a nexus of richly interlinked cultural artifacts, characters, and identities. The introduction of the social media influencer did far more than just introduce a new kind of occupation. It also created a new social hierarchy, threatened old social hierarchies (the beef between old Hollywood elites and new internet stars, etc. etc.), [influenced the goals of an entire generation](https://www.fastcompany.com/90432765/why-do-kids-want-to-be-influencers), and resulted in a reordering of values where old values like modesty and moderation gave way to exuberance and excess. The sum of these new hierarchies, values, and occupations is the creation of a new type of person.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8314158569618333},{"content":"Above all, don't forget - technology exists to serve man, the \"blessed machine\" exists to serve \"the crude biomass.\" Your brain is not a tool for stocking your notes, your notes are a tool for your brain. I don't write everything down in exegesis, I still read physical books, a good deal of my thinking gets done on pen and paper. If I forget something, I figure it's evolution's way of telling me it wasn't important.","parent":"posts/Second Brains-2-13-2021.txt","score":0.8311193957990848},{"content":"If you share some infrastructure that lets you play around with ideas quickly and also share them quickly, that solves the problem. Stuff like Repl.it does this, but I feel less of a sense of ownership over it.","parent":"posts/Fragments.txt","score":0.8277810641277802},{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8272683340689566},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains-2-13-2021.txt","score":0.8272218151377794},{"content":"Human beings can observe the conclusions that social science reach and modify their behavior, which can potentially render those conclusions invalid. This is a complete impossibility in the natural sciences - an atom cannot learn about atomic theories and change its behavior to invalidate those theories.","parent":"posts/untitled-10-11-2021.txt","score":0.8272030067181491},{"content":"Did the internet ruin my brain? No, I don't think either style of thinking is superior. Both have their place, and besides it's not like I'm incapable of linear thinking (I hope this essay is flowing in a somewhat logical manner!","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8263647103595645}]}