{"":[{"content":"Images","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8755930010386553},{"content":"Edit: 1/6/2021","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8686066054110362},{"content":"Conclusion","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8627111729312937},{"content":"Key Features","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8621480151447609},{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8593290080388},{"content":"Yes.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.859011141952105},{"content":"The club does 2 things.","parent":"posts/untitled-9-24-2021.txt","score":0.8589669169415844},{"content":"|___Practice Routine","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8583546625772834},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8577220980911441},{"content":"Code:","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.856649564390397},{"content":"Executing","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8556654491388678},{"content":"A minimap makes all of this accessible from anywhere. You can access it by clicking the green button at the bottom, or by pressing command K.","parent":"posts/Fragments.txt","score":0.8555190150006605},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8537043599402795},{"content":"Long Term goals","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8537012688171842},{"content":"Target Users","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8512910151541713},{"content":"Page tags","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8512275077312982},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8499151373626692},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8497861585687644},{"content":"[https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q](https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q)","parent":"posts/untitled-9-22-2021.txt","score":0.8497647970149683},{"content":"Namespaces","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8497010761916202}],"Some thoughts from this morning. Sitting in the Peet's cafe near the gym at UC Davis, listening to 80s synthwave. ":[{"content":"Some thoughts from this morning. Sitting in the Peet's cafe near the gym at UC Davis, listening to 80s synthwave.","parent":"posts/untitled-9-21-2021.txt","score":1.0000000000000002},{"content":"First day of school. Sitting in the UC Davis Coffee House for the first time in forever. Recently I've gone on a streak of listening to boomer music - yesterday I was listening to the Beatles, today I'm listening to Cream. [[music]]","parent":"posts/untitled-9-22-2021.txt","score":0.9052308608641845},{"content":"Sitting the UC Davis MU, listening to King Crimson.","parent":"posts/untitled-9-21-2021.txt","score":0.8717763408851938},{"content":"Felt good to be back at university, surrounded by other students. Just enjoying the feeling of walking across the quad, enjoying the morning sun, avoiding eye contact with people marketing their clubs, spotting a familiar face in a crowd, etc. etc.","parent":"posts/untitled-9-22-2021.txt","score":0.8483202419836079},{"content":"Sitting in the MU again, this time with a view of the quad. Listening to \"The Time of the Season\" by the Zombies.","parent":"posts/untitled-9-24-2021.txt","score":0.845389679319649},{"content":"Listening to music","parent":"posts/untitled-9-21-2021.txt","score":0.8424435976094987},{"content":"This morning I was listening to a podcast suggested by [[Linus Lee]] - Changelog. I don't usually listen to podcasts, but I have had good experiences with audiobooks in the past. It was nice being able to absorb information over breakfast without staring at a screen. The subject material was interesting; it was some CMU professor doing research on individual programmers and the myth of the \"10x developer.\"","parent":"posts/untitled-9-20-2021.txt","score":0.8400051263972576},{"content":"Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].","parent":"posts/untitled-9-24-2021.txt","score":0.83555093108592},{"content":"I looked up \"fast jazz\" on Spotify and it's not nearly fast enough. Maybe it's the red bull I had this morning.","parent":"posts/untitled-9-24-2021.txt","score":0.8300772221639523},{"content":"Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]]","parent":"posts/untitled-9-21-2021.txt","score":0.8284688158860766},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8268523468074537},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness-11-17-2021.txt","score":0.8265820241458125},{"content":"TikTok and [[synesthesia]]","parent":"posts/untitled-9-20-2021.txt","score":0.8239011768374763},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8229053191525855},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8197339953376489},{"content":"Consider two things I think to be missing from modern music: context and community. While its nothing compared to live music, I think certain Youtube videos capture these elements in a novel and exciting way.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8193530041522494},{"content":"I feel pretty good right now, so I want to write down how it feels, so I can feel this way more often.","parent":"posts/untitled-9-30-2021.txt","score":0.8192169723093282},{"content":"Here are a couple of my reflections on this year-long journey - about code, creativity, and life. I started writing these with the goal of making them \"reflections.\" I'm not sure how well I stuck to the theme, but isn't that the point of exegesis - to enable disorganized thought? You can read these in any order.","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8190781324101626},{"content":"As mentioned earlier, the modern experience of listening to music alone is completely novel - before technology, listening to music was always a social affair, unless you were playing music for yourself.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8186820519466373},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.8179640381260623}],"There's an argument to be made that education requires authority, because learning requires humility. My objection to this is that a learner's humility does not require an instructor's authority, and in fact oftentimes an instructor's authoritarian behavior has the opposite effect of inspiring prideful resistance. [[meta-acropolis]] [[ideas]] ":[{"content":"There's an argument to be made that education requires authority, because learning requires humility. My objection to this is that a learner's humility does not require an instructor's authority, and in fact oftentimes an instructor's authoritarian behavior has the opposite effect of inspiring prideful resistance. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"More broadly, I wonder if the authoritarian element of learning comes from the instructor-student relationship. Historically learning required an instructor and a student, but the internet has provided incredibly powerful tools for the autodidact. Could we live in a world where everyone taught themselves? [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.9079236961083965},{"content":"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8704969230549284},{"content":"Education and authoritarianism[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8637180243324841},{"content":"I've had some spirited debates on this subject, most recently with [[Jared]] of [[hyperlink-academy]]. I personally believe this is possible, but I've also heard very good arguments otherwise. The synthesis in my head is currently this: the instructor/student relationship is not neccessary, but a social learning environment is. To improve at something, we need to be around people better than ourselves, and a certain level of humility is required to learn from those better than ourselves. An instructor/student relationship is an institutionalized way to approximate this; how effective it is depends on the quality of the institution. I don't think it's the only way to achieve this however, and there are interesting experiments in cohort-based learning that could illustrate other ways to provide a social learning environment.[[meta-acropolis]] [[ideas]] [[Jared]] [[hyperlink-academy]]","parent":"posts/untitled-9-21-2021.txt","score":0.8632130397991833},{"content":"However I think I can also provide a principled argument against this \"anti-ego/pro-transcendental\" (albeit one that is also somewhat psychological). Along the lines of Nietzsche's argument, philosophy is deeply personal, and more often than not it reflects contingencies about the philosopher's personality rather than uncovering deep timeless truths. It seems to be the case that most philosophers who argue in favor of something transcendental and against the \"ego\" or \"personal identity\" are self-effacing individuals already. It's not like they'd be giving up much by renouncing their personal identities. Also, it's not particularly impressive for someone who's naturally humble to preach the virtues of humility - in a sense it seems like they're simply deifying aspects of their personality, rather than presenting a principled argument.","parent":"posts/untitled-2-6-2022.txt","score":0.837642847512015},{"content":"I have an instinctive negative reaction against any sort of philosophy that preaches against personal identity/ego. The psychological reason for this is probably that I am a proud person. [[personal-reflection]]","parent":"posts/untitled-2-6-2022.txt","score":0.8294091334800711},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.829309520152019},{"content":"On some level the underlying psychological drive behind bad minimalism is similar to the one of a slacking but intelligent student - the slacker thinks, \"I only studied 30 minutes and still got a C plus\" because he is scared of trying hard and still getting an unsatisfactory grade, the bad minimalist thinks, \"I only used flat designs to make my product and it looks presentable\" because he is scared that if he tries to make something beautiful he'll be ridiculed for it. It is an ego protection mechanism.","parent":"posts/Minimalism-6-8-2021.txt","score":0.8228174871795664},{"content":"The shift from normal school (Society of Discipline) to online school (Society of Control) back to normal school (Society of Discipline) has vividly illustrated the difference between the two. Tentatively, I'd say I say I prefer in person.","parent":"posts/untitled-9-30-2021.txt","score":0.8211579860701929},{"content":"Whether or not intelligence exists is a question for psychiatrists and their critics to fight over. My position is that it doesn't really matter, and that how much somebody cares about their work is far better approximation of how much value they provide than their intelligence.","parent":"posts/untitled-9-30-2021.txt","score":0.8151396437696925},{"content":"In the real world, it looks like the aesthetic frame of mind matters more. How much conviction someone has in their values affects their motivations for truths, with the result that we're functionally much smarter when working on things we care about, and probe unfathomable depths of stupidity when doing things we don't care about.","parent":"posts/untitled-9-30-2021.txt","score":0.8112707349517055},{"content":"An aesthetic/ethical frame of mind concerns itself with beauty and values. It cares not about the ability of the individual, but their conviction - how strongly they believe in the values they've subordinated themselves to.","parent":"posts/untitled-9-30-2021.txt","score":0.8080157763239348},{"content":"Human beings can observe the conclusions that social science reach and modify their behavior, which can potentially render those conclusions invalid. This is a complete impossibility in the natural sciences - an atom cannot learn about atomic theories and change its behavior to invalidate those theories.","parent":"posts/untitled-10-11-2021.txt","score":0.807603270398079},{"content":"In ethics, Rawls proposed the idea of the \"veil of justice\", where decision makers imagine they did not know their own position in society before making a decision. Here, someone blinds themselves to their own position for the sake of impartiality.","parent":"posts/Strategic blindness-11-17-2021.txt","score":0.8068124914829442},{"content":"I do think, however, that it's important to have priorities. In the first draft of this, I ordered each of those goals in a list of priorities from top to bottom, but I don't think that was a good way of looking at it. For one, a lot of them are highly related - for example, working on personal projects and learning to code.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8052314214640103},{"content":"Neither perspective is completely correct. The reality is that there is a tradeoff between the approach of creative collaboration and the approach of an auteur. What creative collaborators gain through specialization and the combination of talents, they lose in the fidelity of their ideas' expression; what the auteur loses through not being able to harness others' talents, he gains through the ability to express an idea to its fullest. Naturally, the more talents the auteur is able to accrue, the less he needs others, and the more worthwhile the tradeoff of solo work becomes.","parent":"posts/On auteurs and language-10-9-2021.txt","score":0.8029362841683213},{"content":"I've been introduced to the concept of inductive proofs multiple times but always had my doubts on how they *actually* worked. When my Number Theory professor brought up the topic again, I wondered if he'd finally address it, and he actually did. He was candidly honest about it - induction was more of a philosophical topic than a mathematical one, but as a purely mathematical phenomenon it's due to the axiomatic conventions that mathematicians abide by. That's it. It's axiomatic. I guess that was the expected answer, but it puts to rest a question I've had for a while.","parent":"posts/untitled-9-22-2021.txt","score":0.8024419158921502},{"content":"I made exegesis because I cannot organize. I struggle to organize my thoughts, I struggle to organize my belongings, I struggle to organize my priorities, I struggle to organize my life. Since Kindergarten, well meaning teachers have tried to help me stay organized to no avail; I have vivid memories of my 6th grade homeroom teacher holding me back during recess to help me organize my binder and desk, which were a mess of loose papers I had haphazardly shoved in. A failure to stay organized has been the proverbial monkey on my back for much of my life.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.802391951132744},{"content":"[[philosophy]] [[politics]] [[writing]] [[starred]]","parent":"posts/untitled-1-4-2022.txt","score":0.8020860838896336}],"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]] ":[{"content":"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"Education and authoritarianism[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8953468418140629},{"content":"More broadly, I wonder if the authoritarian element of learning comes from the instructor-student relationship. Historically learning required an instructor and a student, but the internet has provided incredibly powerful tools for the autodidact. Could we live in a world where everyone taught themselves? [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8871084944915361},{"content":"There's an argument to be made that education requires authority, because learning requires humility. My objection to this is that a learner's humility does not require an instructor's authority, and in fact oftentimes an instructor's authoritarian behavior has the opposite effect of inspiring prideful resistance. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8704969230549284},{"content":"Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8547017997444157},{"content":"In any case, it seems appropriate to begin [[meta-acropolis]], a project concerned with educational ontology with [[metaphysics]], the umbrella subject ontology is grouped under.","parent":"posts/untitled-1-4-2022.txt","score":0.8473282401840853},{"content":"I may take a typography class this quarter. It's not required for graduation, but I figure it could help me design better products, and maybe make [[exegesis]] look prettier.","parent":"posts/untitled-9-22-2021.txt","score":0.8467943573025606},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8403755221091993},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8401170701813871},{"content":"Finally, I want to take my studies more seriously. Next quarter, I am taking upper division classes on statistics for CS, databases, and information interfaces. I am especially excited about the database class, since database design problems were a big part of what I struggled with while building exegesis. I am also excited about the information interfaces class - exegesis is really just one giant information interface, isn't it? I cannot say I am excited about the stats class, I have never been fond of or good at math, but I will try to brave it with a stiff upper lip. I am considering posting my notes for these classes on [[exegesis]], so I can share them with classmates.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.839018405046996},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8369183185522004},{"content":"The shift from normal school (Society of Discipline) to online school (Society of Control) back to normal school (Society of Discipline) has vividly illustrated the difference between the two. Tentatively, I'd say I say I prefer in person.","parent":"posts/untitled-9-30-2021.txt","score":0.8360854598510048},{"content":"\"[Adam] Curtis attacks the internet because in his view it facilitates communities of solipsists, interpassive networks of like-minds who confirm, rather than challenge, each others' assumptions and prejudices.... Curtis' critique has a point, but it misses important dimensions of what is happening on the net. Contrary to Curtis' account of blogging, blogs can generate new discourse networks that have no correlate in the social field outside cyberspace.\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8357494826206224},{"content":"That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]]","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8356192596017887},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8332361335013685},{"content":"On some level the underlying psychological drive behind bad minimalism is similar to the one of a slacking but intelligent student - the slacker thinks, \"I only studied 30 minutes and still got a C plus\" because he is scared of trying hard and still getting an unsatisfactory grade, the bad minimalist thinks, \"I only used flat designs to make my product and it looks presentable\" because he is scared that if he tries to make something beautiful he'll be ridiculed for it. It is an ego protection mechanism.","parent":"posts/Minimalism-6-8-2021.txt","score":0.832900643724257},{"content":"I made exegesis because I cannot organize. I struggle to organize my thoughts, I struggle to organize my belongings, I struggle to organize my priorities, I struggle to organize my life. Since Kindergarten, well meaning teachers have tried to help me stay organized to no avail; I have vivid memories of my 6th grade homeroom teacher holding me back during recess to help me organize my binder and desk, which were a mess of loose papers I had haphazardly shoved in. A failure to stay organized has been the proverbial monkey on my back for much of my life.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8312330956691645},{"content":"I want to read more. I started reading a lot more in quarantine, but slowed down towards the end of 2020 because I was spending a lot more time on [[exegesis]]. Now that I have more time, I want to start a steady reading habit. The particular corner of [[twitter]] I hang around is fond of citing various philosophers and ideas, many of which I'm interested in, but have never taken the time to study closely. This year, I want to dig deeper into these ideas, go beyond surface-level Twitter philosophy memes and Youtube philosophy videos and read some proper primary sources. Around this time last year, I read Roger Scruton's A very short introduction to Kant. I want to tackle the Critique of Pure Reason sometime this year. I may live-blog my notes on exegesis (though I can't guarantee they'll be very good).","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8302908383870118},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8299518282350503},{"content":"I have an instinctive negative reaction against any sort of philosophy that preaches against personal identity/ego. The psychological reason for this is probably that I am a proud person. [[personal-reflection]]","parent":"posts/untitled-2-6-2022.txt","score":0.828415131100092}],"I've had some spirited debates on this subject, most recently with [[Jared]] of [[hyperlink-academy]]. I personally believe this is possible, but I've also heard very good arguments otherwise. The synthesis in my head is currently this: the instructor/student relationship is not neccessary, but a social learning environment is. To improve at something, we need to be around people better than ourselves, and a certain level of humility is required to learn from those better than ourselves. An instructor/student relationship is an institutionalized way to approximate this; how effective it is depends on the quality of the institution. I don't think it's the only way to achieve this however, and there are interesting experiments in cohort-based learning that could illustrate other ways to provide a social learning environment.[[meta-acropolis]] [[ideas]] [[Jared]] [[hyperlink-academy]] ":[{"content":"I've had some spirited debates on this subject, most recently with [[Jared]] of [[hyperlink-academy]]. I personally believe this is possible, but I've also heard very good arguments otherwise. The synthesis in my head is currently this: the instructor/student relationship is not neccessary, but a social learning environment is. To improve at something, we need to be around people better than ourselves, and a certain level of humility is required to learn from those better than ourselves. An instructor/student relationship is an institutionalized way to approximate this; how effective it is depends on the quality of the institution. I don't think it's the only way to achieve this however, and there are interesting experiments in cohort-based learning that could illustrate other ways to provide a social learning environment.[[meta-acropolis]] [[ideas]] [[Jared]] [[hyperlink-academy]]","parent":"posts/untitled-9-21-2021.txt","score":1.0000000000000002},{"content":"More broadly, I wonder if the authoritarian element of learning comes from the instructor-student relationship. Historically learning required an instructor and a student, but the internet has provided incredibly powerful tools for the autodidact. Could we live in a world where everyone taught themselves? [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.9016138586654928},{"content":"There's an argument to be made that education requires authority, because learning requires humility. My objection to this is that a learner's humility does not require an instructor's authority, and in fact oftentimes an instructor's authoritarian behavior has the opposite effect of inspiring prideful resistance. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8632130397991833},{"content":"Thinking as social","parent":"posts/untitled-9-24-2021.txt","score":0.8211304200701101},{"content":"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8188689179124494},{"content":"The shift from normal school (Society of Discipline) to online school (Society of Control) back to normal school (Society of Discipline) has vividly illustrated the difference between the two. Tentatively, I'd say I say I prefer in person.","parent":"posts/untitled-9-30-2021.txt","score":0.8153594395032313},{"content":"Neither perspective is completely correct. The reality is that there is a tradeoff between the approach of creative collaboration and the approach of an auteur. What creative collaborators gain through specialization and the combination of talents, they lose in the fidelity of their ideas' expression; what the auteur loses through not being able to harness others' talents, he gains through the ability to express an idea to its fullest. Naturally, the more talents the auteur is able to accrue, the less he needs others, and the more worthwhile the tradeoff of solo work becomes.","parent":"posts/On auteurs and language-10-9-2021.txt","score":0.8098905200308278},{"content":"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]]","parent":"posts/untitled-9-20-2021.txt","score":0.8041784699127001}],"Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]] ":[{"content":"Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.9999999999999999},{"content":"In any case, it seems appropriate to begin [[meta-acropolis]], a project concerned with educational ontology with [[metaphysics]], the umbrella subject ontology is grouped under.","parent":"posts/untitled-1-4-2022.txt","score":0.9084957336377686},{"content":"Education and authoritarianism[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8993018836561791},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8869324976056481},{"content":"The idea is to just make a ton of side projects and put them all here. I have some preliminary ideas on how I can organize this but I'm not particularly set on anything right now. I don't feel particularly limited by framework choice either - with the liberal use of iFrames, I can simply embed other projects using different frameworks here. I've already done that with a project I've created with Svelte.","parent":"posts/Fragments.txt","score":0.855381013828628},{"content":"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8547017997444157},{"content":"This site will be that infrastructure for me. It will be a place for me to play with ideas quickly.","parent":"posts/Fragments.txt","score":0.8544384486502576},{"content":"To make regular progress towards personal projects, I'll be writing more on my development progress with [[exegesis]], under the tag [[devlog]]. I'll also be publishing another post soon on my plans for future features, and when I expect to release them by. I will do something similar with my other projects.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8539669748493177},{"content":"[[Prometheus]]","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8534593594630216},{"content":"Could expand this into an [[essay]] eventually.","parent":"posts/untitled-1-4-2022.txt","score":0.8500201921868874},{"content":"Working on a refactor for [[exegesis]] and [[synesthesia]], thinking about how to budget time. Working strategy is to take estimate for each feature, and double the time for each to account for stupid roadblocks (wifi not working, interrupted by something, bad documentation, etc. etc.) [[code]] [[devlog]]","parent":"posts/untitled-9-21-2021.txt","score":0.8483550707625614},{"content":"Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].","parent":"posts/untitled-9-24-2021.txt","score":0.8463784168768533},{"content":"Page tags","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8462310387173982},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8456319540268241},{"content":"In fact, in the middle of an essay, I should be able to invent a UI component just to illustrate a point.\n\nEarly internet vibes.","parent":"posts/Fragments.txt","score":0.8456150024818332},{"content":"Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8448679738006997},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.842103015698334},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8398595463737526},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8396584611450717},{"content":"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8387774625885596}],"Budgeting time":[{"content":"Budgeting time","parent":"posts/untitled-9-21-2021.txt","score":0.9999999999999998},{"content":"Working on a refactor for [[exegesis]] and [[synesthesia]], thinking about how to budget time. Working strategy is to take estimate for each feature, and double the time for each to account for stupid roadblocks (wifi not working, interrupted by something, bad documentation, etc. etc.) [[code]] [[devlog]]","parent":"posts/untitled-9-21-2021.txt","score":0.8608378112848262},{"content":"School-time","parent":"posts/untitled-9-30-2021.txt","score":0.8313450603949359},{"content":"Actually, I'm not sure which I prefer yet. I have noticed, however, that sometimes I'll sit down to work for 2 hours, and proceed to waste it all, until the last 20 minutes or so, when I become desperate to get something done so the entire period wasn't a waste of time. That 20 minutes is often incredibly productive. When I only have pockets of 30 minute breaks throughout the day to work on a project, it's like every break is that last 20 minutes of a 2 hour work period. Or not, sometimes I end up getting nothing done, wishing I had 2 hours to do deep, focused work. [[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8227597591570152},{"content":"I'm taking a gap quarter this Spring to work on some personal projects. It is always better to have a plan than to have no plan, even if things don't work out your way, so here are some tentative goals for my gap quarter.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8215943912680985},{"content":"The steady rhythm of school and myriad 30-minute break periods it produces throughout the day have a good effect on my productivity, which is surprising. There's that famous [Paul Graham essay](http://www.paulgraham.com/makersschedule.html) where he talks about hacker schedules, or how programmers/creators prefer long periods of focused time over short fragmented work periods (that managers tend to prefer) because there's an overhead cost to loading a project into your head. [[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8156694971852999},{"content":"Long Term goals","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8155025328934274},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8114378405973712},{"content":"This project, too, has had a large effect on me - you can't work on something for a year and not have it affect you. I started this project sitting in a coffee shop; now I haven't sat in one for months. I know this sounds like navel gazing, but I've worked on this project through a pandemic, civil unrest, and statewide wildfires. Now it's finished, and I almost feel a little bittersweet releasing it.","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8083152375726511},{"content":"School being in session seems to change time itself, which now flows in hour-long increments marked by the streets flooding with bikes carrying students to their next classes. Even when I'm finished with classes, this hourly event event when the bike circles fill and students file in and out of the library leaves the aftertaste of school on everything.","parent":"posts/untitled-9-30-2021.txt","score":0.8077825726742685},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8027091506889886},{"content":"I think it's important to have free time to just mess around and be bored, and explore dumb things that might turn out to be not so dumb - after all, \"boredom is that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Every activity I eventually took seriously - Model UN in high school, programming in college - started out as an casual hobby I never planned to take seriously. So, I'd rather have slow progress towards my goals and a sizeable chunk of time to mess around, than to fill my days to the point where I have no time to explore at all.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8019836861619448},{"content":"The first is to focus in on the notetaking app, and charge a monthly subscription for additional features (I do want to keep the base version free). The second is to focus in on the blogging feature, and enable people to start their own paid networked newsletters (like Substack), then take a portion of those subscriptions. The last is to turn exegesis into a knowledge base for companies.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8001126283683879}],"Working on a refactor for [[exegesis]] and [[synesthesia]], thinking about how to budget time. Working strategy is to take estimate for each feature, and double the time for each to account for stupid roadblocks (wifi not working, interrupted by something, bad documentation, etc. etc.) [[code]] [[devlog]] ":[{"content":"Working on a refactor for [[exegesis]] and [[synesthesia]], thinking about how to budget time. Working strategy is to take estimate for each feature, and double the time for each to account for stupid roadblocks (wifi not working, interrupted by something, bad documentation, etc. etc.) [[code]] [[devlog]]","parent":"posts/untitled-9-21-2021.txt","score":0.9999999999999999},{"content":"I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]]","parent":"posts/untitled-9-24-2021.txt","score":0.8921696368099488},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8776446031009983},{"content":"The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8750910401328631},{"content":"Actually, I'm not sure which I prefer yet. I have noticed, however, that sometimes I'll sit down to work for 2 hours, and proceed to waste it all, until the last 20 minutes or so, when I become desperate to get something done so the entire period wasn't a waste of time. That 20 minutes is often incredibly productive. When I only have pockets of 30 minute breaks throughout the day to work on a project, it's like every break is that last 20 minutes of a 2 hour work period. Or not, sometimes I end up getting nothing done, wishing I had 2 hours to do deep, focused work. [[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8723671980227363},{"content":"Working on exegesis was a grueling affair at times. I rewrote the schema multiple times, rewrote the backend from scratch 2 months before release, chased countless UI bugs, and manually patched abandoned NPM packages. Part of it may have been due to my inexperience, but [working with ](https://nichwch.medium.com/making-yana-e3fade3f56e7)[rich text](https://medium.engineering/why-contenteditable-is-terrible-122d8a40e480) is just a [difficult task](https://twitter.com/thesephist/status/1360298464349999108), period. At one point, I considered giving up after finding a rival writing app I thought I simply couldn't compete with - I have a copy of an unfinished essay I started writing on why I had given up tucked away somewhere.","parent":"posts/Prometheus-2-13-2021.txt","score":0.8699748798688769},{"content":"To make regular progress towards personal projects, I'll be writing more on my development progress with [[exegesis]], under the tag [[devlog]]. I'll also be publishing another post soon on my plans for future features, and when I expect to release them by. I will do something similar with my other projects.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8676520804845836},{"content":"Budgeting time","parent":"posts/untitled-9-21-2021.txt","score":0.8608378112848262},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8605160900018309},{"content":"I've noticed a huge productivity problem for me is not being able to decompose tasks effectively. If I'm in a focused state of mind, this is easy and I can get work done. If I'm not, then something as simple as getting out of bed becomes difficult, because even getting out of bed constitutes a number of distinct tasks that need to be separated and ordered and then executed - physically getting out of bed, brushing my teeth, putting in my contacts, making breakfast, etc. etc. [[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8598650700612213},{"content":"Why did it take so long? Part of it is just a lack of experience. While making exegesis, I changed the database schema countless times, wrote dozens of migrations, accidentally wiped my database once (thank God for RDS backups), and rewrote the backend from scratch 2 months before release. There was also a good amount of feature creep. Whenever I thought I was close to finished, something unexpected would pop up - I started writing this essay 3 months before I actually released exegesis. Whatever the reason, if you count development time on the predecessor to exegesis, I've spent almost a tenth of my life building this. The entire project clocks in at a couple thousand lines of code. It is the largest, most complex, and most difficult thing I have built so far in my life.  [The last time I worked on a project this long, it was the first video game I made back in my senior year of high school.](https://medium.com/@nichwch/machine-gods-devlog-1-166dff474366) Even then, it was really about 6 months of development total, with a huge gap in between because of school, and it was all made with no-code game development tools, because back then the idea of using actual code terrified me. [[exegesis]] [[personal-reflection]]","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8596700370671253},{"content":"It is this property that allows programmers to cheat the Gods, and achieve divine levels of creative output thought forbidden to mortals. A programmer can create abstractions than enable them to create in days what previously took months. I myself rewrote a good part of exegesis 2 months before I released it, and the new abstractions I picked enabled me to redo in those 2 months what took me almost a year at first. Moreover, programmers can share their abstractions, and borrow the inventions of others as well.","parent":"posts/Prometheus-2-13-2021.txt","score":0.8592438607388528},{"content":"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8591199431306293},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8549841974266733},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8544594762875298},{"content":"I will write soon about my more long term goals for exegesis - both technical tasks I'd like to get done and my overall vision for the product.","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8542433053847432},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto-4-23-2020.txt","score":0.8539649244922194},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8532434668657141},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.8525119416877149},{"content":"I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.85204420453374}],"Listening to music":[{"content":"Listening to music","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"As mentioned earlier, the modern experience of listening to music alone is completely novel - before technology, listening to music was always a social affair, unless you were playing music for yourself.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.9133764209688788},{"content":"Music is everywhere. Thanks to portable electronics and streaming services, the average person has likely listened to more music than all their ancestors did, combined. Not only do we listen to more music, we have access to a wider array of it as well - for just ten dollars a month, you can get access to an unfathomably large library of music, containing everything from 17th century baroque clavichord pieces to zoomer hyperpop.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8978427458891919},{"content":"Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]]","parent":"posts/untitled-9-21-2021.txt","score":0.8952013412458247},{"content":"Something weird is happening here - we have access to more music and genres than ever before in human history, and yet it feels like something important is missing. Many of the people I talk to listen to music all the time, but I get the sense that it's more to ward off the dreaded experience of silence than it is to actually enjoy music.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.890014309579099},{"content":"Here's another difference between the way we experience music and the way our ancestors did: it used to be the case that music was almost always a social experience. Before technology, if you wanted to listen to music, someone had to play music. It was a special, ceremonious event. The modern experience of listening to music alone, all the time would have been incomprehensible to our ancestors.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8810105429010934},{"content":"Whether its noticing that two songs use the same chord progression, stealing a nice lick from your favorite blues guitarist, making a mashup of two of your favorite songs, or translating a song into a different genre, playing music is all about making connections. Unfortunately, the way we listen to music prevents us from doing this.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8803445371108355},{"content":"Music is about context. A song is never just a song, it contains all the circumstances that it was listened to under - whether you heard it live, the street you were walking down when you heard it, the mood you were in when you heard it, the people it made you think of, etc.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8775521366290024},{"content":"The pandemic has made things even worse. Before the pandemic, music could still be a social experience, in the form of live shows and concerts, but now it has become a completely solo activity. Without live music, most people experience music as the blank grey rows in their Spotify playlists.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8648795048113628},{"content":"Sitting the UC Davis MU, listening to King Crimson.","parent":"posts/untitled-9-21-2021.txt","score":0.8622105764963887},{"content":"First day of school. Sitting in the UC Davis Coffee House for the first time in forever. Recently I've gone on a streak of listening to boomer music - yesterday I was listening to the Beatles, today I'm listening to Cream. [[music]]","parent":"posts/untitled-9-22-2021.txt","score":0.8580089786940737},{"content":"|___Music Theory","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8576889422242963},{"content":"The main obstacle is the playlist. Playlists trap music and prevent listeners from creating rich connections between their songs - I will elaborate on this point later.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8515361042416393},{"content":"Consider two things I think to be missing from modern music: context and community. While its nothing compared to live music, I think certain Youtube videos capture these elements in a novel and exciting way.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8429314764354088},{"content":"Some thoughts from this morning. Sitting in the Peet's cafe near the gym at UC Davis, listening to 80s synthwave.","parent":"posts/untitled-9-21-2021.txt","score":0.8424435976094987},{"content":"I want to get better at music. I went to [[piano]] classes as a kid and never really enjoyed them or took them seriously. Now I regret it. I also picked up guitar over quarantine, and want to get into a regular practice regimen for both of these instruments. For piano, I want to learn jazz, and how to improvise - I can't say I have much interest in building up my classical repertoire. For guitar, my current plan is to learn the blues, because I hear that's the root of many musical genres, and maybe branch off into rock or jazz later. A short term goal for both instruments is to familiarize myself with their scales.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8421645505237857},{"content":"Here are a three things that are missing from the modern experience of music.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8366363490005307},{"content":"It's these details that we miss about music. A song should never just be a song, but on a streaming platform, that's all it can really be - just another row in a playlist.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8335511566420286},{"content":"TikTok has normalized tying music to everything - political messages, dances, jokes, short videos, etc. etc. Aiming to help do something similar with [[synesthesia]], but focused more on explicitly creative output.","parent":"posts/untitled-9-20-2021.txt","score":0.8310561646733646},{"content":"I fell in love with playing the guitar because it rewards this lack of an attention span. You can copy a riff in minutes. You can create a new riff in minutes. Picking up a guitar puts me in an instant flow state, because I can just screw around and play with ideas instantly. It feels like a REPL for musical ideas.","parent":"posts/Fragments.txt","score":0.8295684665429464}],"Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]] ":[{"content":"Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]]","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"Listening to music","parent":"posts/untitled-9-21-2021.txt","score":0.8952013412458247},{"content":"TikTok and [[synesthesia]]","parent":"posts/untitled-9-20-2021.txt","score":0.8828094803055835},{"content":"Right now I'm listening to [Something About Us by Daft Punk](https://open.spotify.com/track/1NeLwFETswx8Fzxl2AFl91?si=bc9f206d498e4fdd), which might have something to do with how I'm feeling. What if words aren't enough to express a certain feeling? What if it's only the conjunction of words, images, videos and music, combined not in a determinate order like a moving picture or video, but presented indeterminately, in some form resembling a moodboard? That's the thesis behind [[synesthesia]] (a project I'm working on that will be closely integrated with [[exegesis]]).","parent":"posts/untitled-9-30-2021.txt","score":0.8700834017724443},{"content":"TikTok has normalized tying music to everything - political messages, dances, jokes, short videos, etc. etc. Aiming to help do something similar with [[synesthesia]], but focused more on explicitly creative output.","parent":"posts/untitled-9-20-2021.txt","score":0.8646951506322138},{"content":"Whether its noticing that two songs use the same chord progression, stealing a nice lick from your favorite blues guitarist, making a mashup of two of your favorite songs, or translating a song into a different genre, playing music is all about making connections. Unfortunately, the way we listen to music prevents us from doing this.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8633040528057666},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8585452332998598},{"content":"I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]]","parent":"posts/untitled-9-24-2021.txt","score":0.8584097375040715},{"content":"Something weird is happening here - we have access to more music and genres than ever before in human history, and yet it feels like something important is missing. Many of the people I talk to listen to music all the time, but I get the sense that it's more to ward off the dreaded experience of silence than it is to actually enjoy music.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8576354596615856},{"content":"As mentioned earlier, the modern experience of listening to music alone is completely novel - before technology, listening to music was always a social affair, unless you were playing music for yourself.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8551437894163847},{"content":"The main obstacle is the playlist. Playlists trap music and prevent listeners from creating rich connections between their songs - I will elaborate on this point later.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8470488447992622},{"content":"Music is everywhere. Thanks to portable electronics and streaming services, the average person has likely listened to more music than all their ancestors did, combined. Not only do we listen to more music, we have access to a wider array of it as well - for just ten dollars a month, you can get access to an unfathomably large library of music, containing everything from 17th century baroque clavichord pieces to zoomer hyperpop.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8464344602086329},{"content":"Music is about context. A song is never just a song, it contains all the circumstances that it was listened to under - whether you heard it live, the street you were walking down when you heard it, the mood you were in when you heard it, the people it made you think of, etc.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8449027386348307},{"content":"Working on a refactor for [[exegesis]] and [[synesthesia]], thinking about how to budget time. Working strategy is to take estimate for each feature, and double the time for each to account for stupid roadblocks (wifi not working, interrupted by something, bad documentation, etc. etc.) [[code]] [[devlog]]","parent":"posts/untitled-9-21-2021.txt","score":0.8440258339990112},{"content":"Consider two things I think to be missing from modern music: context and community. While its nothing compared to live music, I think certain Youtube videos capture these elements in a novel and exciting way.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8409739343249164},{"content":"I fell in love with playing the guitar because it rewards this lack of an attention span. You can copy a riff in minutes. You can create a new riff in minutes. Picking up a guitar puts me in an instant flow state, because I can just screw around and play with ideas instantly. It feels like a REPL for musical ideas.","parent":"posts/Fragments.txt","score":0.8408228624123109},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8396664105880546},{"content":"|___Music Theory","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8384179321801045},{"content":"I've noticed a huge productivity problem for me is not being able to decompose tasks effectively. If I'm in a focused state of mind, this is easy and I can get work done. If I'm not, then something as simple as getting out of bed becomes difficult, because even getting out of bed constitutes a number of distinct tasks that need to be separated and ordered and then executed - physically getting out of bed, brushing my teeth, putting in my contacts, making breakfast, etc. etc. [[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8382461343353523},{"content":"The pandemic has made things even worse. Before the pandemic, music could still be a social experience, in the form of live shows and concerts, but now it has become a completely solo activity. Without live music, most people experience music as the blank grey rows in their Spotify playlists.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8378358722047017}],"Sitting the UC Davis MU, listening to King Crimson.":[{"content":"Sitting the UC Davis MU, listening to King Crimson.","parent":"posts/untitled-9-21-2021.txt","score":1.0000000000000002},{"content":"First day of school. Sitting in the UC Davis Coffee House for the first time in forever. Recently I've gone on a streak of listening to boomer music - yesterday I was listening to the Beatles, today I'm listening to Cream. [[music]]","parent":"posts/untitled-9-22-2021.txt","score":0.8761129675760588},{"content":"Some thoughts from this morning. Sitting in the Peet's cafe near the gym at UC Davis, listening to 80s synthwave.","parent":"posts/untitled-9-21-2021.txt","score":0.8717763408851938},{"content":"Listening to music","parent":"posts/untitled-9-21-2021.txt","score":0.8622105764963887},{"content":"Sitting in the MU again, this time with a view of the quad. Listening to \"The Time of the Season\" by the Zombies.","parent":"posts/untitled-9-24-2021.txt","score":0.848314012101925},{"content":"As mentioned earlier, the modern experience of listening to music alone is completely novel - before technology, listening to music was always a social affair, unless you were playing music for yourself.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8271049825587724},{"content":"Felt good to be back at university, surrounded by other students. Just enjoying the feeling of walking across the quad, enjoying the morning sun, avoiding eye contact with people marketing their clubs, spotting a familiar face in a crowd, etc. etc.","parent":"posts/untitled-9-22-2021.txt","score":0.821899485811605},{"content":"___Guitar","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8182864197092421},{"content":"Music is everywhere. Thanks to portable electronics and streaming services, the average person has likely listened to more music than all their ancestors did, combined. Not only do we listen to more music, we have access to a wider array of it as well - for just ten dollars a month, you can get access to an unfathomably large library of music, containing everything from 17th century baroque clavichord pieces to zoomer hyperpop.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.81809465524419},{"content":"Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]]","parent":"posts/untitled-9-21-2021.txt","score":0.8160483190708621},{"content":"|___Music Theory","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8125798739715107},{"content":"I want my computer to feel like my guitar. I want it to feel like I can noodle here.","parent":"posts/Fragments.txt","score":0.8101430076860903},{"content":"Fast Jazz","parent":"posts/untitled-9-24-2021.txt","score":0.8095188872758581},{"content":"|___Guitar Goals","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.808782642112788},{"content":"I have not really settled into a good practice schedule for either piano or guitar. For the past couple of weeks, I've neglected guitar after moving my electric keyboard into my room, though my piano progress has hardly been good either - I have spent the past couple months playing the same pentatonic licks over Autumn Leaves. My goal for both instruments is to learn a couple of jazz standards with my housemates so we can jam together more.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8084805165600639},{"content":"Finally, I want to take my studies more seriously. Next quarter, I am taking upper division classes on statistics for CS, databases, and information interfaces. I am especially excited about the database class, since database design problems were a big part of what I struggled with while building exegesis. I am also excited about the information interfaces class - exegesis is really just one giant information interface, isn't it? I cannot say I am excited about the stats class, I have never been fond of or good at math, but I will try to brave it with a stiff upper lip. I am considering posting my notes for these classes on [[exegesis]], so I can share them with classmates.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.808010577001291},{"content":"Something weird is happening here - we have access to more music and genres than ever before in human history, and yet it feels like something important is missing. Many of the people I talk to listen to music all the time, but I get the sense that it's more to ward off the dreaded experience of silence than it is to actually enjoy music.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8071075917536583},{"content":"Consider two things I think to be missing from modern music: context and community. While its nothing compared to live music, I think certain Youtube videos capture these elements in a novel and exciting way.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8065035789669429},{"content":"I want to get better at music. I went to [[piano]] classes as a kid and never really enjoyed them or took them seriously. Now I regret it. I also picked up guitar over quarantine, and want to get into a regular practice regimen for both of these instruments. For piano, I want to learn jazz, and how to improvise - I can't say I have much interest in building up my classical repertoire. For guitar, my current plan is to learn the blues, because I hear that's the root of many musical genres, and maybe branch off into rock or jazz later. A short term goal for both instruments is to familiarize myself with their scales.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8052916416293955},{"content":"I received a harmonica for my birthday. So far, I can play Oh Susannah, but I'd like to learn more.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8047359316686196}],"Yesterday I picked up a copy of [[Habermas]], a very short introduction at a used bookstore, because I recognized the name and it was $2.50 (my bookshelf is littered with books I purchased for similar reasons). The last book I read in the series was the very short introduction to Kant by Roger Scruton, which I enjoyed thoroughly. ":[{"content":"Yesterday I picked up a copy of [[Habermas]], a very short introduction at a used bookstore, because I recognized the name and it was $2.50 (my bookshelf is littered with books I purchased for similar reasons). The last book I read in the series was the very short introduction to Kant by Roger Scruton, which I enjoyed thoroughly.","parent":"posts/untitled-9-21-2021.txt","score":1.0000000000000002},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8862759785499377},{"content":"I want to read more. I started reading a lot more in quarantine, but slowed down towards the end of 2020 because I was spending a lot more time on [[exegesis]]. Now that I have more time, I want to start a steady reading habit. The particular corner of [[twitter]] I hang around is fond of citing various philosophers and ideas, many of which I'm interested in, but have never taken the time to study closely. This year, I want to dig deeper into these ideas, go beyond surface-level Twitter philosophy memes and Youtube philosophy videos and read some proper primary sources. Around this time last year, I read Roger Scruton's A very short introduction to Kant. I want to tackle the Critique of Pure Reason sometime this year. I may live-blog my notes on exegesis (though I can't guarantee they'll be very good).","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8742769577439332},{"content":"My aim in reading [[philosophy]] is more for general intellectual enrichment and to provide insights into my work, not philosophy for its own sake, so I feel fine with reading summaries as opposed to heavy primary literature (except where the primary literature interests me). For thinkers who are influential that don't interest me very much (like Kant), I've found summaries from the very short series and the Stanford Encyclopedia of Philosophy to be very helpful.","parent":"posts/untitled-9-21-2021.txt","score":0.8736986739916927},{"content":"Habermas","parent":"posts/untitled-9-21-2021.txt","score":0.8680951825630859},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8617409545488957},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.8592170215470193},{"content":"Naturally, [[Habermas]]'s thoughts on the public sphere - which referred to salons, coffee shops and other public spaces in his day, and probably the internet today - are relevant to the social features of [[exegesis]].","parent":"posts/untitled-9-21-2021.txt","score":0.8576813175020694},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8530580721163139},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8529372635985326},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8405595584243086},{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.8350991938071374},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness-11-17-2021.txt","score":0.8321261855818817},{"content":"I haven't enjoyed reading something this much in a while. Usually I struggle to read more than 10 pages of something at a time, but I found this really engaging. Feels like the right level of philosophical sophistication for me right now - the concepts are comprehensible but still challenging and novel, and the biographical element adds a level of allure as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8314866928695265},{"content":"We are all familiar with the structure of a traditional nonfiction book - it is organized into chapters, separated topically, and each of those chapters consists of smaller subsections, each composed of paragraphs that introduce ideas in a linear and logical fashion. You read a book from start to end.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8302541910996675},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8300162181864232},{"content":"I could not help but find this extraordinarily similar to what the protagonist and narrator of [[Zen and the Art of Motorcycle Repair]] goes through - he starts as a scientist, looks for justifications for science in philosophy, becomes frustrated with philosophy and eventually embraces esotericism before going insane. The instrumental rationality that the Critical Theorists disliked seems roughly equivalent to the \"classical rationality\" Phaedrus talks about in [[Zen and the Art of Motorcycle Repair]] as well.","parent":"posts/untitled-9-21-2021.txt","score":0.8279910382608372},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8261706890308812},{"content":"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.826136724210601},{"content":"Finished Capitalist Realism","parent":"posts/untitled-9-20-2021.txt","score":0.8249471760810089}],"Habermas":[{"content":"Habermas","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"Yesterday I picked up a copy of [[Habermas]], a very short introduction at a used bookstore, because I recognized the name and it was $2.50 (my bookshelf is littered with books I purchased for similar reasons). The last book I read in the series was the very short introduction to Kant by Roger Scruton, which I enjoyed thoroughly.","parent":"posts/untitled-9-21-2021.txt","score":0.8680951825630859},{"content":"Naturally, [[Habermas]]'s thoughts on the public sphere - which referred to salons, coffee shops and other public spaces in his day, and probably the internet today - are relevant to the social features of [[exegesis]].","parent":"posts/untitled-9-21-2021.txt","score":0.8610583345319137},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8547913151118045},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8478648378969952},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.846800309189196},{"content":"Images","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8033243956527903}],"Afternoon":[{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"Images","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8341250131204},{"content":"First day of classes","parent":"posts/untitled-9-22-2021.txt","score":0.8303116735669926},{"content":"|___Practice Routine","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8301714703030415},{"content":"Some thoughts from this morning. Sitting in the Peet's cafe near the gym at UC Davis, listening to 80s synthwave.","parent":"posts/untitled-9-21-2021.txt","score":0.8268523468074537},{"content":"School-time","parent":"posts/untitled-9-30-2021.txt","score":0.8228795084630581},{"content":"First day of school. Sitting in the UC Davis Coffee House for the first time in forever. Recently I've gone on a streak of listening to boomer music - yesterday I was listening to the Beatles, today I'm listening to Cream. [[music]]","parent":"posts/untitled-9-22-2021.txt","score":0.8222485142329977},{"content":"Actually, I'm not sure which I prefer yet. I have noticed, however, that sometimes I'll sit down to work for 2 hours, and proceed to waste it all, until the last 20 minutes or so, when I become desperate to get something done so the entire period wasn't a waste of time. That 20 minutes is often incredibly productive. When I only have pockets of 30 minute breaks throughout the day to work on a project, it's like every break is that last 20 minutes of a 2 hour work period. Or not, sometimes I end up getting nothing done, wishing I had 2 hours to do deep, focused work. [[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8216164877370381},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8172507512613866},{"content":"School being in session seems to change time itself, which now flows in hour-long increments marked by the streets flooding with bikes carrying students to their next classes. Even when I'm finished with classes, this hourly event event when the bike circles fill and students file in and out of the library leaves the aftertaste of school on everything.","parent":"posts/untitled-9-30-2021.txt","score":0.8169699559339129},{"content":"Sitting in the MU again, this time with a view of the quad. Listening to \"The Time of the Season\" by the Zombies.","parent":"posts/untitled-9-24-2021.txt","score":0.8153314919774786},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8152561654092996},{"content":"Felt good to be back at university, surrounded by other students. Just enjoying the feeling of walking across the quad, enjoying the morning sun, avoiding eye contact with people marketing their clubs, spotting a familiar face in a crowd, etc. etc.","parent":"posts/untitled-9-22-2021.txt","score":0.8124324901698294},{"content":"Conclusion","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.812259121003025},{"content":"I feel pretty good right now, so I want to write down how it feels, so I can feel this way more often.","parent":"posts/untitled-9-30-2021.txt","score":0.8117940775857047},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.811764801964782},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8114233386975936},{"content":"Could expand this into an [[essay]] eventually.","parent":"posts/untitled-1-4-2022.txt","score":0.8094813389451836},{"content":"[https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q](https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q)","parent":"posts/untitled-9-22-2021.txt","score":0.8093323555433236},{"content":"|\t\t|___Songs to Practice","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8092567638474184}],"More broadly, I wonder if the authoritarian element of learning comes from the instructor-student relationship. Historically learning required an instructor and a student, but the internet has provided incredibly powerful tools for the autodidact. Could we live in a world where everyone taught themselves? [[meta-acropolis]] [[ideas]] ":[{"content":"More broadly, I wonder if the authoritarian element of learning comes from the instructor-student relationship. Historically learning required an instructor and a student, but the internet has provided incredibly powerful tools for the autodidact. Could we live in a world where everyone taught themselves? [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.9999999999999998},{"content":"There's an argument to be made that education requires authority, because learning requires humility. My objection to this is that a learner's humility does not require an instructor's authority, and in fact oftentimes an instructor's authoritarian behavior has the opposite effect of inspiring prideful resistance. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.9079236961083965},{"content":"I've had some spirited debates on this subject, most recently with [[Jared]] of [[hyperlink-academy]]. I personally believe this is possible, but I've also heard very good arguments otherwise. The synthesis in my head is currently this: the instructor/student relationship is not neccessary, but a social learning environment is. To improve at something, we need to be around people better than ourselves, and a certain level of humility is required to learn from those better than ourselves. An instructor/student relationship is an institutionalized way to approximate this; how effective it is depends on the quality of the institution. I don't think it's the only way to achieve this however, and there are interesting experiments in cohort-based learning that could illustrate other ways to provide a social learning environment.[[meta-acropolis]] [[ideas]] [[Jared]] [[hyperlink-academy]]","parent":"posts/untitled-9-21-2021.txt","score":0.9016138586654928},{"content":"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8871084944915361},{"content":"Education and authoritarianism[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8853069094117734},{"content":"The shift from normal school (Society of Discipline) to online school (Society of Control) back to normal school (Society of Discipline) has vividly illustrated the difference between the two. Tentatively, I'd say I say I prefer in person.","parent":"posts/untitled-9-30-2021.txt","score":0.853795226609949},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8392126627237882},{"content":"Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8339970649759672},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots-2-28-2021.txt","score":0.8307918339840346},{"content":"In any case, it seems appropriate to begin [[meta-acropolis]], a project concerned with educational ontology with [[metaphysics]], the umbrella subject ontology is grouped under.","parent":"posts/untitled-1-4-2022.txt","score":0.8277660756893481},{"content":"Did the internet ruin my brain? No, I don't think either style of thinking is superior. Both have their place, and besides it's not like I'm incapable of linear thinking (I hope this essay is flowing in a somewhat logical manner!","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8213615944154096},{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8211723275971624},{"content":"Learning Javascript, I never took notes, because all the reference docs were online anyways. Besides, the difficult part of programming isn't remembering APIs, it's the process of taking an idea and building it out, and there's no way to get better at that except by building. There's a reason most university CS courses don't test memorization heavily and instead focus on having students build projects. I suspect this is true for a lot of subjects.","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8177658531806312},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8159129658282812},{"content":"On some level the underlying psychological drive behind bad minimalism is similar to the one of a slacking but intelligent student - the slacker thinks, \"I only studied 30 minutes and still got a C plus\" because he is scared of trying hard and still getting an unsatisfactory grade, the bad minimalist thinks, \"I only used flat designs to make my product and it looks presentable\" because he is scared that if he tries to make something beautiful he'll be ridiculed for it. It is an ego protection mechanism.","parent":"posts/Minimalism-6-8-2021.txt","score":0.8145856469234797},{"content":"Some thoughts on my Operating Systems course.","parent":"posts/untitled-10-11-2021.txt","score":0.8138471143358307},{"content":"If you share some infrastructure that lets you play around with ideas quickly and also share them quickly, that solves the problem. Stuff like Repl.it does this, but I feel less of a sense of ownership over it.","parent":"posts/Fragments.txt","score":0.8121054600518078},{"content":"Neither perspective is completely correct. The reality is that there is a tradeoff between the approach of creative collaboration and the approach of an auteur. What creative collaborators gain through specialization and the combination of talents, they lose in the fidelity of their ideas' expression; what the auteur loses through not being able to harness others' talents, he gains through the ability to express an idea to its fullest. Naturally, the more talents the auteur is able to accrue, the less he needs others, and the more worthwhile the tradeoff of solo work becomes.","parent":"posts/On auteurs and language-10-9-2021.txt","score":0.8119650544517102},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.810990415465965},{"content":"The world cannot be distilled into neat, concrete categories. Neither can your thoughts. Isn't it time your notes got a little messier?","parent":"posts/Manifesto-4-23-2020.txt","score":0.8107590341133165}],"My aim in reading [[philosophy]] is more for general intellectual enrichment and to provide insights into my work, not philosophy for its own sake, so I feel fine with reading summaries as opposed to heavy primary literature (except where the primary literature interests me). For thinkers who are influential that don't interest me very much (like Kant), I've found summaries from the very short series and the Stanford Encyclopedia of Philosophy to be very helpful. ":[{"content":"My aim in reading [[philosophy]] is more for general intellectual enrichment and to provide insights into my work, not philosophy for its own sake, so I feel fine with reading summaries as opposed to heavy primary literature (except where the primary literature interests me). For thinkers who are influential that don't interest me very much (like Kant), I've found summaries from the very short series and the Stanford Encyclopedia of Philosophy to be very helpful.","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"I want to read more. I started reading a lot more in quarantine, but slowed down towards the end of 2020 because I was spending a lot more time on [[exegesis]]. Now that I have more time, I want to start a steady reading habit. The particular corner of [[twitter]] I hang around is fond of citing various philosophers and ideas, many of which I'm interested in, but have never taken the time to study closely. This year, I want to dig deeper into these ideas, go beyond surface-level Twitter philosophy memes and Youtube philosophy videos and read some proper primary sources. Around this time last year, I read Roger Scruton's A very short introduction to Kant. I want to tackle the Critique of Pure Reason sometime this year. I may live-blog my notes on exegesis (though I can't guarantee they'll be very good).","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.9015920528487116},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8956984481248489},{"content":"Yesterday I picked up a copy of [[Habermas]], a very short introduction at a used bookstore, because I recognized the name and it was $2.50 (my bookshelf is littered with books I purchased for similar reasons). The last book I read in the series was the very short introduction to Kant by Roger Scruton, which I enjoyed thoroughly.","parent":"posts/untitled-9-21-2021.txt","score":0.8736986739916927},{"content":"To be sure, he thinks there are different respects in which an ontological theory can be simple - so both physicalist, phenomenalist, and Platonic ontologies can all be worth developing. On this matter I agree with him.","parent":"posts/untitled-1-4-2022.txt","score":0.8620648364329248},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8602848804584787},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8597090538401208},{"content":"However, I think there is something understated here, a point he makes briefly that I think is worth exploring further - that what ontology we adopt corresponds to \"our various interests and purposes.\"","parent":"posts/untitled-1-4-2022.txt","score":0.8523559175872619},{"content":"[[philosophy]] [[politics]] [[writing]] [[starred]]","parent":"posts/untitled-1-4-2022.txt","score":0.8500024210991131},{"content":"What do I use [[exegesis]] for? I use it like a journal. I write down thoughts about my life, ideas that I have, things that I'd like to do, reflections on my day, etc. etc. None of these things could be called knowledge, none of them could be called rational.","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8492192063675149},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8477216985921481},{"content":"For reading, I read whatever I want, whenever I want. I do think setting a goal of reading at least 5 times a week wouldn't hurt, however.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8451945135515357},{"content":"In other words, I don't use [[exegesis]] as a PKM at all, because very little of what I write in exegesis could be considered \"knowledge.\" I don't use it as a memory aide either, because when I'm learning something I almost never take notes. Instead, it's a way for me to form connections between ideas and reflections that I have. It's a tool for creative thought.","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8448931411817945},{"content":"The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8442240802777526},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8438697905406554},{"content":"In any case, it seems appropriate to begin [[meta-acropolis]], a project concerned with educational ontology with [[metaphysics]], the umbrella subject ontology is grouped under.","parent":"posts/untitled-1-4-2022.txt","score":0.8435843913568006},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8421530107314308},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8412060637787969},{"content":"We are all familiar with the structure of a traditional nonfiction book - it is organized into chapters, separated topically, and each of those chapters consists of smaller subsections, each composed of paragraphs that introduce ideas in a linear and logical fashion. You read a book from start to end.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8409835405980173},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness-11-17-2021.txt","score":0.8404436098100916}],"Education and authoritarianism[[meta-acropolis]] [[ideas]] ":[{"content":"Education and authoritarianism[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":1.0000000000000002},{"content":"Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8993018836561791},{"content":"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8953468418140629},{"content":"In any case, it seems appropriate to begin [[meta-acropolis]], a project concerned with educational ontology with [[metaphysics]], the umbrella subject ontology is grouped under.","parent":"posts/untitled-1-4-2022.txt","score":0.8894082760743345},{"content":"More broadly, I wonder if the authoritarian element of learning comes from the instructor-student relationship. Historically learning required an instructor and a student, but the internet has provided incredibly powerful tools for the autodidact. Could we live in a world where everyone taught themselves? [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8853069094117734},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8710686508021024},{"content":"There's an argument to be made that education requires authority, because learning requires humility. My objection to this is that a learner's humility does not require an instructor's authority, and in fact oftentimes an instructor's authoritarian behavior has the opposite effect of inspiring prideful resistance. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8637180243324841},{"content":"[[philosophy]] [[politics]] [[writing]] [[starred]]","parent":"posts/untitled-1-4-2022.txt","score":0.8594207626490572},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.848221694163012},{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.8466560928082584},{"content":"[[Manifesto]]","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8456175753688333},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8358407874791756},{"content":"Could expand this into an [[essay]] eventually.","parent":"posts/untitled-1-4-2022.txt","score":0.8354008167257679},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8344553234492549},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8315917042979399},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8303479781451094},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8302346903045629},{"content":"[[Quine]] is a \"formalist\" with regards to ontological theories. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8292270781928839},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8270351594341663},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.82696396043185}],"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.":[{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.9195441298973076},{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.8913138637844572},{"content":"Yesterday I picked up a copy of [[Habermas]], a very short introduction at a used bookstore, because I recognized the name and it was $2.50 (my bookshelf is littered with books I purchased for similar reasons). The last book I read in the series was the very short introduction to Kant by Roger Scruton, which I enjoyed thoroughly.","parent":"posts/untitled-9-21-2021.txt","score":0.8862759785499377},{"content":"Naturally, [[Habermas]]'s thoughts on the public sphere - which referred to salons, coffee shops and other public spaces in his day, and probably the internet today - are relevant to the social features of [[exegesis]].","parent":"posts/untitled-9-21-2021.txt","score":0.8853537956109886},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.8790982772495153},{"content":"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8672534389000164},{"content":"Finished Capitalist Realism","parent":"posts/untitled-9-20-2021.txt","score":0.8652323083481256},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8650091134781682},{"content":"Habermas","parent":"posts/untitled-9-21-2021.txt","score":0.8547913151118045},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.850455264137117},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8471845756313903},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8454572539708556},{"content":"Fischer on possibility","parent":"posts/untitled-9-20-2021.txt","score":0.8438456933325879},{"content":"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.","parent":"posts/untitled-9-20-2021.txt","score":0.8402281760148208},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8376090833857308},{"content":"\"[Adam] Curtis attacks the internet because in his view it facilitates communities of solipsists, interpassive networks of like-minds who confirm, rather than challenge, each others' assumptions and prejudices.... Curtis' critique has a point, but it misses important dimensions of what is happening on the net. Contrary to Curtis' account of blogging, blogs can generate new discourse networks that have no correlate in the social field outside cyberspace.\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8350800879705036},{"content":"[[philosophy]] [[politics]] [[writing]] [[starred]]","parent":"posts/untitled-1-4-2022.txt","score":0.834267356038102},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8307387194897002},{"content":"2. My critique here is nothing original - it echoes a lot of what Andy [[Matuschak]] and [[Linus Lee]] have touched upon in their essays. Here's a brief excerpt from [Linus' blog post](https://thesephist.com/posts/browser/) that expresses the point more eloquently:","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8306333047591813}],"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism). ":[{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.9195441298973076},{"content":"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8816869680022076},{"content":"Naturally, [[Habermas]]'s thoughts on the public sphere - which referred to salons, coffee shops and other public spaces in his day, and probably the internet today - are relevant to the social features of [[exegesis]].","parent":"posts/untitled-9-21-2021.txt","score":0.8797165753893392},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8772512605936802},{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.8641323330524773},{"content":"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.","parent":"posts/untitled-9-20-2021.txt","score":0.8584077530134246},{"content":"Fischer on possibility","parent":"posts/untitled-9-20-2021.txt","score":0.8563086749585019},{"content":"Yesterday I picked up a copy of [[Habermas]], a very short introduction at a used bookstore, because I recognized the name and it was $2.50 (my bookshelf is littered with books I purchased for similar reasons). The last book I read in the series was the very short introduction to Kant by Roger Scruton, which I enjoyed thoroughly.","parent":"posts/untitled-9-21-2021.txt","score":0.8530580721163139},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8513962737140535},{"content":"Education and authoritarianism[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.848221694163012},{"content":"Habermas","parent":"posts/untitled-9-21-2021.txt","score":0.8478648378969952},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8474134241400256},{"content":"[[philosophy]] [[politics]] [[writing]] [[starred]]","parent":"posts/untitled-1-4-2022.txt","score":0.8472656703499947},{"content":"[[Manifesto]]","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8446910227218977},{"content":"If you share some infrastructure that lets you play around with ideas quickly and also share them quickly, that solves the problem. Stuff like Repl.it does this, but I feel less of a sense of ownership over it.","parent":"posts/Fragments.txt","score":0.8431046137522717},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.8430531551569684},{"content":"Finished Capitalist Realism","parent":"posts/untitled-9-20-2021.txt","score":0.8420267973943428},{"content":"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8401170701813871},{"content":"To be sure, he thinks there are different respects in which an ontological theory can be simple - so both physicalist, phenomenalist, and Platonic ontologies can all be worth developing. On this matter I agree with him.","parent":"posts/untitled-1-4-2022.txt","score":0.8394673451032779}],"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic. ":[{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":1.0000000000000002},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8790982772495153},{"content":"It's like an excess of rationality always ends eating itself. Those who take rationality serious enough end up directing rational criticism at rationality itself - a dynamic similar to what [[Nietzsche]] thought had happened to Christianity (that Christianity bore the value of truth-seeking, which ended up being turned against it).","parent":"posts/untitled-9-21-2021.txt","score":0.8635311757495401},{"content":"I could not help but find this extraordinarily similar to what the protagonist and narrator of [[Zen and the Art of Motorcycle Repair]] goes through - he starts as a scientist, looks for justifications for science in philosophy, becomes frustrated with philosophy and eventually embraces esotericism before going insane. The instrumental rationality that the Critical Theorists disliked seems roughly equivalent to the \"classical rationality\" Phaedrus talks about in [[Zen and the Art of Motorcycle Repair]] as well.","parent":"posts/untitled-9-21-2021.txt","score":0.8631356951721226},{"content":"Yesterday I picked up a copy of [[Habermas]], a very short introduction at a used bookstore, because I recognized the name and it was $2.50 (my bookshelf is littered with books I purchased for similar reasons). The last book I read in the series was the very short introduction to Kant by Roger Scruton, which I enjoyed thoroughly.","parent":"posts/untitled-9-21-2021.txt","score":0.8592170215470193},{"content":"Rational men at war with rationality","parent":"posts/untitled-9-21-2021.txt","score":0.8591771933743565},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8548672391337206},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8494945223452431},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8475767342433339},{"content":"Habermas","parent":"posts/untitled-9-21-2021.txt","score":0.846800309189196},{"content":"Naturally, [[Habermas]]'s thoughts on the public sphere - which referred to salons, coffee shops and other public spaces in his day, and probably the internet today - are relevant to the social features of [[exegesis]].","parent":"posts/untitled-9-21-2021.txt","score":0.8454323855094077},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8431319823312348},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8430531551569684},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8376291056583642},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.836713597263432},{"content":"Human beings can observe the conclusions that social science reach and modify their behavior, which can potentially render those conclusions invalid. This is a complete impossibility in the natural sciences - an atom cannot learn about atomic theories and change its behavior to invalidate those theories.","parent":"posts/untitled-10-11-2021.txt","score":0.8360474658880612},{"content":"[[Quine]] is a \"formalist\" with regards to ontological theories. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8336864815428908},{"content":"[[philosophy]] [[politics]] [[writing]] [[starred]]","parent":"posts/untitled-1-4-2022.txt","score":0.8333828195878707},{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.8315491359498769},{"content":"It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]]","parent":"posts/untitled-9-21-2021.txt","score":0.8300050182903465}],"Rational men at war with rationality":[{"content":"Rational men at war with rationality","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8617326131665632},{"content":"It's like an excess of rationality always ends eating itself. Those who take rationality serious enough end up directing rational criticism at rationality itself - a dynamic similar to what [[Nietzsche]] thought had happened to Christianity (that Christianity bore the value of truth-seeking, which ended up being turned against it).","parent":"posts/untitled-9-21-2021.txt","score":0.86042514983339},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.8591771933743565},{"content":"It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]]","parent":"posts/untitled-9-21-2021.txt","score":0.8488953917104434},{"content":"I could not help but find this extraordinarily similar to what the protagonist and narrator of [[Zen and the Art of Motorcycle Repair]] goes through - he starts as a scientist, looks for justifications for science in philosophy, becomes frustrated with philosophy and eventually embraces esotericism before going insane. The instrumental rationality that the Critical Theorists disliked seems roughly equivalent to the \"classical rationality\" Phaedrus talks about in [[Zen and the Art of Motorcycle Repair]] as well.","parent":"posts/untitled-9-21-2021.txt","score":0.8421404632187828},{"content":"Surely, this poses serious challenges to liberalism, and the idea that political differences can be resolved through rational debate. How can rational debate take place when the participants do not even agree on the simple question of what exists?","parent":"posts/untitled-1-4-2022.txt","score":0.8403206247771784},{"content":"[[Spinoza]] seems to reject the ego in favor of something transcendent - Goldstein claims in [[Betraying Spinoza]] that he thinks that as we become more rational, we increasingly have the same identity.","parent":"posts/untitled-2-6-2022.txt","score":0.8288847242208752},{"content":"In the real world, it looks like the aesthetic frame of mind matters more. How much conviction someone has in their values affects their motivations for truths, with the result that we're functionally much smarter when working on things we care about, and probe unfathomable depths of stupidity when doing things we don't care about.","parent":"posts/untitled-9-30-2021.txt","score":0.8266628799289568},{"content":"Creative tools vs rational tools","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8259736107618215},{"content":"Whether or not intelligence exists is a question for psychiatrists and their critics to fight over. My position is that it doesn't really matter, and that how much somebody cares about their work is far better approximation of how much value they provide than their intelligence.","parent":"posts/untitled-9-30-2021.txt","score":0.8232933307579292},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8227162947326183},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8200887282930571},{"content":"In ethics, Rawls proposed the idea of the \"veil of justice\", where decision makers imagine they did not know their own position in society before making a decision. Here, someone blinds themselves to their own position for the sake of impartiality.","parent":"posts/Strategic blindness-11-17-2021.txt","score":0.8177683811983559},{"content":"[[philosophy]] [[politics]] [[writing]] [[starred]]","parent":"posts/untitled-1-4-2022.txt","score":0.817520191212725},{"content":"[[roam]] is a tool for rational thought. More broadly, any tool that subscribes to something like a Zettelkasten or Evergreen notes philosophy is a tool for rational thought. The selling point of a tool for rational thought is to manage knowledge - no wonder, since another commonly used name for these tools is PKM (Personal Knowledge Management).","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8140953865036148},{"content":"Finished Capitalist Realism","parent":"posts/untitled-9-20-2021.txt","score":0.8096816420110774},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8070645691506562},{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.8064973648587463},{"content":"I think Computer Science is also subject to this double hermeneutic. The best example of this is computer security. Best practices are researched by computer scientists, and strategies against them are developed by security researchers and malicious actors. Conclusions are reached about how to best design computer systems, but these conclusions never last very long, because hostile actors have incentives to disrupt these conclusions. In the same way that social theories can be invalidated by people's awareness of those social theories, conclusions on computer system can as well.","parent":"posts/untitled-10-11-2021.txt","score":0.8057850808762389}],"Naturally, [[Habermas]]'s thoughts on the public sphere - which referred to salons, coffee shops and other public spaces in his day, and probably the internet today - are relevant to the social features of [[exegesis]]. ":[{"content":"Naturally, [[Habermas]]'s thoughts on the public sphere - which referred to salons, coffee shops and other public spaces in his day, and probably the internet today - are relevant to the social features of [[exegesis]].","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8853537956109886},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8812245347536736},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8797165753893392},{"content":"Habermas","parent":"posts/untitled-9-21-2021.txt","score":0.8610583345319137},{"content":"Yesterday I picked up a copy of [[Habermas]], a very short introduction at a used bookstore, because I recognized the name and it was $2.50 (my bookshelf is littered with books I purchased for similar reasons). The last book I read in the series was the very short introduction to Kant by Roger Scruton, which I enjoyed thoroughly.","parent":"posts/untitled-9-21-2021.txt","score":0.8576813175020694},{"content":"What is the point of exegesis then? The point is serendipity - it's a place for me to capture little scraps of thought - ideas, feelings, anything that comes to you at the moment.","parent":"posts/Second Brains-2-13-2021.txt","score":0.8475534811711238},{"content":"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]]","parent":"posts/untitled-9-20-2021.txt","score":0.8460937838411443},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.8454323855094077},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto-4-23-2020.txt","score":0.8452876081599624},{"content":"[[Why I made exegesis]]","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8450461088093864},{"content":"\"[Adam] Curtis attacks the internet because in his view it facilitates communities of solipsists, interpassive networks of like-minds who confirm, rather than challenge, each others' assumptions and prejudices.... Curtis' critique has a point, but it misses important dimensions of what is happening on the net. Contrary to Curtis' account of blogging, blogs can generate new discourse networks that have no correlate in the social field outside cyberspace.\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8449169044069272},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8441781194259173},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.8429474046142371},{"content":"What is exegesis?","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8392319850306811},{"content":"exegesis as crm [[exegesis]] [[ideas]]","parent":"posts/untitled-9-20-2021.txt","score":0.8384349838350396},{"content":"I want to read more. I started reading a lot more in quarantine, but slowed down towards the end of 2020 because I was spending a lot more time on [[exegesis]]. Now that I have more time, I want to start a steady reading habit. The particular corner of [[twitter]] I hang around is fond of citing various philosophers and ideas, many of which I'm interested in, but have never taken the time to study closely. This year, I want to dig deeper into these ideas, go beyond surface-level Twitter philosophy memes and Youtube philosophy videos and read some proper primary sources. Around this time last year, I read Roger Scruton's A very short introduction to Kant. I want to tackle the Critique of Pure Reason sometime this year. I may live-blog my notes on exegesis (though I can't guarantee they'll be very good).","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8380854417021409},{"content":"I see three ways to monetize exegesis:","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8378270253026556},{"content":"[[philosophy]] [[politics]] [[writing]] [[starred]]","parent":"posts/untitled-1-4-2022.txt","score":0.836221976920619},{"content":"You are reading this post on exegesis right now!","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8343627583691701}],"I could not help but find this extraordinarily similar to what the protagonist and narrator of [[Zen and the Art of Motorcycle Repair]] goes through - he starts as a scientist, looks for justifications for science in philosophy, becomes frustrated with philosophy and eventually embraces esotericism before going insane. The instrumental rationality that the Critical Theorists disliked seems roughly equivalent to the \"classical rationality\" Phaedrus talks about in [[Zen and the Art of Motorcycle Repair]] as well. ":[{"content":"I could not help but find this extraordinarily similar to what the protagonist and narrator of [[Zen and the Art of Motorcycle Repair]] goes through - he starts as a scientist, looks for justifications for science in philosophy, becomes frustrated with philosophy and eventually embraces esotericism before going insane. The instrumental rationality that the Critical Theorists disliked seems roughly equivalent to the \"classical rationality\" Phaedrus talks about in [[Zen and the Art of Motorcycle Repair]] as well.","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8820315160642752},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness-11-17-2021.txt","score":0.8742102156167595},{"content":"I'm borrowing heavily from [[Zen and the Art of Motorcycle Repair]] here, obviously.","parent":"posts/untitled-9-30-2021.txt","score":0.8724662303768218},{"content":"A couple of ideas I think are very related but couldn't figure out how to weave in: [[Nietzsche]]'s distinction between the Apollonian and the Dionysian, the distinction made in [[Zen and the Art of Motorcycle Repair]] between Romantic Quality and Classical Quality.","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8702409158474861},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.8631356951721226},{"content":"I do remember reading somewhere that Nietzsche admired Spinoza, so I'm curious to see how he resolved (or didn't resolve) the tension between his views on [[philosophy]] and Spinoza's.","parent":"posts/untitled-2-6-2022.txt","score":0.853440337814437},{"content":"An interesting contrast here, because as Goldstein herself admits, her project aims to understand Spinoza the man, going directly against his radically self effacing philosophy.","parent":"posts/untitled-2-6-2022.txt","score":0.8504058108379886},{"content":"It's like an excess of rationality always ends eating itself. Those who take rationality serious enough end up directing rational criticism at rationality itself - a dynamic similar to what [[Nietzsche]] thought had happened to Christianity (that Christianity bore the value of truth-seeking, which ended up being turned against it).","parent":"posts/untitled-9-21-2021.txt","score":0.8501692878663863},{"content":"[[Spinoza]] seems to reject the ego in favor of something transcendent - Goldstein claims in [[Betraying Spinoza]] that he thinks that as we become more rational, we increasingly have the same identity.","parent":"posts/untitled-2-6-2022.txt","score":0.8438053509266317},{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.843198416160313},{"content":"Also contrast to [[Nietzsche]]'s famous dictum that all philosophy is a kind of personal confession on the part of the philosopher. This certainly seems true to an extent - a lot of biographers think Spinoza built his system out of need to cope with his own loneliness.","parent":"posts/untitled-2-6-2022.txt","score":0.842434661962996},{"content":"Rational men at war with rationality","parent":"posts/untitled-9-21-2021.txt","score":0.8421404632187828},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.841934831531757},{"content":"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]]","parent":"posts/untitled-9-20-2021.txt","score":0.8404751400240903},{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.8391304816931092},{"content":"The auteur believes something similar about ideas. A description of an idea is never the idea itself, it is a second rate copy of an original - another thing added to the world's contents. Preferring not to clutter the world with such refuse, he becomes reclusive, reluctant to even speak of what he wishes to create. The result is either pure creativity untarnished by the translation of ideas into words, or something tantamount to the work of a madman - full of meaning to its creator but incomprehensible and useless to everyone else.","parent":"posts/On auteurs and language-10-9-2021.txt","score":0.838516184695276},{"content":"[[Quine]] is a \"formalist\" with regards to ontological theories. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8366755737406026},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8366149727234288},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8350199435140406}],"It's like an excess of rationality always ends eating itself. Those who take rationality serious enough end up directing rational criticism at rationality itself - a dynamic similar to what [[Nietzsche]] thought had happened to Christianity (that Christianity bore the value of truth-seeking, which ended up being turned against it). ":[{"content":"It's like an excess of rationality always ends eating itself. Those who take rationality serious enough end up directing rational criticism at rationality itself - a dynamic similar to what [[Nietzsche]] thought had happened to Christianity (that Christianity bore the value of truth-seeking, which ended up being turned against it).","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.8635311757495401},{"content":"Rational men at war with rationality","parent":"posts/untitled-9-21-2021.txt","score":0.86042514983339},{"content":"[[Spinoza]] seems to reject the ego in favor of something transcendent - Goldstein claims in [[Betraying Spinoza]] that he thinks that as we become more rational, we increasingly have the same identity.","parent":"posts/untitled-2-6-2022.txt","score":0.8563355333847004},{"content":"I have an instinctive negative reaction against any sort of philosophy that preaches against personal identity/ego. The psychological reason for this is probably that I am a proud person. [[personal-reflection]]","parent":"posts/untitled-2-6-2022.txt","score":0.8557232754386912},{"content":"In the real world, it looks like the aesthetic frame of mind matters more. How much conviction someone has in their values affects their motivations for truths, with the result that we're functionally much smarter when working on things we care about, and probe unfathomable depths of stupidity when doing things we don't care about.","parent":"posts/untitled-9-30-2021.txt","score":0.854703757364376},{"content":"Surely, this poses serious challenges to liberalism, and the idea that political differences can be resolved through rational debate. How can rational debate take place when the participants do not even agree on the simple question of what exists?","parent":"posts/untitled-1-4-2022.txt","score":0.85455954010193},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8531746221840729},{"content":"However I think I can also provide a principled argument against this \"anti-ego/pro-transcendental\" (albeit one that is also somewhat psychological). Along the lines of Nietzsche's argument, philosophy is deeply personal, and more often than not it reflects contingencies about the philosopher's personality rather than uncovering deep timeless truths. It seems to be the case that most philosophers who argue in favor of something transcendental and against the \"ego\" or \"personal identity\" are self-effacing individuals already. It's not like they'd be giving up much by renouncing their personal identities. Also, it's not particularly impressive for someone who's naturally humble to preach the virtues of humility - in a sense it seems like they're simply deifying aspects of their personality, rather than presenting a principled argument.","parent":"posts/untitled-2-6-2022.txt","score":0.8520652152170731},{"content":"I could not help but find this extraordinarily similar to what the protagonist and narrator of [[Zen and the Art of Motorcycle Repair]] goes through - he starts as a scientist, looks for justifications for science in philosophy, becomes frustrated with philosophy and eventually embraces esotericism before going insane. The instrumental rationality that the Critical Theorists disliked seems roughly equivalent to the \"classical rationality\" Phaedrus talks about in [[Zen and the Art of Motorcycle Repair]] as well.","parent":"posts/untitled-9-21-2021.txt","score":0.8501692878663863},{"content":"It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]]","parent":"posts/untitled-9-21-2021.txt","score":0.8492287014406527},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8455135586384352},{"content":"Also contrast to [[Nietzsche]]'s famous dictum that all philosophy is a kind of personal confession on the part of the philosopher. This certainly seems true to an extent - a lot of biographers think Spinoza built his system out of need to cope with his own loneliness.","parent":"posts/untitled-2-6-2022.txt","score":0.841494468590224},{"content":"Human beings can observe the conclusions that social science reach and modify their behavior, which can potentially render those conclusions invalid. This is a complete impossibility in the natural sciences - an atom cannot learn about atomic theories and change its behavior to invalidate those theories.","parent":"posts/untitled-10-11-2021.txt","score":0.840837143622048},{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8379818542716696},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness-11-17-2021.txt","score":0.8342891260889244},{"content":"An interesting contrast here, because as Goldstein herself admits, her project aims to understand Spinoza the man, going directly against his radically self effacing philosophy.","parent":"posts/untitled-2-6-2022.txt","score":0.8340194974919267},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8327084603167518},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains-2-13-2021.txt","score":0.8326991047936453},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8318294051780787}],"It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]] ":[{"content":"It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]]","parent":"posts/untitled-9-21-2021.txt","score":1},{"content":"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]]","parent":"posts/untitled-9-20-2021.txt","score":0.8813368311623918},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness-11-17-2021.txt","score":0.871699098336188},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8554131423232538},{"content":"However I think I can also provide a principled argument against this \"anti-ego/pro-transcendental\" (albeit one that is also somewhat psychological). Along the lines of Nietzsche's argument, philosophy is deeply personal, and more often than not it reflects contingencies about the philosopher's personality rather than uncovering deep timeless truths. It seems to be the case that most philosophers who argue in favor of something transcendental and against the \"ego\" or \"personal identity\" are self-effacing individuals already. It's not like they'd be giving up much by renouncing their personal identities. Also, it's not particularly impressive for someone who's naturally humble to preach the virtues of humility - in a sense it seems like they're simply deifying aspects of their personality, rather than presenting a principled argument.","parent":"posts/untitled-2-6-2022.txt","score":0.8548708122695273},{"content":"Nietzsche argues that there exists a philosophical system for each person that would justify their existence - like the \"books of apologia and prophecies that would vindicate for all time the actions of every person in the universe\" in The Library of Babel.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8508304654361899},{"content":"Also contrast to [[Nietzsche]]'s famous dictum that all philosophy is a kind of personal confession on the part of the philosopher. This certainly seems true to an extent - a lot of biographers think Spinoza built his system out of need to cope with his own loneliness.","parent":"posts/untitled-2-6-2022.txt","score":0.8500738986526998},{"content":"It's like an excess of rationality always ends eating itself. Those who take rationality serious enough end up directing rational criticism at rationality itself - a dynamic similar to what [[Nietzsche]] thought had happened to Christianity (that Christianity bore the value of truth-seeking, which ended up being turned against it).","parent":"posts/untitled-9-21-2021.txt","score":0.8492287014406527},{"content":"Rational men at war with rationality","parent":"posts/untitled-9-21-2021.txt","score":0.8488953917104434},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8460753454675088},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8449587572908194},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8444100268210227},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8437239783853031},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8404882352939314},{"content":"A couple of ideas I think are very related but couldn't figure out how to weave in: [[Nietzsche]]'s distinction between the Apollonian and the Dionysian, the distinction made in [[Zen and the Art of Motorcycle Repair]] between Romantic Quality and Classical Quality.","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8397643421030748},{"content":"[[philosophy]] [[politics]] [[writing]] [[starred]]","parent":"posts/untitled-1-4-2022.txt","score":0.8393710590221757},{"content":"[[Spinoza]] seems to reject the ego in favor of something transcendent - Goldstein claims in [[Betraying Spinoza]] that he thinks that as we become more rational, we increasingly have the same identity.","parent":"posts/untitled-2-6-2022.txt","score":0.8384976044326233},{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.8370710984370935},{"content":"I do remember reading somewhere that Nietzsche admired Spinoza, so I'm curious to see how he resolved (or didn't resolve) the tension between his views on [[philosophy]] and Spinoza's.","parent":"posts/untitled-2-6-2022.txt","score":0.8370701807017431},{"content":"I have an instinctive negative reaction against any sort of philosophy that preaches against personal identity/ego. The psychological reason for this is probably that I am a proud person. [[personal-reflection]]","parent":"posts/untitled-2-6-2022.txt","score":0.8334195756170841}]}