{"":[{"content":"Images","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8755930010386553},{"content":"Edit: 1/6/2021","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8686066054110362},{"content":"Conclusion","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8627111729312937},{"content":"Key Features","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8621480151447609},{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8593290080388},{"content":"Yes.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.859011141952105},{"content":"The club does 2 things.","parent":"posts/untitled-9-24-2021.txt","score":0.8589669169415844},{"content":"|___Practice Routine","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8583546625772834},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8577220980911441},{"content":"Code:","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.856649564390397},{"content":"Executing","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8556654491388678},{"content":"A minimap makes all of this accessible from anywhere. You can access it by clicking the green button at the bottom, or by pressing command K.","parent":"posts/Fragments.txt","score":0.8555190150006605},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8537043599402795},{"content":"Long Term goals","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8537012688171842},{"content":"Target Users","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8512910151541713},{"content":"Page tags","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8512275077312982},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8499151373626692},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8497861585687644},{"content":"[https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q](https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q)","parent":"posts/untitled-9-22-2021.txt","score":0.8497647970149683},{"content":"Namespaces","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8497010761916202}],"First day of school. Sitting in the UC Davis Coffee House for the first time in forever. Recently I've gone on a streak of listening to boomer music - yesterday I was listening to the Beatles, today I'm listening to Cream. [[music]] ":[{"content":"First day of school. Sitting in the UC Davis Coffee House for the first time in forever. Recently I've gone on a streak of listening to boomer music - yesterday I was listening to the Beatles, today I'm listening to Cream. [[music]]","parent":"posts/untitled-9-22-2021.txt","score":0.9999999999999999},{"content":"Some thoughts from this morning. Sitting in the Peet's cafe near the gym at UC Davis, listening to 80s synthwave.","parent":"posts/untitled-9-21-2021.txt","score":0.9052308608641845},{"content":"Sitting the UC Davis MU, listening to King Crimson.","parent":"posts/untitled-9-21-2021.txt","score":0.8761129675760588},{"content":"Felt good to be back at university, surrounded by other students. Just enjoying the feeling of walking across the quad, enjoying the morning sun, avoiding eye contact with people marketing their clubs, spotting a familiar face in a crowd, etc. etc.","parent":"posts/untitled-9-22-2021.txt","score":0.8591276839674798},{"content":"Listening to music","parent":"posts/untitled-9-21-2021.txt","score":0.8580089786940737},{"content":"First day of classes","parent":"posts/untitled-9-22-2021.txt","score":0.8541925508477739},{"content":"Music is everywhere. Thanks to portable electronics and streaming services, the average person has likely listened to more music than all their ancestors did, combined. Not only do we listen to more music, we have access to a wider array of it as well - for just ten dollars a month, you can get access to an unfathomably large library of music, containing everything from 17th century baroque clavichord pieces to zoomer hyperpop.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8344170406444963},{"content":"As mentioned earlier, the modern experience of listening to music alone is completely novel - before technology, listening to music was always a social affair, unless you were playing music for yourself.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8332026599081339},{"content":"Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].","parent":"posts/untitled-9-24-2021.txt","score":0.8293700948573011},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8276393883246798},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8226860312789989},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8222485142329977},{"content":"School-time","parent":"posts/untitled-9-30-2021.txt","score":0.8220989769524002},{"content":"This morning I was listening to a podcast suggested by [[Linus Lee]] - Changelog. I don't usually listen to podcasts, but I have had good experiences with audiobooks in the past. It was nice being able to absorb information over breakfast without staring at a screen. The subject material was interesting; it was some CMU professor doing research on individual programmers and the myth of the \"10x developer.\"","parent":"posts/untitled-9-20-2021.txt","score":0.8220072277953757},{"content":"Finally, I want to take my studies more seriously. Next quarter, I am taking upper division classes on statistics for CS, databases, and information interfaces. I am especially excited about the database class, since database design problems were a big part of what I struggled with while building exegesis. I am also excited about the information interfaces class - exegesis is really just one giant information interface, isn't it? I cannot say I am excited about the stats class, I have never been fond of or good at math, but I will try to brave it with a stiff upper lip. I am considering posting my notes for these classes on [[exegesis]], so I can share them with classmates.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8205945867873179},{"content":"Sitting in the MU again, this time with a view of the quad. Listening to \"The Time of the Season\" by the Zombies.","parent":"posts/untitled-9-24-2021.txt","score":0.820163549544889},{"content":"Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]]","parent":"posts/untitled-9-21-2021.txt","score":0.8197182792554056},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8197009271758116},{"content":"Something weird is happening here - we have access to more music and genres than ever before in human history, and yet it feels like something important is missing. Many of the people I talk to listen to music all the time, but I get the sense that it's more to ward off the dreaded experience of silence than it is to actually enjoy music.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8169835067502029},{"content":"Music is about context. A song is never just a song, it contains all the circumstances that it was listened to under - whether you heard it live, the street you were walking down when you heard it, the mood you were in when you heard it, the people it made you think of, etc.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services-3-16-2021.txt","score":0.8166607747676012}],"Creative inadequacy":[{"content":"Creative inadequacy","parent":"posts/untitled-9-22-2021.txt","score":1.0000000000000002},{"content":"The auteur believes something similar about ideas. A description of an idea is never the idea itself, it is a second rate copy of an original - another thing added to the world's contents. Preferring not to clutter the world with such refuse, he becomes reclusive, reluctant to even speak of what he wishes to create. The result is either pure creativity untarnished by the translation of ideas into words, or something tantamount to the work of a madman - full of meaning to its creator but incomprehensible and useless to everyone else.","parent":"posts/On auteurs and language-10-9-2021.txt","score":0.8628502973337527},{"content":"Is creative work painful by nature? Nietzsche calls boredom \"that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Maybe it is good for creative stamina to be burned out from time to time.","parent":"posts/Prometheus-2-13-2021.txt","score":0.8620164760797799},{"content":"Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all.","parent":"posts/On auteurs and language-10-9-2021.txt","score":0.8554550272284607},{"content":"Creative tools vs rational tools","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8544665409946555},{"content":"Anyone who takes satisfaction in creative work knows how good it feels to make something. That feeling can get addicting, to the point where you hunger to make progress on a creative project even when you're burned out - you want to create something so badly you can't take a break without thinking about it, but you're too burned out to make progress on it. At moments like these, one craves divine creative stamina, the ability to create out of thin air effortlessly, to beam ideas from one's head into reality, to spawn an entire universe within the span of a week like the God of the Old Testament.[[personal-reflection]]","parent":"posts/Prometheus-2-13-2021.txt","score":0.8482172139524022},{"content":"Higher-order creativity","parent":"posts/Prometheus-2-13-2021.txt","score":0.8478856378821935},{"content":"Neither perspective is completely correct. The reality is that there is a tradeoff between the approach of creative collaboration and the approach of an auteur. What creative collaborators gain through specialization and the combination of talents, they lose in the fidelity of their ideas' expression; what the auteur loses through not being able to harness others' talents, he gains through the ability to express an idea to its fullest. Naturally, the more talents the auteur is able to accrue, the less he needs others, and the more worthwhile the tradeoff of solo work becomes.","parent":"posts/On auteurs and language-10-9-2021.txt","score":0.8415435252120397},{"content":"Most importantly, I've been a creative my whole life. I understand how satisfying it is to make ideas a reality, and how frustrating it is when our tools fall short of our vision (a bad artist blames his tool, a great artist crafts his own).","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8396959586693132},{"content":"I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.","parent":"posts/Fragments.txt","score":0.8354100237898777},{"content":"The goal is to keep things creative and lighthearted, to mess around with as many ideas as possible.","parent":"posts/untitled-9-24-2021.txt","score":0.8346227915808574},{"content":"The auteur believes otherwise. Language, he says, cannot communicate an idea without botching it. And if communicating an idea were not bad enough, mediating between multiple ideas using as flawed a tool as language is immeasurably worse.","parent":"posts/On auteurs and language-10-9-2021.txt","score":0.8330789415153238},{"content":"So too, there exists a tool for each person that would vindicate their peculiarities. It is my hope that exegesis will vindicate chaos, disorganization, messiness, disorder, and all other epithets hitherto applied to what is rightfully called creativity.","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8325941540439843},{"content":"Of course, it is impossible to create a new kind of person out of thin air. Without traction with existing customers, it is impossible to gain the momentum needed to have enough cultural impact to create a new type of person. The synthesis between these two extremes is this: an innovative product is not one that merely solves problems for an existing kind of person, or one that creates an entirely new kind of person. Rather, it recognizes some kind of latent potential in existing people, and then transforms them into a new kind of person. For example, influencers did not exist when Instagram was created. However, there were people who wanted to share their photos with the world, and people that wanted to be recognized for their photos/beauty - it was this latent potential that Instagram unleashed.","parent":"posts/Creating new kinds of people-8-5-2021.txt","score":0.8325058724307639},{"content":"There is at least one creative medium for which this is not true, however, and that is programming. Here is a unique and strange property of programming: Making tools to program better itself involves programming. This is not true for music or art - the process of making a guitar is not the art of playing the guitar, the process of making paints is not the art of painting, and while luthiers and paint-makers are certainly artists in their own right (and are often good at playing the guitar and painting, respectively), they practice an art that is distinct from the art that they enable.","parent":"posts/Prometheus-2-13-2021.txt","score":0.8284612442379244},{"content":"But this is something forbidden to mortal men. We face a kind of creative asymmetry - to bring beauty into the world, it is neccessary to confront ugliness. Creating beautiful, original music requires endless, stupid, and frustrating scale practice, finger exercises, and theory study; behind the sublime beauty of a master's painting lies hours of practice filling sketchbooks with mind numbing still lifes and ugly anatomical mistakes. On the one hand, it seems paradoxical that beauty, freedom and originality require ugliness, servitude, and repetition. On the other hand, it is almost coldly rational - perhaps there is a kind of aesthetic entropy at play, like there's a set amount of beauty in the universe, and to \"produce\" any more of it, you first have to take on ugliness as a burden.[[music]] [[aesthetics]] [[art]]","parent":"posts/Prometheus-2-13-2021.txt","score":0.8281096665225973},{"content":"The assumption behind every collaborative creative endeavor is that language can capture ideas, and that language can mediate between ideas. Those who believe creative collaboration is possible believe that multiple creatives can enter the same room, use language to successfully communicate their ideas, use language to successfully mediate between their ideas, and use language to combine their ideas into a worthwhile final product.","parent":"posts/On auteurs and language-10-9-2021.txt","score":0.8273499506398251},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8248467797428328},{"content":"There are few feelings worse than wanting desperately to make something, and feeling as if you do not have the capability to make it.","parent":"posts/untitled-9-22-2021.txt","score":0.8248465165707353},{"content":"Tools for creative thought","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8234559026227392}],"First day of classes":[{"content":"First day of classes","parent":"posts/untitled-9-22-2021.txt","score":1.0000000000000002},{"content":"First day of school. Sitting in the UC Davis Coffee House for the first time in forever. Recently I've gone on a streak of listening to boomer music - yesterday I was listening to the Beatles, today I'm listening to Cream. [[music]]","parent":"posts/untitled-9-22-2021.txt","score":0.8541925508477739},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8303116735669926},{"content":"|___Practice Routine","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.82990886719329},{"content":"I may take a typography class this quarter. It's not required for graduation, but I figure it could help me design better products, and maybe make [[exegesis]] look prettier.","parent":"posts/untitled-9-22-2021.txt","score":0.8233762393283353},{"content":"Finally, I want to take my studies more seriously. Next quarter, I am taking upper division classes on statistics for CS, databases, and information interfaces. I am especially excited about the database class, since database design problems were a big part of what I struggled with while building exegesis. I am also excited about the information interfaces class - exegesis is really just one giant information interface, isn't it? I cannot say I am excited about the stats class, I have never been fond of or good at math, but I will try to brave it with a stiff upper lip. I am considering posting my notes for these classes on [[exegesis]], so I can share them with classmates.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8217669191257443},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8197308214933249},{"content":"School being in session seems to change time itself, which now flows in hour-long increments marked by the streets flooding with bikes carrying students to their next classes. Even when I'm finished with classes, this hourly event event when the bike circles fill and students file in and out of the library leaves the aftertaste of school on everything.","parent":"posts/untitled-9-30-2021.txt","score":0.8174993723260772},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8174280713852694},{"content":"School-time","parent":"posts/untitled-9-30-2021.txt","score":0.8135148098130515},{"content":"Felt good to be back at university, surrounded by other students. Just enjoying the feeling of walking across the quad, enjoying the morning sun, avoiding eye contact with people marketing their clubs, spotting a familiar face in a crowd, etc. etc.","parent":"posts/untitled-9-22-2021.txt","score":0.81317583984341},{"content":"Some thoughts on my Operating Systems course.","parent":"posts/untitled-10-11-2021.txt","score":0.8117574402848284},{"content":"Some thoughts from this morning. Sitting in the Peet's cafe near the gym at UC Davis, listening to 80s synthwave.","parent":"posts/untitled-9-21-2021.txt","score":0.8115951519554894},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8108634937061445},{"content":"Learn a grappling art (because of quarantine, this will just be maintaining general fitness levels for now)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8084642247701567},{"content":"The shift from normal school (Society of Discipline) to online school (Society of Control) back to normal school (Society of Discipline) has vividly illustrated the difference between the two. Tentatively, I'd say I say I prefer in person.","parent":"posts/untitled-9-30-2021.txt","score":0.8076046163273967},{"content":"|\t\t|___Scales to Practice","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8068651405954556},{"content":"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8067759531882296},{"content":"Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].","parent":"posts/untitled-9-24-2021.txt","score":0.803405169549765},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.803030336776857}],"Induction":[{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":1},{"content":"I've been introduced to the concept of inductive proofs multiple times but always had my doubts on how they *actually* worked. When my Number Theory professor brought up the topic again, I wondered if he'd finally address it, and he actually did. He was candidly honest about it - induction was more of a philosophical topic than a mathematical one, but as a purely mathematical phenomenon it's due to the axiomatic conventions that mathematicians abide by. That's it. It's axiomatic. I guess that was the expected answer, but it puts to rest a question I've had for a while.","parent":"posts/untitled-9-22-2021.txt","score":0.8821350132213556},{"content":"|___Practice Routine","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8254089324671292},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.82303471970312},{"content":"Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8221978249322496},{"content":"Executing","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8205863981487228},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8182801666279101},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8172507512613866},{"content":"[[Second Brains]]","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8171845205290502},{"content":"Higher-order creativity","parent":"posts/Prometheus-2-13-2021.txt","score":0.8142130782023268},{"content":"In some sense exegesis gave birth to itself, because I used it to organize my ideas about exegesis. On days where exegesis was not working because I had broken something while coding it, I noticed that I could not think as clearly. Its absence was felt.","parent":"posts/Second Brains-2-13-2021.txt","score":0.8139023159305541},{"content":"|\t\t|___Scales to Practice","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8138171787366607},{"content":"Could expand this into an [[essay]] eventually.","parent":"posts/untitled-1-4-2022.txt","score":0.813319028839709},{"content":"Code:","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8124351058141532},{"content":"[[Prometheus]]","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8122925116160845},{"content":"Conclusion","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8113036388182032},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness-11-17-2021.txt","score":0.8112885709169777},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8111754992278852},{"content":"[[Quine]] is a \"formalist\" with regards to ontological theories. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8109164615856527},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8092491294553389}],"Felt good to be back at university, surrounded by other students. Just enjoying the feeling of walking across the quad, enjoying the morning sun, avoiding eye contact with people marketing their clubs, spotting a familiar face in a crowd, etc. etc.":[{"content":"Felt good to be back at university, surrounded by other students. Just enjoying the feeling of walking across the quad, enjoying the morning sun, avoiding eye contact with people marketing their clubs, spotting a familiar face in a crowd, etc. etc.","parent":"posts/untitled-9-22-2021.txt","score":1},{"content":"First day of school. Sitting in the UC Davis Coffee House for the first time in forever. Recently I've gone on a streak of listening to boomer music - yesterday I was listening to the Beatles, today I'm listening to Cream. [[music]]","parent":"posts/untitled-9-22-2021.txt","score":0.8591276839674798},{"content":"Sitting in the MU again, this time with a view of the quad. Listening to \"The Time of the Season\" by the Zombies.","parent":"posts/untitled-9-24-2021.txt","score":0.8543512723961014},{"content":"Some thoughts from this morning. Sitting in the Peet's cafe near the gym at UC Davis, listening to 80s synthwave.","parent":"posts/untitled-9-21-2021.txt","score":0.8483202419836079},{"content":"Feeling Good","parent":"posts/untitled-9-30-2021.txt","score":0.8425567776325725},{"content":"Sitting the UC Davis MU, listening to King Crimson.","parent":"posts/untitled-9-21-2021.txt","score":0.821899485811605},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8155936110835887},{"content":"I feel pretty good right now, so I want to write down how it feels, so I can feel this way more often.","parent":"posts/untitled-9-30-2021.txt","score":0.8150794439824474},{"content":"First day of classes","parent":"posts/untitled-9-22-2021.txt","score":0.81317583984341},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8124324901698294},{"content":"That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]]","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8114817914316174},{"content":"The shift from normal school (Society of Discipline) to online school (Society of Control) back to normal school (Society of Discipline) has vividly illustrated the difference between the two. Tentatively, I'd say I say I prefer in person.","parent":"posts/untitled-9-30-2021.txt","score":0.8110718781215841},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8102550997730195},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8102192439238701},{"content":"Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].","parent":"posts/untitled-9-24-2021.txt","score":0.8100817052302145},{"content":"I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.","parent":"posts/Fragments.txt","score":0.8086243003745274},{"content":"I follow this [guy on twitter](https://twitter.com/nickcammarata) ([[nick-cammarata]]) that tweets about happiness a lot, and a common theme seems to be noticing what well being is, and imagining what the highest well being feels like.","parent":"posts/untitled-9-30-2021.txt","score":0.8074406745892876},{"content":"The club does 2 things.","parent":"posts/untitled-9-24-2021.txt","score":0.8068388624152194},{"content":"I'm taking a gap quarter this Spring to work on some personal projects. It is always better to have a plan than to have no plan, even if things don't work out your way, so here are some tentative goals for my gap quarter.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8067321297493771},{"content":"School being in session seems to change time itself, which now flows in hour-long increments marked by the streets flooding with bikes carrying students to their next classes. Even when I'm finished with classes, this hourly event event when the bike circles fill and students file in and out of the library leaves the aftertaste of school on everything.","parent":"posts/untitled-9-30-2021.txt","score":0.8042598212575757}],"I've been introduced to the concept of inductive proofs multiple times but always had my doubts on how they *actually* worked. When my Number Theory professor brought up the topic again, I wondered if he'd finally address it, and he actually did. He was candidly honest about it - induction was more of a philosophical topic than a mathematical one, but as a purely mathematical phenomenon it's due to the axiomatic conventions that mathematicians abide by. That's it. It's axiomatic. I guess that was the expected answer, but it puts to rest a question I've had for a while. ":[{"content":"I've been introduced to the concept of inductive proofs multiple times but always had my doubts on how they *actually* worked. When my Number Theory professor brought up the topic again, I wondered if he'd finally address it, and he actually did. He was candidly honest about it - induction was more of a philosophical topic than a mathematical one, but as a purely mathematical phenomenon it's due to the axiomatic conventions that mathematicians abide by. That's it. It's axiomatic. I guess that was the expected answer, but it puts to rest a question I've had for a while.","parent":"posts/untitled-9-22-2021.txt","score":1.0000000000000002},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8821350132213556},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8449172311767036},{"content":"[[Quine]] is a \"formalist\" with regards to ontological theories. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8338069467183036},{"content":"To be sure, he thinks there are different respects in which an ontological theory can be simple - so both physicalist, phenomenalist, and Platonic ontologies can all be worth developing. On this matter I agree with him.","parent":"posts/untitled-1-4-2022.txt","score":0.832376544732624},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8299776232587163},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8195874703889818},{"content":"In \"On What there is\", [[Quine]] relies heavily upon the idea that what ontology we subscribe to should depend on the idea of simplicity. In other words, we should adopt the simplest ontology possible.","parent":"posts/untitled-1-4-2022.txt","score":0.8113550279065077},{"content":"[[Spinoza]] seems to reject the ego in favor of something transcendent - Goldstein claims in [[Betraying Spinoza]] that he thinks that as we become more rational, we increasingly have the same identity.","parent":"posts/untitled-2-6-2022.txt","score":0.8091312429135049},{"content":"Human beings can observe the conclusions that social science reach and modify their behavior, which can potentially render those conclusions invalid. This is a complete impossibility in the natural sciences - an atom cannot learn about atomic theories and change its behavior to invalidate those theories.","parent":"posts/untitled-10-11-2021.txt","score":0.8090991754549199},{"content":"I always thought the name \"Computer Science\" was a misnomer - sciences are empirical, and computer science/programming is something that relies on reason/logic. It feels closer to applied mathematics than it does empirical science.","parent":"posts/untitled-10-11-2021.txt","score":0.8084653119404198},{"content":"[[Why I made exegesis]]","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8035688571051355},{"content":"There's an argument to be made that education requires authority, because learning requires humility. My objection to this is that a learner's humility does not require an instructor's authority, and in fact oftentimes an instructor's authoritarian behavior has the opposite effect of inspiring prideful resistance. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8024419158921502},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8019507098397618},{"content":"I have an instinctive negative reaction against any sort of philosophy that preaches against personal identity/ego. The psychological reason for this is probably that I am a proud person. [[personal-reflection]]","parent":"posts/untitled-2-6-2022.txt","score":0.8004145868973924}],"Typography":[{"content":"Typography","parent":"posts/untitled-9-22-2021.txt","score":1.0000000000000002},{"content":"I may take a typography class this quarter. It's not required for graduation, but I figure it could help me design better products, and maybe make [[exegesis]] look prettier.","parent":"posts/untitled-9-22-2021.txt","score":0.9142791635871205},{"content":"My philosophy here is this: it is better to try and make something authentic, beautiful, and expressive and have it turn out bad than it is to hide behind the safeness of minimalism. If you're writing, go ahead and try to sound clever. You might fail and sound incredibly immature, but a fear of failure is disastrous for any creative endeavor. If you're designing something, go all out. Make it bold and loud, and if it turns out gaudy, you can fix it on the next iteration. This was what I tried to do [[exegesis]]' redesign, and so far I'm very happy with it.","parent":"posts/Minimalism-6-8-2021.txt","score":0.8420494620301014},{"content":"Self explanatory. I would like to support users uploading images to exegesis for both their private and public notes. I would also like to figure out a system to apply tags to these images.","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8410181832915186},{"content":"If exegesis had image support, I'd draw a mockup, but alas we're not there yet.","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8328822995944279},{"content":"Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8272876122315175},{"content":"The way Napoleon understood the grammar of gunpowder and de Tocqueville understood the grammar of print and typography, I would like to master the grammar of hypertext.","parent":"posts/Fragments.txt","score":0.8267121246689658},{"content":"For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8263307333846187},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8245615723098639},{"content":"In fact, in the middle of an essay, I should be able to invent a UI component just to illustrate a point.\n\nEarly internet vibes.","parent":"posts/Fragments.txt","score":0.8235473338601395},{"content":"This is for scenarios where you do want to write in an organized manner. For example, right now, this entire page is about","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8234967320817516},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.822505068817377},{"content":"There was a problem with both of these outlets, however: my short attention span. I struggled to work on larger drawings, because I'd give up on them and start new doodles. The same happened with code projects.","parent":"posts/Fragments.txt","score":0.8217257721115775},{"content":"In my teen years, I found programming and videogame development, and that became my creative outlet for a while. I found a way to scan my drawings into digital files, and for a while that was my way of combining art and programming.","parent":"posts/Fragments.txt","score":0.821005772431322},{"content":"Higher-order creativity","parent":"posts/Prometheus-2-13-2021.txt","score":0.819898205044661},{"content":"Images","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8193812443080588},{"content":"Visionaries, artists, and creatives do not want to live in a spreadsheet. They have no interest in writing emacs macros or writing custom JS plugins for Roam Research. They want something like the Macbook of tools for thought - something beautiful and well crafted that gets out of the way and lets you do your best work.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8192839404566207},{"content":"TikTok has normalized tying music to everything - political messages, dances, jokes, short videos, etc. etc. Aiming to help do something similar with [[synesthesia]], but focused more on explicitly creative output.","parent":"posts/untitled-9-20-2021.txt","score":0.8189900080896884},{"content":"Growing up, my main creative outlet was drawing. As soon as a pencil or pen touched my hand I would have to draw something - it was almost involuntary. Many school notebooks were ruined this way, many concerned teachers advised me to keep my homework free of doodles.","parent":"posts/Fragments.txt","score":0.8185032321240306},{"content":"The compromise that I've arrived at, and that I've tried so far with a decent amount of success, is to draw with my preferred medium (pen), in my own style, while also using a reference. I use the reference for the pose and some of the details, and use my imagination to make up the rest. This is infinitely more interesting for me, and doesn't feel like a dreary technical exercise. I've also given up on using pencil, or charcoal, or anything except pen. I used to harbor a lot of guilt over this, because shouldn't an artist be able to use any medium? Of course, this is ridiculous, it'd be like asking a musician to be familiar with every instrument. It makes far more sense to get really good with one medium than to be mediocre with multiple (feeling some cognitive dissonance here with my desire to learn both the [[piano]] and the [[guitar]]...). Of course, professional artists (and musicians) really should be learning multiple mediums, but I have no aspiration to be professional at either, only to have some fun. [[drawing]] [[piano]] [[guitar]]","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8172759848558802}],"There are few feelings worse than wanting desperately to make something, and feeling as if you do not have the capability to make it. ":[{"content":"There are few feelings worse than wanting desperately to make something, and feeling as if you do not have the capability to make it.","parent":"posts/untitled-9-22-2021.txt","score":1},{"content":"I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.","parent":"posts/Fragments.txt","score":0.8869451146158694},{"content":"Anyone who takes satisfaction in creative work knows how good it feels to make something. That feeling can get addicting, to the point where you hunger to make progress on a creative project even when you're burned out - you want to create something so badly you can't take a break without thinking about it, but you're too burned out to make progress on it. At moments like these, one craves divine creative stamina, the ability to create out of thin air effortlessly, to beam ideas from one's head into reality, to spawn an entire universe within the span of a week like the God of the Old Testament.[[personal-reflection]]","parent":"posts/Prometheus-2-13-2021.txt","score":0.8718628235927736},{"content":"I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.","parent":"posts/Fragments.txt","score":0.8679072577647485},{"content":"I desperately want programming to feel like this.","parent":"posts/Fragments.txt","score":0.8642252549707393},{"content":"This project, too, has had a large effect on me - you can't work on something for a year and not have it affect you. I started this project sitting in a coffee shop; now I haven't sat in one for months. I know this sounds like navel gazing, but I've worked on this project through a pandemic, civil unrest, and statewide wildfires. Now it's finished, and I almost feel a little bittersweet releasing it.","parent":"posts/Reflections on exegesis-10-7-2020.txt","score":0.8596553773604156},{"content":"Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all.","parent":"posts/On auteurs and language-10-9-2021.txt","score":0.8569158946385296},{"content":"Most importantly, I've been a creative my whole life. I understand how satisfying it is to make ideas a reality, and how frustrating it is when our tools fall short of our vision (a bad artist blames his tool, a great artist crafts his own).","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8561480280233357},{"content":"On some level the underlying psychological drive behind bad minimalism is similar to the one of a slacking but intelligent student - the slacker thinks, \"I only studied 30 minutes and still got a C plus\" because he is scared of trying hard and still getting an unsatisfactory grade, the bad minimalist thinks, \"I only used flat designs to make my product and it looks presentable\" because he is scared that if he tries to make something beautiful he'll be ridiculed for it. It is an ego protection mechanism.","parent":"posts/Minimalism-6-8-2021.txt","score":0.8534300969846392},{"content":"For a while, I exclusively worked on a long, serious projects. I wanted to build a billion dollar product. I wanted to be the founder of a successful startup. I wanted to write, but I wanted to write on my own platform that everybody else would also write on, that would have all the features I wanted that everybody else would love.","parent":"posts/Fragments.txt","score":0.8527931799605559},{"content":"In general, we should strive to have conviction in what we make. When minimalism is an expression of this conviction, it is good, but more often than not it's used as a crutch to mask a lack of conviction.","parent":"posts/Minimalism-6-8-2021.txt","score":0.8513971260696234},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains-2-13-2021.txt","score":0.8501398392670176},{"content":"Bad minimalism, on the other hand, shows a lack of direction and conviction. Take Google's icon redesigns. Not only are they significantly worse from a visibility standpoint, but they also express a confused and weak sense of direction, which is ostensibly to create a coherent \"brand image\" by making all the icons look really similar. But what is this \"brand image?\" Nothing, it's as empty as Google's mission, which slipped over the course of two decades from \"Don't be evil\" to its current sad, formless state. Generally speaking, cookie-cutter minimalism is ugly. Sometimes it is the pragmatic choice, for example, if you're building a minimum viable product and don't want to worry about design yet, but the fact that it is the least ugly choice doesn't change the fact that it's still ugly.","parent":"posts/Minimalism-6-8-2021.txt","score":0.849927632720022},{"content":"Is creative work painful by nature? Nietzsche calls boredom \"that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Maybe it is good for creative stamina to be burned out from time to time.","parent":"posts/Prometheus-2-13-2021.txt","score":0.844418488477818},{"content":"This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8426273588465494},{"content":"My philosophy here is this: it is better to try and make something authentic, beautiful, and expressive and have it turn out bad than it is to hide behind the safeness of minimalism. If you're writing, go ahead and try to sound clever. You might fail and sound incredibly immature, but a fear of failure is disastrous for any creative endeavor. If you're designing something, go all out. Make it bold and loud, and if it turns out gaudy, you can fix it on the next iteration. This was what I tried to do [[exegesis]]' redesign, and so far I'm very happy with it.","parent":"posts/Minimalism-6-8-2021.txt","score":0.8424020937850349},{"content":"I understand this space intimately, have a personal need for the product, and have the technical capability to build the product - this makes me especially suited to take on this challenge.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8407258283058491},{"content":"This raises the question: what is good minimalism, and what is bad minimalism? My tentative answer is this: Good minimalism is the use of absence to convey richness and detail; bad minimalism is the self-effacing tendency of aesthetic cowardice.","parent":"posts/Minimalism-6-8-2021.txt","score":0.8398134332467636},{"content":"But this is something forbidden to mortal men. We face a kind of creative asymmetry - to bring beauty into the world, it is neccessary to confront ugliness. Creating beautiful, original music requires endless, stupid, and frustrating scale practice, finger exercises, and theory study; behind the sublime beauty of a master's painting lies hours of practice filling sketchbooks with mind numbing still lifes and ugly anatomical mistakes. On the one hand, it seems paradoxical that beauty, freedom and originality require ugliness, servitude, and repetition. On the other hand, it is almost coldly rational - perhaps there is a kind of aesthetic entropy at play, like there's a set amount of beauty in the universe, and to \"produce\" any more of it, you first have to take on ugliness as a burden.[[music]] [[aesthetics]] [[art]]","parent":"posts/Prometheus-2-13-2021.txt","score":0.8393623203686621},{"content":"I feel open to the future. I feel that there is meaning in this world, even if I don't know what it is currently, and it may be impossible to pin it down with words. I feel that the bad things that happen in this world do not lead to the conclusion that the world is a bad place. I feel ok not being able to explain everything. I feel I have something valuable to offer to others, I feel others have something valuable to offer to me. Change seems possible, albeit slow, and slowness feels OK.","parent":"posts/untitled-9-30-2021.txt","score":0.8383270680154078}],"I may take a typography class this quarter. It's not required for graduation, but I figure it could help me design better products, and maybe make [[exegesis]] look prettier. ":[{"content":"I may take a typography class this quarter. It's not required for graduation, but I figure it could help me design better products, and maybe make [[exegesis]] look prettier.","parent":"posts/untitled-9-22-2021.txt","score":1},{"content":"Typography","parent":"posts/untitled-9-22-2021.txt","score":0.9142791635871205},{"content":"My philosophy here is this: it is better to try and make something authentic, beautiful, and expressive and have it turn out bad than it is to hide behind the safeness of minimalism. If you're writing, go ahead and try to sound clever. You might fail and sound incredibly immature, but a fear of failure is disastrous for any creative endeavor. If you're designing something, go all out. Make it bold and loud, and if it turns out gaudy, you can fix it on the next iteration. This was what I tried to do [[exegesis]]' redesign, and so far I'm very happy with it.","parent":"posts/Minimalism-6-8-2021.txt","score":0.8811723070928711},{"content":"Finally, I want to take my studies more seriously. Next quarter, I am taking upper division classes on statistics for CS, databases, and information interfaces. I am especially excited about the database class, since database design problems were a big part of what I struggled with while building exegesis. I am also excited about the information interfaces class - exegesis is really just one giant information interface, isn't it? I cannot say I am excited about the stats class, I have never been fond of or good at math, but I will try to brave it with a stiff upper lip. I am considering posting my notes for these classes on [[exegesis]], so I can share them with classmates.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8788574051093736},{"content":"If exegesis had image support, I'd draw a mockup, but alas we're not there yet.","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8749731898008651},{"content":"The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well.","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8733229879236034},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8730784368436675},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.8703569819330819},{"content":"I will write soon about my more long term goals for exegesis - both technical tasks I'd like to get done and my overall vision for the product.","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8649316718649727},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8620676004269364},{"content":"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8620357046129816},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.862029554823147},{"content":"Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"?","parent":"posts/On tools for thought: knowledge management vs creativity-8-27-2021.txt","score":0.8615394304897895},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.8614724021005503},{"content":"Of these options, the first two interest me the most. As a browser app with a familiar interface, exegesis has many advantages over existing notetaking apps, and I think it can compete effectively in that area. I also think it would be incredibly cool to enable people to monetize their own networked intellectual gardens.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8612088692037801},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8607272791864685},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8602089973656424},{"content":"I see three ways to monetize exegesis:","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8593513473000569},{"content":"exegesis will be exactly that. Compared to other tools for thought, exegesis provides the familiar interface of a text editor, instead of clunky bullet points or markdown. It is accessible through a browser, and it loads fast. Finally, it just looks better than the competition.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8591980733097718},{"content":"I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.","parent":"posts/Reflections for the New Year-1-2-2021.txt","score":0.8557916899221102}],"Read this, liked it a lot.":[{"content":"Read this, liked it a lot.","parent":"posts/untitled-9-22-2021.txt","score":1},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.810712253992949},{"content":"A thousand suns","parent":"posts/Why I made exegesis-2-28-2021.txt","score":0.8056888892134766}],"[https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q](https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q)":[{"content":"[https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q](https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q)","parent":"posts/untitled-9-22-2021.txt","score":1},{"content":"Code:","parent":"posts/Goals for Spring Quarter-3-17-2021.txt","score":0.832900090360646},{"content":"Images","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8258169936973387},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.824690342926598},{"content":"Two, we will maintain a collective website at [https://rhizome.world/.](https://rhizome.world/.) The site is open source, you can find the repo here: [https://github.com/nichwch/rhizome-club.](https://github.com/nichwch/rhizome-club.)","parent":"posts/untitled-9-24-2021.txt","score":0.824114823537819},{"content":"I want this new site to be a space for that.","parent":"posts/Fragments.txt","score":0.8233593660060493},{"content":"rhizome.world","parent":"posts/untitled-9-24-2021.txt","score":0.8211610036190905},{"content":"A minimap makes all of this accessible from anywhere. You can access it by clicking the green button at the bottom, or by pressing command K.","parent":"posts/Fragments.txt","score":0.8194080656980987},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8188974232942088},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.817255355404021},{"content":"Could expand this into an [[essay]] eventually.","parent":"posts/untitled-1-4-2022.txt","score":0.8158327300169006},{"content":"The goal is to recreate the feeling of a musical jam session, but in a website.","parent":"posts/untitled-9-24-2021.txt","score":0.8151596486148035},{"content":"TikTok has normalized tying music to everything - political messages, dances, jokes, short videos, etc. etc. Aiming to help do something similar with [[synesthesia]], but focused more on explicitly creative output.","parent":"posts/untitled-9-20-2021.txt","score":0.814802123714147},{"content":"Before working on exegesis, I released a proof-of-concept called [YANA](https://yananotes.com/). It made the front page of [ProductHunt](https://www.producthunt.com/posts/yana), accrued almost 400 users, and put a few enthusiastic emails in my inbox. Because YANA was built with a rudimentary text engine that I wanted to upgrade, I decided to start over - the product of which is exegesis. Though it is not actively maintained, there are still a dozen or so active YANA users.","parent":"posts/exegesis pitch-2-4-2021.txt","score":0.8144625206407237},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8136765952958485},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8126877061198623},{"content":"|\t\t|___Songs to Practice","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8126637504214125},{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.811883173198583},{"content":"I could instead create all these pages, and tag them with their parents. Then, from the parent note, you would able to see the linked notes (like the sub directories, in a file system).","parent":"posts/Roadmap to exegesis' beta release-1-3-2021.txt","score":0.8116899710078497},{"content":"If the internet is a hurricane of information, let us build steely exoskeletons to weather the storm.","parent":"posts/Giant Robots-2-28-2021.txt","score":0.8111865756791776}]}