{"[I'm reminded of the distinction made between Societies of Discipline and Societies of Control.](https://www.youtube.com/watch?v=B_i8_WuyqAY&ab_channel=Jonas%C4%8Ceika-CCKPhilosophy) Societies of Discipline control individual behavior by making restrictions in time in space (e.g. by requiring factory workers to be in the factory at certain hours, etc. etc.), while Societies of Control allow free movement but assert control through more direct, often computerized means. ":[{"content":"[I'm reminded of the distinction made between Societies of Discipline and Societies of Control.](https://www.youtube.com/watch?v=B_i8_WuyqAY&ab_channel=Jonas%C4%8Ceika-CCKPhilosophy) Societies of Discipline control individual behavior by making restrictions in time in space (e.g. by requiring factory workers to be in the factory at certain hours, etc. etc.), while Societies of Control allow free movement but assert control through more direct, often computerized means.","parent":"posts/untitled-9-30-2021.txt","score":1.0000000000000002},{"content":"The shift from normal school (Society of Discipline) to online school (Society of Control) back to normal school (Society of Discipline) has vividly illustrated the difference between the two. Tentatively, I'd say I say I prefer in person.","parent":"posts/untitled-9-30-2021.txt","score":0.8730551436084741},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8510491524746572},{"content":"Maybe Computer Science is a social science","parent":"posts/untitled-10-11-2021.txt","score":0.8219639860934604},{"content":"Thinking as social","parent":"posts/untitled-9-24-2021.txt","score":0.8189480270111307},{"content":"Education and authoritarianism[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8138242032551248},{"content":"If you think about that a bit, it's a very quaint idea. Can you imagine a world where technology has developed to the point where we have giant robots, but technology is not somehow advanced enough to autopilot them? The idea seems strange to us, because in many respects, we live in a world diametrically opposed to the one portrayed in mecha science fiction. In their world, human beings control towering 50-foot humanoid war mechs. In ours, we are ruled by 5 inch screens in our pockets.","parent":"posts/Giant Robots.txt","score":0.8137705775468321},{"content":"The steady rhythm of school and myriad 30-minute break periods it produces throughout the day have a good effect on my productivity, which is surprising. There's that famous [Paul Graham essay](http://www.paulgraham.com/makersschedule.html) where he talks about hacker schedules, or how programmers/creators prefer long periods of focused time over short fragmented work periods (that managers tend to prefer) because there's an overhead cost to loading a project into your head. [[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8134705233245761},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8133245354350873},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8124892491473542},{"content":"A point worth repeating: in mecha fiction, we control 50-foot-tall war robots, in our world, we are controlled by the 5 inch screens in our pocket.","parent":"posts/Giant Robots.txt","score":0.8114468368063038},{"content":"Then again, the subject of Computer Science's empirical inquiries isn't a natural thing - it's manmade. Everything about a computer is manmade, from the processor to the operating system to the programs that run on it, and as such are subject to human conventions. I'm only half joking when I say this: Isn't computer science actually a social science?","parent":"posts/untitled-10-11-2021.txt","score":0.8114348744353618},{"content":"I think Computer Science is also subject to this double hermeneutic. The best example of this is computer security. Best practices are researched by computer scientists, and strategies against them are developed by security researchers and malicious actors. Conclusions are reached about how to best design computer systems, but these conclusions never last very long, because hostile actors have incentives to disrupt these conclusions. In the same way that social theories can be invalidated by people's awareness of those social theories, conclusions on computer system can as well.","parent":"posts/untitled-10-11-2021.txt","score":0.8112139808136414},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8106603823556386},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8106478408131437},{"content":"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8103827595226563},{"content":"The underlying psychological desire that mecha fiction appeals to is this: a world where technology augments the individual instead of replacing/controlling the individual. It is important that the mechs in these stories are humanoid, and not tanks or some other kind of war machine - in these worlds, we command machines that we created in our own image.","parent":"posts/Giant Robots.txt","score":0.8079731414390688},{"content":"More broadly, I wonder if the authoritarian element of learning comes from the instructor-student relationship. Historically learning required an instructor and a student, but the internet has provided incredibly powerful tools for the autodidact. Could we live in a world where everyone taught themselves? [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8072757146722539},{"content":"The counter argument here is that people don't want to use files, and they don't want to manage their own systems. I don't think this is a forgone conclusion. Think about how much effort has been poured into making new technologies like touchscreens and AI legible to ordinary people.","parent":"posts/The AI-first operating system of the future.txt","score":0.8071956585485389},{"content":"The fact that most people interact with computers through web and mobile was not some foregone conclusion. It took serious effort and ingenuity from really smart people to make these platforms accessible to regular people. Once upon a time, filesystems and personal computers were the dominant paradigm of computing, and it was web and mobile that were strange, inaccessible pipe dreams. Increasingly, the opposite is the case.","parent":"posts/The AI-first operating system of the future.txt","score":0.8070596654679693}],"School being in session seems to change time itself, which now flows in hour-long increments marked by the streets flooding with bikes carrying students to their next classes. Even when I'm finished with classes, this hourly event event when the bike circles fill and students file in and out of the library leaves the aftertaste of school on everything.":[{"content":"School being in session seems to change time itself, which now flows in hour-long increments marked by the streets flooding with bikes carrying students to their next classes. Even when I'm finished with classes, this hourly event event when the bike circles fill and students file in and out of the library leaves the aftertaste of school on everything.","parent":"posts/untitled-9-30-2021.txt","score":1},{"content":"School-time","parent":"posts/untitled-9-30-2021.txt","score":0.8858989446845055},{"content":"The steady rhythm of school and myriad 30-minute break periods it produces throughout the day have a good effect on my productivity, which is surprising. There's that famous [Paul Graham essay](http://www.paulgraham.com/makersschedule.html) where he talks about hacker schedules, or how programmers/creators prefer long periods of focused time over short fragmented work periods (that managers tend to prefer) because there's an overhead cost to loading a project into your head. [[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8440773377064216},{"content":"The shift from normal school (Society of Discipline) to online school (Society of Control) back to normal school (Society of Discipline) has vividly illustrated the difference between the two. Tentatively, I'd say I say I prefer in person.","parent":"posts/untitled-9-30-2021.txt","score":0.8300412017034722},{"content":"First day of classes","parent":"posts/untitled-9-22-2021.txt","score":0.8174993723260772},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8170736442800979},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8169699559339129},{"content":"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8157596899851561},{"content":"I made exegesis because I cannot organize. I struggle to organize my thoughts, I struggle to organize my belongings, I struggle to organize my priorities, I struggle to organize my life. Since Kindergarten, well meaning teachers have tried to help me stay organized to no avail; I have vivid memories of my 6th grade homeroom teacher holding me back during recess to help me organize my binder and desk, which were a mess of loose papers I had haphazardly shoved in. A failure to stay organized has been the proverbial monkey on my back for much of my life.","parent":"posts/Why I made exegesis.txt","score":0.8154910966491568},{"content":"First day of school. Sitting in the UC Davis Coffee House for the first time in forever. Recently I've gone on a streak of listening to boomer music - yesterday I was listening to the Beatles, today I'm listening to Cream. [[music]]","parent":"posts/untitled-9-22-2021.txt","score":0.813143629939257},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8131266621096584},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.8102799186203534},{"content":"This project, too, has had a large effect on me - you can't work on something for a year and not have it affect you. I started this project sitting in a coffee shop; now I haven't sat in one for months. I know this sounds like navel gazing, but I've worked on this project through a pandemic, civil unrest, and statewide wildfires. Now it's finished, and I almost feel a little bittersweet releasing it.","parent":"posts/Reflections on exegesis.txt","score":0.8101115395542758},{"content":"Budgeting time","parent":"posts/untitled-9-21-2021.txt","score":0.8077825726742685},{"content":"Growing up, my main creative outlet was drawing. As soon as a pencil or pen touched my hand I would have to draw something - it was almost involuntary. Many school notebooks were ruined this way, many concerned teachers advised me to keep my homework free of doodles.","parent":"posts/Fragments.txt","score":0.8066523670978895},{"content":"Working on a refactor for [[exegesis]] and [[synesthesia]], thinking about how to budget time. Working strategy is to take estimate for each feature, and double the time for each to account for stupid roadblocks (wifi not working, interrupted by something, bad documentation, etc. etc.) [[code]] [[devlog]]","parent":"posts/untitled-9-21-2021.txt","score":0.806266862303881},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8056378371683416},{"content":"Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8050414226272247},{"content":"I've noticed a strange tradeoff, where the more things I pile into my morning routine (getting in a run, doing hw, etc. etc.) the freer I feel for the rest of the day, but the harder it makes it to actually get out of bed and face these mundane tasks. If I just do what I want in the morning - code side projects - I jump out of bed easily, but then I feel the weight of obligations over me. If I handle obligations in the morning, then the thought of doing boring things makes it hard to get out of bed [[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.804551282357513},{"content":"Felt good to be back at university, surrounded by other students. Just enjoying the feeling of walking across the quad, enjoying the morning sun, avoiding eye contact with people marketing their clubs, spotting a familiar face in a crowd, etc. etc.","parent":"posts/untitled-9-22-2021.txt","score":0.8042598212575757}],"":[{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8593290080388},{"content":"The club does 2 things.","parent":"posts/untitled-9-24-2021.txt","score":0.8589669169415844},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8577220980911441},{"content":"Code:","parent":"posts/Goals for Spring Quarter.txt","score":0.856649564390397},{"content":"Executing","parent":"posts/Goals for Spring Quarter.txt","score":0.8556654491388678},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter.txt","score":0.8537043599402795},{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8514450468005932},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8499151373626692},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter.txt","score":0.8497861585687644},{"content":"Learn a grappling art (because of quarantine, this will just be maintaining general fitness levels for now)","parent":"posts/Goals for Spring Quarter.txt","score":0.8496945903933114},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter.txt","score":0.8478182318510581},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8472546071060495},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8467379006001533},{"content":"This is for scenarios where you do want to write in an organized manner. For example, right now, this entire page is about","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8466474388580029},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8456538970968254},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8455300536527719},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8455138568311819},{"content":"I'm taking a gap quarter this Spring to work on some personal projects. It is always better to have a plan than to have no plan, even if things don't work out your way, so here are some tentative goals for my gap quarter.","parent":"posts/Goals for Spring Quarter.txt","score":0.8451682294721505},{"content":"Writing cascades","parent":"posts/untitled-10-1-2021.txt","score":0.8444322593169847},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8437967333727141}],"The shift from normal school (Society of Discipline) to online school (Society of Control) back to normal school (Society of Discipline) has vividly illustrated the difference between the two. Tentatively, I'd say I say I prefer in person.":[{"content":"The shift from normal school (Society of Discipline) to online school (Society of Control) back to normal school (Society of Discipline) has vividly illustrated the difference between the two. Tentatively, I'd say I say I prefer in person.","parent":"posts/untitled-9-30-2021.txt","score":1},{"content":"[I'm reminded of the distinction made between Societies of Discipline and Societies of Control.](https://www.youtube.com/watch?v=B_i8_WuyqAY&ab_channel=Jonas%C4%8Ceika-CCKPhilosophy) Societies of Discipline control individual behavior by making restrictions in time in space (e.g. by requiring factory workers to be in the factory at certain hours, etc. etc.), while Societies of Control allow free movement but assert control through more direct, often computerized means.","parent":"posts/untitled-9-30-2021.txt","score":0.8730551436084741},{"content":"More broadly, I wonder if the authoritarian element of learning comes from the instructor-student relationship. Historically learning required an instructor and a student, but the internet has provided incredibly powerful tools for the autodidact. Could we live in a world where everyone taught themselves? [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.853795226609949},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8411682924936372},{"content":"Did the internet ruin my brain? No, I don't think either style of thinking is superior. Both have their place, and besides it's not like I'm incapable of linear thinking (I hope this essay is flowing in a somewhat logical manner!","parent":"posts/Why I made exegesis.txt","score":0.84048634810125},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8360955260357602},{"content":"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8360854598510048},{"content":"Maybe Computer Science is a social science","parent":"posts/untitled-10-11-2021.txt","score":0.8358122799484017},{"content":"School-time","parent":"posts/untitled-9-30-2021.txt","score":0.8345452805725904},{"content":"Thinking as social","parent":"posts/untitled-9-24-2021.txt","score":0.8303777335633149},{"content":"School being in session seems to change time itself, which now flows in hour-long increments marked by the streets flooding with bikes carrying students to their next classes. Even when I'm finished with classes, this hourly event event when the bike circles fill and students file in and out of the library leaves the aftertaste of school on everything.","parent":"posts/untitled-9-30-2021.txt","score":0.8300412017034722},{"content":"Education and authoritarianism[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8246805334341966},{"content":"What is disorganized/nonlinear thinking? It can be best understood in contrast to \"organized\" thinking, and this contrast can be best illustrated in the difference between the structure of a traditional nonfiction book and the idea of hypertext, which the internet is built around.","parent":"posts/Why I made exegesis.txt","score":0.8242897513245893},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8231841817893867},{"content":"There's an argument to be made that education requires authority, because learning requires humility. My objection to this is that a learner's humility does not require an instructor's authority, and in fact oftentimes an instructor's authoritarian behavior has the opposite effect of inspiring prideful resistance. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8211579860701929},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.82101227351975},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots.txt","score":0.8209375474319832},{"content":"As I looked further into these tools, I found that some had taken to calling them [Second Brains](https://fortelabs.co/blog/basboverview/). I thought this was incredibly exciting. The term sounds cyberpunk; building a \"second brain\" sounds way cooler than building a \"note taking app.\" At the same time, something about it unsettled me.","parent":"posts/Second Brains.txt","score":0.8186104247403032},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.8183542007041095},{"content":"Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].","parent":"posts/untitled-9-24-2021.txt","score":0.8180378480780492}],"School-time":[{"content":"School-time","parent":"posts/untitled-9-30-2021.txt","score":1},{"content":"School being in session seems to change time itself, which now flows in hour-long increments marked by the streets flooding with bikes carrying students to their next classes. Even when I'm finished with classes, this hourly event event when the bike circles fill and students file in and out of the library leaves the aftertaste of school on everything.","parent":"posts/untitled-9-30-2021.txt","score":0.8858989446845055},{"content":"The steady rhythm of school and myriad 30-minute break periods it produces throughout the day have a good effect on my productivity, which is surprising. There's that famous [Paul Graham essay](http://www.paulgraham.com/makersschedule.html) where he talks about hacker schedules, or how programmers/creators prefer long periods of focused time over short fragmented work periods (that managers tend to prefer) because there's an overhead cost to loading a project into your head. [[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8604163237336078},{"content":"The shift from normal school (Society of Discipline) to online school (Society of Control) back to normal school (Society of Discipline) has vividly illustrated the difference between the two. Tentatively, I'd say I say I prefer in person.","parent":"posts/untitled-9-30-2021.txt","score":0.8345452805725904},{"content":"Budgeting time","parent":"posts/untitled-9-21-2021.txt","score":0.8313450603949359},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8294843044661023},{"content":"Actually, I'm not sure which I prefer yet. I have noticed, however, that sometimes I'll sit down to work for 2 hours, and proceed to waste it all, until the last 20 minutes or so, when I become desperate to get something done so the entire period wasn't a waste of time. That 20 minutes is often incredibly productive. When I only have pockets of 30 minute breaks throughout the day to work on a project, it's like every break is that last 20 minutes of a 2 hour work period. Or not, sometimes I end up getting nothing done, wishing I had 2 hours to do deep, focused work. [[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8268959024645974},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8228795084630581},{"content":"First day of school. Sitting in the UC Davis Coffee House for the first time in forever. Recently I've gone on a streak of listening to boomer music - yesterday I was listening to the Beatles, today I'm listening to Cream. [[music]]","parent":"posts/untitled-9-22-2021.txt","score":0.8220989769524002},{"content":"Education and authoritarianism[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8173306211556932},{"content":"Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.817025256043515},{"content":"First day of classes","parent":"posts/untitled-9-22-2021.txt","score":0.8135148098130515},{"content":"I think it's important to have free time to just mess around and be bored, and explore dumb things that might turn out to be not so dumb - after all, \"boredom is that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Every activity I eventually took seriously - Model UN in high school, programming in college - started out as an casual hobby I never planned to take seriously. So, I'd rather have slow progress towards my goals and a sizeable chunk of time to mess around, than to fill my days to the point where I have no time to explore at all.","parent":"posts/Goals for Spring Quarter.txt","score":0.8133499596937951},{"content":"Working on a refactor for [[exegesis]] and [[synesthesia]], thinking about how to budget time. Working strategy is to take estimate for each feature, and double the time for each to account for stupid roadblocks (wifi not working, interrupted by something, bad documentation, etc. etc.) [[code]] [[devlog]]","parent":"posts/untitled-9-21-2021.txt","score":0.8126065313496198},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8096822744914252},{"content":"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8091539383987753},{"content":"For reading, I read whatever I want, whenever I want. I do think setting a goal of reading at least 5 times a week wouldn't hurt, however.","parent":"posts/Goals for Spring Quarter.txt","score":0.8036499966456798},{"content":"Growing up, my main creative outlet was drawing. As soon as a pencil or pen touched my hand I would have to draw something - it was almost involuntary. Many school notebooks were ruined this way, many concerned teachers advised me to keep my homework free of doodles.","parent":"posts/Fragments.txt","score":0.8028623259041409},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8026542777461773},{"content":"I made exegesis because I cannot organize. I struggle to organize my thoughts, I struggle to organize my belongings, I struggle to organize my priorities, I struggle to organize my life. Since Kindergarten, well meaning teachers have tried to help me stay organized to no avail; I have vivid memories of my 6th grade homeroom teacher holding me back during recess to help me organize my binder and desk, which were a mess of loose papers I had haphazardly shoved in. A failure to stay organized has been the proverbial monkey on my back for much of my life.","parent":"posts/Why I made exegesis.txt","score":0.8017097920765199}]," [[philosophy]] [[deleuze]] ":[{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.9999999999999999},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8711967160882398},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8662040638943291},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.8659799369654586},{"content":"[[Quine]] is a \"formalist\" with regards to ontological theories. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8606170014741038},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8589846280634447},{"content":"exegesis as crm [[exegesis]] [[ideas]]","parent":"posts/untitled-9-20-2021.txt","score":0.8587708990420274},{"content":"Nietzsche argues that there exists a philosophical system for each person that would justify their existence - like the \"books of apologia and prophecies that would vindicate for all time the actions of every person in the universe\" in The Library of Babel.","parent":"posts/Why I made exegesis.txt","score":0.8586695016063799},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8566437161730219},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8553115748445821},{"content":"A couple of ideas I think are very related but couldn't figure out how to weave in: [[Nietzsche]]'s distinction between the Apollonian and the Dionysian, the distinction made in [[Zen and the Art of Motorcycle Repair]] between Romantic Quality and Classical Quality.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8544349187007558},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8514151643327114},{"content":"There is yet another world to be discovered - and more than one. Embark, philosophers!\"","parent":"posts/Why I made exegesis.txt","score":0.850859791372041},{"content":"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]]","parent":"posts/untitled-9-20-2021.txt","score":0.8499423541203674},{"content":"To be sure, he thinks there are different respects in which an ontological theory can be simple - so both physicalist, phenomenalist, and Platonic ontologies can all be worth developing. On this matter I agree with him.","parent":"posts/untitled-1-4-2022.txt","score":0.8496865667528944},{"content":"I want to read more. I started reading a lot more in quarantine, but slowed down towards the end of 2020 because I was spending a lot more time on [[exegesis]]. Now that I have more time, I want to start a steady reading habit. The particular corner of [[twitter]] I hang around is fond of citing various philosophers and ideas, many of which I'm interested in, but have never taken the time to study closely. This year, I want to dig deeper into these ideas, go beyond surface-level Twitter philosophy memes and Youtube philosophy videos and read some proper primary sources. Around this time last year, I read Roger Scruton's A very short introduction to Kant. I want to tackle the Critique of Pure Reason sometime this year. I may live-blog my notes on exegesis (though I can't guarantee they'll be very good).","parent":"posts/Reflections for the New Year.txt","score":0.8496792619147872},{"content":"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.","parent":"posts/Reflections for the New Year.txt","score":0.849218288408378},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness.txt","score":0.8488907590560877},{"content":"Education and authoritarianism[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8466560928082584},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8463686955256368}],"Epistemology vs Aesthetics/Ethics":[{"content":"Epistemology vs Aesthetics/Ethics","parent":"posts/untitled-9-30-2021.txt","score":1},{"content":"An aesthetic/ethical frame of mind concerns itself with beauty and values. It cares not about the ability of the individual, but their conviction - how strongly they believe in the values they've subordinated themselves to.","parent":"posts/untitled-9-30-2021.txt","score":0.8844022666573843},{"content":"But this is something forbidden to mortal men. We face a kind of creative asymmetry - to bring beauty into the world, it is neccessary to confront ugliness. Creating beautiful, original music requires endless, stupid, and frustrating scale practice, finger exercises, and theory study; behind the sublime beauty of a master's painting lies hours of practice filling sketchbooks with mind numbing still lifes and ugly anatomical mistakes. On the one hand, it seems paradoxical that beauty, freedom and originality require ugliness, servitude, and repetition. On the other hand, it is almost coldly rational - perhaps there is a kind of aesthetic entropy at play, like there's a set amount of beauty in the universe, and to \"produce\" any more of it, you first have to take on ugliness as a burden.[[music]] [[aesthetics]] [[art]]","parent":"posts/Prometheus.txt","score":0.8434537880998851},{"content":"An epistemological frame of mind concerns itself with truth and how to find truth. It values intelligence, as the trait that measures an individual's ability to discover truths.","parent":"posts/untitled-9-30-2021.txt","score":0.8353068592012053},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8348164838330915},{"content":"However I think I can also provide a principled argument against this \"anti-ego/pro-transcendental\" (albeit one that is also somewhat psychological). Along the lines of Nietzsche's argument, philosophy is deeply personal, and more often than not it reflects contingencies about the philosopher's personality rather than uncovering deep timeless truths. It seems to be the case that most philosophers who argue in favor of something transcendental and against the \"ego\" or \"personal identity\" are self-effacing individuals already. It's not like they'd be giving up much by renouncing their personal identities. Also, it's not particularly impressive for someone who's naturally humble to preach the virtues of humility - in a sense it seems like they're simply deifying aspects of their personality, rather than presenting a principled argument.","parent":"posts/untitled-2-6-2022.txt","score":0.833448604638097},{"content":"In the real world, it looks like the aesthetic frame of mind matters more. How much conviction someone has in their values affects their motivations for truths, with the result that we're functionally much smarter when working on things we care about, and probe unfathomable depths of stupidity when doing things we don't care about.","parent":"posts/untitled-9-30-2021.txt","score":0.8334217174305905},{"content":"A couple of ideas I think are very related but couldn't figure out how to weave in: [[Nietzsche]]'s distinction between the Apollonian and the Dionysian, the distinction made in [[Zen and the Art of Motorcycle Repair]] between Romantic Quality and Classical Quality.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8328253369520547},{"content":"In ethics, Rawls proposed the idea of the \"veil of justice\", where decision makers imagine they did not know their own position in society before making a decision. Here, someone blinds themselves to their own position for the sake of impartiality.","parent":"posts/Strategic blindness.txt","score":0.832771357714361},{"content":"Human beings can observe the conclusions that social science reach and modify their behavior, which can potentially render those conclusions invalid. This is a complete impossibility in the natural sciences - an atom cannot learn about atomic theories and change its behavior to invalidate those theories.","parent":"posts/untitled-10-11-2021.txt","score":0.8323465922669119},{"content":"Beauty is something worth striving for, even if failing at it makes you look stupid.","parent":"posts/Minimalism.txt","score":0.8321803476538934},{"content":"To be sure, he thinks there are different respects in which an ontological theory can be simple - so both physicalist, phenomenalist, and Platonic ontologies can all be worth developing. On this matter I agree with him.","parent":"posts/untitled-1-4-2022.txt","score":0.831914495644093},{"content":"It is not simplicity alone that makes an ontology desirable, but rather simplicity with regards to some aim or desire. A physicalist ontology makes science easier and simpler to understand. But what makes simple science desirable in the first place? This stems from the uses that science has in shaping the natural world to our desires, and also in a pure human drive for knowledge.","parent":"posts/untitled-1-4-2022.txt","score":0.8305455023819285},{"content":"There is a time and place for minimalism, and all in all I don't think it is an intrinsically bad thing. I should also point out that I like all three writers mentioned above. However, I do think it's overused as an aesthetic philosophy, and that this overuse is a symptom of a deeper cultural illness: a general lack of conviction and courage.","parent":"posts/Minimalism.txt","score":0.8295442663129949},{"content":"Whether or not intelligence exists is a question for psychiatrists and their critics to fight over. My position is that it doesn't really matter, and that how much somebody cares about their work is far better approximation of how much value they provide than their intelligence.","parent":"posts/untitled-9-30-2021.txt","score":0.8289995919340787},{"content":"2. My critique here is nothing original - it echoes a lot of what Andy [[Matuschak]] and [[Linus Lee]] have touched upon in their essays. Here's a brief excerpt from [Linus' blog post](https://thesephist.com/posts/browser/) that expresses the point more eloquently:","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8283792238669732},{"content":"Nietzsche argues that there exists a philosophical system for each person that would justify their existence - like the \"books of apologia and prophecies that would vindicate for all time the actions of every person in the universe\" in The Library of Babel.","parent":"posts/Why I made exegesis.txt","score":0.8282569069352985},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8280729114323355},{"content":"[[Quine]] is a \"formalist\" with regards to ontological theories. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8277163770836818},{"content":"I think Computer Science is also subject to this double hermeneutic. The best example of this is computer security. Best practices are researched by computer scientists, and strategies against them are developed by security researchers and malicious actors. Conclusions are reached about how to best design computer systems, but these conclusions never last very long, because hostile actors have incentives to disrupt these conclusions. In the same way that social theories can be invalidated by people's awareness of those social theories, conclusions on computer system can as well.","parent":"posts/untitled-10-11-2021.txt","score":0.8276676253576141}],"An epistemological frame of mind concerns itself with truth and how to find truth. It values intelligence, as the trait that measures an individual's ability to discover truths. ":[{"content":"An epistemological frame of mind concerns itself with truth and how to find truth. It values intelligence, as the trait that measures an individual's ability to discover truths.","parent":"posts/untitled-9-30-2021.txt","score":0.9999999999999998},{"content":"An aesthetic/ethical frame of mind concerns itself with beauty and values. It cares not about the ability of the individual, but their conviction - how strongly they believe in the values they've subordinated themselves to.","parent":"posts/untitled-9-30-2021.txt","score":0.8889683802935309},{"content":"In the real world, it looks like the aesthetic frame of mind matters more. How much conviction someone has in their values affects their motivations for truths, with the result that we're functionally much smarter when working on things we care about, and probe unfathomable depths of stupidity when doing things we don't care about.","parent":"posts/untitled-9-30-2021.txt","score":0.8832689738688462},{"content":"Whether or not intelligence exists is a question for psychiatrists and their critics to fight over. My position is that it doesn't really matter, and that how much somebody cares about their work is far better approximation of how much value they provide than their intelligence.","parent":"posts/untitled-9-30-2021.txt","score":0.841402121149626},{"content":"Epistemology vs Aesthetics/Ethics","parent":"posts/untitled-9-30-2021.txt","score":0.8353068592012053},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8344305254281197},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.8321469201967093},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8320587757463828},{"content":"Nietzsche argues that there exists a philosophical system for each person that would justify their existence - like the \"books of apologia and prophecies that would vindicate for all time the actions of every person in the universe\" in The Library of Babel.","parent":"posts/Why I made exegesis.txt","score":0.8259665091872846},{"content":"[[roam]] is a tool for rational thought. More broadly, any tool that subscribes to something like a Zettelkasten or Evergreen notes philosophy is a tool for rational thought. The selling point of a tool for rational thought is to manage knowledge - no wonder, since another commonly used name for these tools is PKM (Personal Knowledge Management).","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8249698423203041},{"content":"Human beings can observe the conclusions that social science reach and modify their behavior, which can potentially render those conclusions invalid. This is a complete impossibility in the natural sciences - an atom cannot learn about atomic theories and change its behavior to invalidate those theories.","parent":"posts/untitled-10-11-2021.txt","score":0.8220408666138725},{"content":"I have an instinctive negative reaction against any sort of philosophy that preaches against personal identity/ego. The psychological reason for this is probably that I am a proud person. [[personal-reflection]]","parent":"posts/untitled-2-6-2022.txt","score":0.8201729754448646},{"content":"Thinking as social","parent":"posts/untitled-9-24-2021.txt","score":0.8199530779588136},{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.8191736739565033},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8188148777909208},{"content":"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data.","parent":"posts/Controlling what you see.txt","score":0.8169862353108007},{"content":"To be sure, he thinks there are different respects in which an ontological theory can be simple - so both physicalist, phenomenalist, and Platonic ontologies can all be worth developing. On this matter I agree with him.","parent":"posts/untitled-1-4-2022.txt","score":0.816531236424839},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.8146680842379416},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8142899832970383},{"content":"[[Quine]] is a \"formalist\" with regards to ontological theories. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.813061751947741}],"we live in a society ":[{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":1},{"content":"Thinking as social","parent":"posts/untitled-9-24-2021.txt","score":0.8546684288758786},{"content":"[I'm reminded of the distinction made between Societies of Discipline and Societies of Control.](https://www.youtube.com/watch?v=B_i8_WuyqAY&ab_channel=Jonas%C4%8Ceika-CCKPhilosophy) Societies of Discipline control individual behavior by making restrictions in time in space (e.g. by requiring factory workers to be in the factory at certain hours, etc. etc.), while Societies of Control allow free movement but assert control through more direct, often computerized means.","parent":"posts/untitled-9-30-2021.txt","score":0.8510491524746572},{"content":"The shift from normal school (Society of Discipline) to online school (Society of Control) back to normal school (Society of Discipline) has vividly illustrated the difference between the two. Tentatively, I'd say I say I prefer in person.","parent":"posts/untitled-9-30-2021.txt","score":0.8411682924936372},{"content":"Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].","parent":"posts/untitled-9-24-2021.txt","score":0.8353370961835866},{"content":"Naturally, [[Habermas]]'s thoughts on the public sphere - which referred to salons, coffee shops and other public spaces in his day, and probably the internet today - are relevant to the social features of [[exegesis]].","parent":"posts/untitled-9-21-2021.txt","score":0.8331858991187258},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.8285347796232112},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8273739289473597},{"content":"Consider two things I think to be missing from modern music: context and community. While its nothing compared to live music, I think certain Youtube videos capture these elements in a novel and exciting way.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8271321637855631},{"content":"There is a particular kind of second order effect that is of special interest: technologies can create entire new types of people. Instagram created the influencer, Youtube produced the Youtuber, Soundcloud spawned its own eponymous kind of rapper. The more extreme political factions in America trace their lineages to 4Chan and Tumblr. To give an older example, the factory birthed the proletariat a century ago.","parent":"posts/Creating new kinds of people.txt","score":0.8265860477823226},{"content":"Maybe Computer Science is a social science","parent":"posts/untitled-10-11-2021.txt","score":0.8236046843768585},{"content":"The club does 2 things.","parent":"posts/untitled-9-24-2021.txt","score":0.822738968908265},{"content":"The pandemic has made things even worse. Before the pandemic, music could still be a social experience, in the form of live shows and concerts, but now it has become a completely solo activity. Without live music, most people experience music as the blank grey rows in their Spotify playlists.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8221522674618975},{"content":"In the physical world, you can pass things down through the generations - a leather jacket your father owned, a relic couch from your grandparents, your uncle's vintage 1960s Stratocaster, etc. etc. These objects carry their history with them; they are imbued with the spirit of their past owners and their experiences.","parent":"posts/Generational Computing.txt","score":0.8213729808165887},{"content":"I feel open to the future. I feel that there is meaning in this world, even if I don't know what it is currently, and it may be impossible to pin it down with words. I feel that the bad things that happen in this world do not lead to the conclusion that the world is a bad place. I feel ok not being able to explain everything. I feel I have something valuable to offer to others, I feel others have something valuable to offer to me. Change seems possible, albeit slow, and slowness feels OK.","parent":"posts/untitled-9-30-2021.txt","score":0.8195402590111494},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.819279975093109},{"content":"This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"","parent":"posts/Second Brains.txt","score":0.8170033311038531},{"content":"The fact that most people interact with computers through web and mobile was not some foregone conclusion. It took serious effort and ingenuity from really smart people to make these platforms accessible to regular people. Once upon a time, filesystems and personal computers were the dominant paradigm of computing, and it was web and mobile that were strange, inaccessible pipe dreams. Increasingly, the opposite is the case.","parent":"posts/The AI-first operating system of the future.txt","score":0.8157663952790758},{"content":"As mentioned earlier, the modern experience of listening to music alone is completely novel - before technology, listening to music was always a social affair, unless you were playing music for yourself.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8147514069179719},{"content":"Here's another difference between the way we experience music and the way our ancestors did: it used to be the case that music was almost always a social experience. Before technology, if you wanted to listen to music, someone had to play music. It was a special, ceremonious event. The modern experience of listening to music alone, all the time would have been incomprehensible to our ancestors.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.814479695492361}],"An aesthetic/ethical frame of mind concerns itself with beauty and values. It cares not about the ability of the individual, but their conviction - how strongly they believe in the values they've subordinated themselves to.":[{"content":"An aesthetic/ethical frame of mind concerns itself with beauty and values. It cares not about the ability of the individual, but their conviction - how strongly they believe in the values they've subordinated themselves to.","parent":"posts/untitled-9-30-2021.txt","score":1.0000000000000002},{"content":"In the real world, it looks like the aesthetic frame of mind matters more. How much conviction someone has in their values affects their motivations for truths, with the result that we're functionally much smarter when working on things we care about, and probe unfathomable depths of stupidity when doing things we don't care about.","parent":"posts/untitled-9-30-2021.txt","score":0.9140453247333509},{"content":"An epistemological frame of mind concerns itself with truth and how to find truth. It values intelligence, as the trait that measures an individual's ability to discover truths.","parent":"posts/untitled-9-30-2021.txt","score":0.8889683802935309},{"content":"Epistemology vs Aesthetics/Ethics","parent":"posts/untitled-9-30-2021.txt","score":0.8844022666573843},{"content":"Beauty is something worth striving for, even if failing at it makes you look stupid.","parent":"posts/Minimalism.txt","score":0.8774095972188989},{"content":"I have an instinctive negative reaction against any sort of philosophy that preaches against personal identity/ego. The psychological reason for this is probably that I am a proud person. [[personal-reflection]]","parent":"posts/untitled-2-6-2022.txt","score":0.8563486125512164},{"content":"But this is something forbidden to mortal men. We face a kind of creative asymmetry - to bring beauty into the world, it is neccessary to confront ugliness. Creating beautiful, original music requires endless, stupid, and frustrating scale practice, finger exercises, and theory study; behind the sublime beauty of a master's painting lies hours of practice filling sketchbooks with mind numbing still lifes and ugly anatomical mistakes. On the one hand, it seems paradoxical that beauty, freedom and originality require ugliness, servitude, and repetition. On the other hand, it is almost coldly rational - perhaps there is a kind of aesthetic entropy at play, like there's a set amount of beauty in the universe, and to \"produce\" any more of it, you first have to take on ugliness as a burden.[[music]] [[aesthetics]] [[art]]","parent":"posts/Prometheus.txt","score":0.8521950580026265},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.8516193107024977},{"content":"Whether or not intelligence exists is a question for psychiatrists and their critics to fight over. My position is that it doesn't really matter, and that how much somebody cares about their work is far better approximation of how much value they provide than their intelligence.","parent":"posts/untitled-9-30-2021.txt","score":0.8473083454682026},{"content":"In ethics, Rawls proposed the idea of the \"veil of justice\", where decision makers imagine they did not know their own position in society before making a decision. Here, someone blinds themselves to their own position for the sake of impartiality.","parent":"posts/Strategic blindness.txt","score":0.8465014745515372},{"content":"However I think I can also provide a principled argument against this \"anti-ego/pro-transcendental\" (albeit one that is also somewhat psychological). Along the lines of Nietzsche's argument, philosophy is deeply personal, and more often than not it reflects contingencies about the philosopher's personality rather than uncovering deep timeless truths. It seems to be the case that most philosophers who argue in favor of something transcendental and against the \"ego\" or \"personal identity\" are self-effacing individuals already. It's not like they'd be giving up much by renouncing their personal identities. Also, it's not particularly impressive for someone who's naturally humble to preach the virtues of humility - in a sense it seems like they're simply deifying aspects of their personality, rather than presenting a principled argument.","parent":"posts/untitled-2-6-2022.txt","score":0.8408455437932989},{"content":"On some level the underlying psychological drive behind bad minimalism is similar to the one of a slacking but intelligent student - the slacker thinks, \"I only studied 30 minutes and still got a C plus\" because he is scared of trying hard and still getting an unsatisfactory grade, the bad minimalist thinks, \"I only used flat designs to make my product and it looks presentable\" because he is scared that if he tries to make something beautiful he'll be ridiculed for it. It is an ego protection mechanism.","parent":"posts/Minimalism.txt","score":0.8371810667956523},{"content":"A couple of ideas I think are very related but couldn't figure out how to weave in: [[Nietzsche]]'s distinction between the Apollonian and the Dionysian, the distinction made in [[Zen and the Art of Motorcycle Repair]] between Romantic Quality and Classical Quality.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8366696014685037},{"content":"In general, we should strive to have conviction in what we make. When minimalism is an expression of this conviction, it is good, but more often than not it's used as a crutch to mask a lack of conviction.","parent":"posts/Minimalism.txt","score":0.8345605136338501},{"content":"There is a time and place for minimalism, and all in all I don't think it is an intrinsically bad thing. I should also point out that I like all three writers mentioned above. However, I do think it's overused as an aesthetic philosophy, and that this overuse is a symptom of a deeper cultural illness: a general lack of conviction and courage.","parent":"posts/Minimalism.txt","score":0.8341100072673656},{"content":"Is creative work painful by nature? Nietzsche calls boredom \"that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Maybe it is good for creative stamina to be burned out from time to time.","parent":"posts/Prometheus.txt","score":0.833790901920315},{"content":"Also contrast to [[Nietzsche]]'s famous dictum that all philosophy is a kind of personal confession on the part of the philosopher. This certainly seems true to an extent - a lot of biographers think Spinoza built his system out of need to cope with his own loneliness.","parent":"posts/untitled-2-6-2022.txt","score":0.833123639988389},{"content":"Psychology, ethics, and game theory are diverse fields that all point towards blindness being situationally useful. All fields relate to human action, so maybe it's possible to generalize this on that level.","parent":"posts/Strategic blindness.txt","score":0.8329502595892222},{"content":"This raises the question: what is good minimalism, and what is bad minimalism? My tentative answer is this: Good minimalism is the use of absence to convey richness and detail; bad minimalism is the self-effacing tendency of aesthetic cowardice.","parent":"posts/Minimalism.txt","score":0.8318689372680699},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8301130280797199}],"In the real world, it looks like the aesthetic frame of mind matters more. How much conviction someone has in their values affects their motivations for truths, with the result that we're functionally much smarter when working on things we care about, and probe unfathomable depths of stupidity when doing things we don't care about. ":[{"content":"In the real world, it looks like the aesthetic frame of mind matters more. How much conviction someone has in their values affects their motivations for truths, with the result that we're functionally much smarter when working on things we care about, and probe unfathomable depths of stupidity when doing things we don't care about.","parent":"posts/untitled-9-30-2021.txt","score":1.0000000000000002},{"content":"An aesthetic/ethical frame of mind concerns itself with beauty and values. It cares not about the ability of the individual, but their conviction - how strongly they believe in the values they've subordinated themselves to.","parent":"posts/untitled-9-30-2021.txt","score":0.9140453247333509},{"content":"An epistemological frame of mind concerns itself with truth and how to find truth. It values intelligence, as the trait that measures an individual's ability to discover truths.","parent":"posts/untitled-9-30-2021.txt","score":0.8832689738688462},{"content":"Beauty is something worth striving for, even if failing at it makes you look stupid.","parent":"posts/Minimalism.txt","score":0.8766316284440235},{"content":"Whether or not intelligence exists is a question for psychiatrists and their critics to fight over. My position is that it doesn't really matter, and that how much somebody cares about their work is far better approximation of how much value they provide than their intelligence.","parent":"posts/untitled-9-30-2021.txt","score":0.8622474987610268},{"content":"It's like an excess of rationality always ends eating itself. Those who take rationality serious enough end up directing rational criticism at rationality itself - a dynamic similar to what [[Nietzsche]] thought had happened to Christianity (that Christianity bore the value of truth-seeking, which ended up being turned against it).","parent":"posts/untitled-9-21-2021.txt","score":0.854703757364376},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8480089263954139},{"content":"In general, we should strive to have conviction in what we make. When minimalism is an expression of this conviction, it is good, but more often than not it's used as a crutch to mask a lack of conviction.","parent":"posts/Minimalism.txt","score":0.8433541631815186},{"content":"I have an instinctive negative reaction against any sort of philosophy that preaches against personal identity/ego. The psychological reason for this is probably that I am a proud person. [[personal-reflection]]","parent":"posts/untitled-2-6-2022.txt","score":0.841537110608095},{"content":"Psychology, ethics, and game theory are diverse fields that all point towards blindness being situationally useful. All fields relate to human action, so maybe it's possible to generalize this on that level.","parent":"posts/Strategic blindness.txt","score":0.8413758357588675},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.8385481503048087},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8383522893896187},{"content":"Human beings can observe the conclusions that social science reach and modify their behavior, which can potentially render those conclusions invalid. This is a complete impossibility in the natural sciences - an atom cannot learn about atomic theories and change its behavior to invalidate those theories.","parent":"posts/untitled-10-11-2021.txt","score":0.8371532736023428},{"content":"In ethics, Rawls proposed the idea of the \"veil of justice\", where decision makers imagine they did not know their own position in society before making a decision. Here, someone blinds themselves to their own position for the sake of impartiality.","parent":"posts/Strategic blindness.txt","score":0.8348166868630386},{"content":"Epistemology vs Aesthetics/Ethics","parent":"posts/untitled-9-30-2021.txt","score":0.8334217174305905},{"content":"In some cases, it's smart to blind yourself strategically. Consider the following cases.","parent":"posts/Strategic blindness.txt","score":0.8331679022907953},{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis.txt","score":0.8329639897633541},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8328791920307302},{"content":"This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"","parent":"posts/Second Brains.txt","score":0.831749465256127},{"content":"Having done this daily exegesis braindump [[journal]] thing for a bit, I think there's something of value to her response. I get down my thoughts *easier* in my journal posts than I do in my private exegesis posts.","parent":"posts/untitled-9-24-2021.txt","score":0.8305181399346305}],"Feeling Good":[{"content":"Feeling Good","parent":"posts/untitled-9-30-2021.txt","score":1},{"content":"I feel pretty good right now, so I want to write down how it feels, so I can feel this way more often.","parent":"posts/untitled-9-30-2021.txt","score":0.8901376329594402},{"content":"I follow this [guy on twitter](https://twitter.com/nickcammarata) ([[nick-cammarata]]) that tweets about happiness a lot, and a common theme seems to be noticing what well being is, and imagining what the highest well being feels like.","parent":"posts/untitled-9-30-2021.txt","score":0.8677256265694394},{"content":"Felt good to be back at university, surrounded by other students. Just enjoying the feeling of walking across the quad, enjoying the morning sun, avoiding eye contact with people marketing their clubs, spotting a familiar face in a crowd, etc. etc.","parent":"posts/untitled-9-22-2021.txt","score":0.8425567776325725},{"content":"Good vs Bad minimalism","parent":"posts/Minimalism.txt","score":0.8207351588346159},{"content":"I feel open to the future. I feel that there is meaning in this world, even if I don't know what it is currently, and it may be impossible to pin it down with words. I feel that the bad things that happen in this world do not lead to the conclusion that the world is a bad place. I feel ok not being able to explain everything. I feel I have something valuable to offer to others, I feel others have something valuable to offer to me. Change seems possible, albeit slow, and slowness feels OK.","parent":"posts/untitled-9-30-2021.txt","score":0.8202958388804132},{"content":"Anyone who takes satisfaction in creative work knows how good it feels to make something. That feeling can get addicting, to the point where you hunger to make progress on a creative project even when you're burned out - you want to create something so badly you can't take a break without thinking about it, but you're too burned out to make progress on it. At moments like these, one craves divine creative stamina, the ability to create out of thin air effortlessly, to beam ideas from one's head into reality, to spawn an entire universe within the span of a week like the God of the Old Testament.[[personal-reflection]]","parent":"posts/Prometheus.txt","score":0.8073827869142376},{"content":"First day of school. Sitting in the UC Davis Coffee House for the first time in forever. Recently I've gone on a streak of listening to boomer music - yesterday I was listening to the Beatles, today I'm listening to Cream. [[music]]","parent":"posts/untitled-9-22-2021.txt","score":0.8038294251393316},{"content":"The goal is to recreate the feeling of a musical jam session, but in a website.","parent":"posts/untitled-9-24-2021.txt","score":0.8037426596163351},{"content":"Is creative work painful by nature? Nietzsche calls boredom \"that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Maybe it is good for creative stamina to be burned out from time to time.","parent":"posts/Prometheus.txt","score":0.8027851409263393},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.8027475961557698},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8024962583415247},{"content":"Get good at piano","parent":"posts/Goals for Spring Quarter.txt","score":0.801659731700411},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8007548717861271},{"content":"Some thoughts from this morning. Sitting in the Peet's cafe near the gym at UC Davis, listening to 80s synthwave.","parent":"posts/untitled-9-21-2021.txt","score":0.8000001363387906}],"Whether or not intelligence exists is a question for psychiatrists and their critics to fight over. My position is that it doesn't really matter, and that how much somebody cares about their work is far better approximation of how much value they provide than their intelligence. ":[{"content":"Whether or not intelligence exists is a question for psychiatrists and their critics to fight over. My position is that it doesn't really matter, and that how much somebody cares about their work is far better approximation of how much value they provide than their intelligence.","parent":"posts/untitled-9-30-2021.txt","score":1.0000000000000002},{"content":"In the real world, it looks like the aesthetic frame of mind matters more. How much conviction someone has in their values affects their motivations for truths, with the result that we're functionally much smarter when working on things we care about, and probe unfathomable depths of stupidity when doing things we don't care about.","parent":"posts/untitled-9-30-2021.txt","score":0.8622474987610268},{"content":"An aesthetic/ethical frame of mind concerns itself with beauty and values. It cares not about the ability of the individual, but their conviction - how strongly they believe in the values they've subordinated themselves to.","parent":"posts/untitled-9-30-2021.txt","score":0.8473083454682026},{"content":"An epistemological frame of mind concerns itself with truth and how to find truth. It values intelligence, as the trait that measures an individual's ability to discover truths.","parent":"posts/untitled-9-30-2021.txt","score":0.841402121149626},{"content":"Did the internet ruin my brain? No, I don't think either style of thinking is superior. Both have their place, and besides it's not like I'm incapable of linear thinking (I hope this essay is flowing in a somewhat logical manner!","parent":"posts/Why I made exegesis.txt","score":0.8377174905463095},{"content":"However I think I can also provide a principled argument against this \"anti-ego/pro-transcendental\" (albeit one that is also somewhat psychological). Along the lines of Nietzsche's argument, philosophy is deeply personal, and more often than not it reflects contingencies about the philosopher's personality rather than uncovering deep timeless truths. It seems to be the case that most philosophers who argue in favor of something transcendental and against the \"ego\" or \"personal identity\" are self-effacing individuals already. It's not like they'd be giving up much by renouncing their personal identities. Also, it's not particularly impressive for someone who's naturally humble to preach the virtues of humility - in a sense it seems like they're simply deifying aspects of their personality, rather than presenting a principled argument.","parent":"posts/untitled-2-6-2022.txt","score":0.8358891014243371},{"content":"Psychology, ethics, and game theory are diverse fields that all point towards blindness being situationally useful. All fields relate to human action, so maybe it's possible to generalize this on that level.","parent":"posts/Strategic blindness.txt","score":0.8319873193290662},{"content":"Epistemology vs Aesthetics/Ethics","parent":"posts/untitled-9-30-2021.txt","score":0.8289995919340787},{"content":"Is creative work painful by nature? Nietzsche calls boredom \"that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Maybe it is good for creative stamina to be burned out from time to time.","parent":"posts/Prometheus.txt","score":0.8283431932928276},{"content":"Above all, don't forget - technology exists to serve man, the \"blessed machine\" exists to serve \"the crude biomass.\" Your brain is not a tool for stocking your notes, your notes are a tool for your brain. I don't write everything down in exegesis, I still read physical books, a good deal of my thinking gets done on pen and paper. If I forget something, I figure it's evolution's way of telling me it wasn't important.","parent":"posts/Second Brains.txt","score":0.8273027697062301},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness.txt","score":0.8269791700972033},{"content":"I have an instinctive negative reaction against any sort of philosophy that preaches against personal identity/ego. The psychological reason for this is probably that I am a proud person. [[personal-reflection]]","parent":"posts/untitled-2-6-2022.txt","score":0.8269046162422624},{"content":"So too, there exists a tool for each person that would vindicate their peculiarities. It is my hope that exegesis will vindicate chaos, disorganization, messiness, disorder, and all other epithets hitherto applied to what is rightfully called creativity.","parent":"posts/Why I made exegesis.txt","score":0.826781699019864},{"content":"It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]]","parent":"posts/untitled-9-21-2021.txt","score":0.826213156613674},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.8261291785450795},{"content":"Having done this daily exegesis braindump [[journal]] thing for a bit, I think there's something of value to her response. I get down my thoughts *easier* in my journal posts than I do in my private exegesis posts.","parent":"posts/untitled-9-24-2021.txt","score":0.8257996665259489},{"content":"Also contrast to [[Nietzsche]]'s famous dictum that all philosophy is a kind of personal confession on the part of the philosopher. This certainly seems true to an extent - a lot of biographers think Spinoza built his system out of need to cope with his own loneliness.","parent":"posts/untitled-2-6-2022.txt","score":0.8256504690937245},{"content":"My aim in reading [[philosophy]] is more for general intellectual enrichment and to provide insights into my work, not philosophy for its own sake, so I feel fine with reading summaries as opposed to heavy primary literature (except where the primary literature interests me). For thinkers who are influential that don't interest me very much (like Kant), I've found summaries from the very short series and the Stanford Encyclopedia of Philosophy to be very helpful.","parent":"posts/untitled-9-21-2021.txt","score":0.8235673903487923},{"content":"Rational men at war with rationality","parent":"posts/untitled-9-21-2021.txt","score":0.8232933307579292},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.8229576826679247}],"I follow this [guy on twitter](https://twitter.com/nickcammarata) ([[nick-cammarata]]) that tweets about happiness a lot, and a common theme seems to be noticing what well being is, and imagining what the highest well being feels like. ":[{"content":"I follow this [guy on twitter](https://twitter.com/nickcammarata) ([[nick-cammarata]]) that tweets about happiness a lot, and a common theme seems to be noticing what well being is, and imagining what the highest well being feels like.","parent":"posts/untitled-9-30-2021.txt","score":0.9999999999999998},{"content":"Feeling Good","parent":"posts/untitled-9-30-2021.txt","score":0.8677256265694394},{"content":"I feel pretty good right now, so I want to write down how it feels, so I can feel this way more often.","parent":"posts/untitled-9-30-2021.txt","score":0.8637574497165407},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.8443710280132581},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.8437843001305448},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness.txt","score":0.8429634806846763},{"content":"I feel open to the future. I feel that there is meaning in this world, even if I don't know what it is currently, and it may be impossible to pin it down with words. I feel that the bad things that happen in this world do not lead to the conclusion that the world is a bad place. I feel ok not being able to explain everything. I feel I have something valuable to offer to others, I feel others have something valuable to offer to me. Change seems possible, albeit slow, and slowness feels OK.","parent":"posts/untitled-9-30-2021.txt","score":0.8392095910707885},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.835775393963918},{"content":"Having done this daily exegesis braindump [[journal]] thing for a bit, I think there's something of value to her response. I get down my thoughts *easier* in my journal posts than I do in my private exegesis posts.","parent":"posts/untitled-9-24-2021.txt","score":0.8314147055671154},{"content":"I have an instinctive negative reaction against any sort of philosophy that preaches against personal identity/ego. The psychological reason for this is probably that I am a proud person. [[personal-reflection]]","parent":"posts/untitled-2-6-2022.txt","score":0.8313574690282032},{"content":"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]]","parent":"posts/untitled-9-20-2021.txt","score":0.8223024366173797},{"content":"Right now I'm listening to [Something About Us by Daft Punk](https://open.spotify.com/track/1NeLwFETswx8Fzxl2AFl91?si=bc9f206d498e4fdd), which might have something to do with how I'm feeling. What if words aren't enough to express a certain feeling? What if it's only the conjunction of words, images, videos and music, combined not in a determinate order like a moving picture or video, but presented indeterminately, in some form resembling a moodboard? That's the thesis behind [[synesthesia]] (a project I'm working on that will be closely integrated with [[exegesis]]).","parent":"posts/untitled-9-30-2021.txt","score":0.8212075340979444},{"content":"If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8210904415978821},{"content":"Is creative work painful by nature? Nietzsche calls boredom \"that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Maybe it is good for creative stamina to be burned out from time to time.","parent":"posts/Prometheus.txt","score":0.8200652541808833},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search\nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.818136326076824},{"content":"In the real world, it looks like the aesthetic frame of mind matters more. How much conviction someone has in their values affects their motivations for truths, with the result that we're functionally much smarter when working on things we care about, and probe unfathomable depths of stupidity when doing things we don't care about.","parent":"posts/untitled-9-30-2021.txt","score":0.8168485067448956},{"content":"This actually rings somewhat true to me!","parent":"posts/untitled-10-11-2021.txt","score":0.8164589822615139},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8151508535992408},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8146505339000071},{"content":"There are lots of tools for thought out there with names inspired by great empires or their capitals: Roam (Rome) Research, Athens Research, Vienna Hypertext, etc. etc. I like all of these apps and have taken inspiration from them.\n\nBut isn't it strange that they have such imperial names? Tools for thought aren't about hierarchy and order, they're about freeing your thoughts to mingle with each other. It's less about ordering your thoughts into a hierarchical empire, and more about letting them wander freely, so that they might bear fruit. \n\nThat's why I picked the name nomad hypertext.","parent":"posts/What is Nomad Hypertext.txt","score":0.8132116465273553}],"I feel pretty good right now, so I want to write down how it feels, so I can feel this way more often.":[{"content":"I feel pretty good right now, so I want to write down how it feels, so I can feel this way more often.","parent":"posts/untitled-9-30-2021.txt","score":0.9999999999999998},{"content":"Feeling Good","parent":"posts/untitled-9-30-2021.txt","score":0.8901376329594402},{"content":"I follow this [guy on twitter](https://twitter.com/nickcammarata) ([[nick-cammarata]]) that tweets about happiness a lot, and a common theme seems to be noticing what well being is, and imagining what the highest well being feels like.","parent":"posts/untitled-9-30-2021.txt","score":0.8637574497165407},{"content":"If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8543088474373637},{"content":"I feel open to the future. I feel that there is meaning in this world, even if I don't know what it is currently, and it may be impossible to pin it down with words. I feel that the bad things that happen in this world do not lead to the conclusion that the world is a bad place. I feel ok not being able to explain everything. I feel I have something valuable to offer to others, I feel others have something valuable to offer to me. Change seems possible, albeit slow, and slowness feels OK.","parent":"posts/untitled-9-30-2021.txt","score":0.8528036339109523},{"content":"For writing, I firmly believe it's pointless to write for the sake of writing - it's important to do things first, so you have something to write about. That being said, it's also useful to write regularly to reflect on things, so I want to write at least once a week (an hour or so a session).","parent":"posts/Goals for Spring Quarter.txt","score":0.8524727922788632},{"content":"Having done this daily exegesis braindump [[journal]] thing for a bit, I think there's something of value to her response. I get down my thoughts *easier* in my journal posts than I do in my private exegesis posts.","parent":"posts/untitled-9-24-2021.txt","score":0.8507807261979602},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.8446615007532874},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":0.8391471809907421},{"content":"This is for scenarios where you do want to write in an organized manner. For example, right now, this entire page is about","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8386115513285326},{"content":"I will write soon about my more long term goals for exegesis - both technical tasks I'd like to get done and my overall vision for the product.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.838299477363232},{"content":"Right now I'm listening to [Something About Us by Daft Punk](https://open.spotify.com/track/1NeLwFETswx8Fzxl2AFl91?si=bc9f206d498e4fdd), which might have something to do with how I'm feeling. What if words aren't enough to express a certain feeling? What if it's only the conjunction of words, images, videos and music, combined not in a determinate order like a moving picture or video, but presented indeterminately, in some form resembling a moodboard? That's the thesis behind [[synesthesia]] (a project I'm working on that will be closely integrated with [[exegesis]]).","parent":"posts/untitled-9-30-2021.txt","score":0.8351085471601836},{"content":"Write about progress with code, hobbies, or some idea at least once a week (don't have to publish!)","parent":"posts/Goals for Spring Quarter.txt","score":0.8331928097129302},{"content":"In writing this essay, I checked everything tagged \"exegesis\" and \"personal-reflection\" in exegesis. I didn't tag those thoughts for the purpose of writing this essay, they were written down spontaneously. That they have helped me write this essay is serendipitous.","parent":"posts/Second Brains.txt","score":0.8323651054343787},{"content":"It's pretty simple for the most part, you just write. If you want to see ideas that are related to a paragraph, click the # next to the paragraph.","parent":"posts/What is Nomad Hypertext.txt","score":0.8310248409933896},{"content":"I desperately want programming to feel like this.","parent":"posts/Fragments.txt","score":0.8287065469875295},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8266292925839108},{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8232814248216307},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8224024150428969},{"content":"This project, too, has had a large effect on me - you can't work on something for a year and not have it affect you. I started this project sitting in a coffee shop; now I haven't sat in one for months. I know this sounds like navel gazing, but I've worked on this project through a pandemic, civil unrest, and statewide wildfires. Now it's finished, and I almost feel a little bittersweet releasing it.","parent":"posts/Reflections on exegesis.txt","score":0.8213846592579731}],"I'm borrowing heavily from [[Zen and the Art of Motorcycle Repair]] here, obviously.":[{"content":"I'm borrowing heavily from [[Zen and the Art of Motorcycle Repair]] here, obviously.","parent":"posts/untitled-9-30-2021.txt","score":1},{"content":"I could not help but find this extraordinarily similar to what the protagonist and narrator of [[Zen and the Art of Motorcycle Repair]] goes through - he starts as a scientist, looks for justifications for science in philosophy, becomes frustrated with philosophy and eventually embraces esotericism before going insane. The instrumental rationality that the Critical Theorists disliked seems roughly equivalent to the \"classical rationality\" Phaedrus talks about in [[Zen and the Art of Motorcycle Repair]] as well.","parent":"posts/untitled-9-21-2021.txt","score":0.8724662303768218},{"content":"A couple of ideas I think are very related but couldn't figure out how to weave in: [[Nietzsche]]'s distinction between the Apollonian and the Dionysian, the distinction made in [[Zen and the Art of Motorcycle Repair]] between Romantic Quality and Classical Quality.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8676934408901174},{"content":"These are my hobbies that I use to take a break from code related creative-work.","parent":"posts/Goals for Spring Quarter.txt","score":0.8492648095671892},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8443306844225567},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness.txt","score":0.841304384044803},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8398402717019717},{"content":"Learn a grappling art (because of quarantine, this will just be maintaining general fitness levels for now)","parent":"posts/Goals for Spring Quarter.txt","score":0.839114310127226},{"content":"Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8374603363429742},{"content":"Working on a refactor for [[exegesis]] and [[synesthesia]], thinking about how to budget time. Working strategy is to take estimate for each feature, and double the time for each to account for stupid roadblocks (wifi not working, interrupted by something, bad documentation, etc. etc.) [[code]] [[devlog]]","parent":"posts/untitled-9-21-2021.txt","score":0.8360530923334886},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter.txt","score":0.8339263907148622},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8333805271334642},{"content":"I may take a typography class this quarter. It's not required for graduation, but I figure it could help me design better products, and maybe make [[exegesis]] look prettier.","parent":"posts/untitled-9-22-2021.txt","score":0.8299762933593747},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.8299417686630274},{"content":"That being said, I think I've figured out a different drawing routine that will work this time. Past practice routines always centered around trying to copy other people's art, or doing realistic sketches/pose practice in pencil. I enjoy drawing without references the most, making things up as I go. Drawing from a reference is always boring and dreary for me. However, there's really no way to improve without using references. This is especially true since my biggest drawing deficiencies are not being able to draw people's faces well, portraying 3D shapes in a non-flat way, shading/cross-hatching, and posing figures naturally.[[drawing]]","parent":"posts/Reflections for the New Year.txt","score":0.8295845392122487},{"content":"\"From the moment I understood the weakness of my flesh, it disgusted me. I craved for strength and certainty of steel. I aspired to the purity of the blessed machine. Your kind cling to your flesh, as though it will not decay and fail you. One day the crude biomass you call a temple will wither and you will beg my kind to save you.\n\nBut I am already saved. For the Machine is immortal.\"\n\n- Magos Dominus Reditus, Warhammer 40k","parent":"posts/Second Brains.txt","score":0.8293167762349177},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8284984504715014},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search\nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.828253138497204},{"content":"The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well.","parent":"posts/Goals for Spring Quarter.txt","score":0.8276293485319659},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8275240329288994}],"I feel open to the future. I feel that there is meaning in this world, even if I don't know what it is currently, and it may be impossible to pin it down with words. I feel that the bad things that happen in this world do not lead to the conclusion that the world is a bad place. I feel ok not being able to explain everything. I feel I have something valuable to offer to others, I feel others have something valuable to offer to me. Change seems possible, albeit slow, and slowness feels OK. ":[{"content":"I feel open to the future. I feel that there is meaning in this world, even if I don't know what it is currently, and it may be impossible to pin it down with words. I feel that the bad things that happen in this world do not lead to the conclusion that the world is a bad place. I feel ok not being able to explain everything. I feel I have something valuable to offer to others, I feel others have something valuable to offer to me. Change seems possible, albeit slow, and slowness feels OK.","parent":"posts/untitled-9-30-2021.txt","score":1.0000000000000002},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8569386619733801},{"content":"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]]","parent":"posts/untitled-9-20-2021.txt","score":0.8537475411955326},{"content":"I feel pretty good right now, so I want to write down how it feels, so I can feel this way more often.","parent":"posts/untitled-9-30-2021.txt","score":0.8528036339109523},{"content":"I follow this [guy on twitter](https://twitter.com/nickcammarata) ([[nick-cammarata]]) that tweets about happiness a lot, and a common theme seems to be noticing what well being is, and imagining what the highest well being feels like.","parent":"posts/untitled-9-30-2021.txt","score":0.8392095910707885},{"content":"There are few feelings worse than wanting desperately to make something, and feeling as if you do not have the capability to make it.","parent":"posts/untitled-9-22-2021.txt","score":0.8383270680154078},{"content":"I have an instinctive negative reaction against any sort of philosophy that preaches against personal identity/ego. The psychological reason for this is probably that I am a proud person. [[personal-reflection]]","parent":"posts/untitled-2-6-2022.txt","score":0.8370768313885364},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8367142752880684},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.8352462056244112},{"content":"This project, too, has had a large effect on me - you can't work on something for a year and not have it affect you. I started this project sitting in a coffee shop; now I haven't sat in one for months. I know this sounds like navel gazing, but I've worked on this project through a pandemic, civil unrest, and statewide wildfires. Now it's finished, and I almost feel a little bittersweet releasing it.","parent":"posts/Reflections on exegesis.txt","score":0.8347411593204087},{"content":"Right now I'm listening to [Something About Us by Daft Punk](https://open.spotify.com/track/1NeLwFETswx8Fzxl2AFl91?si=bc9f206d498e4fdd), which might have something to do with how I'm feeling. What if words aren't enough to express a certain feeling? What if it's only the conjunction of words, images, videos and music, combined not in a determinate order like a moving picture or video, but presented indeterminately, in some form resembling a moodboard? That's the thesis behind [[synesthesia]] (a project I'm working on that will be closely integrated with [[exegesis]]).","parent":"posts/untitled-9-30-2021.txt","score":0.8343319679958097},{"content":"I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.","parent":"posts/Fragments.txt","score":0.8316286655923255},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness.txt","score":0.8304872684458482},{"content":"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.","parent":"posts/Reflections for the New Year.txt","score":0.8291844418592978},{"content":"In the real world, it looks like the aesthetic frame of mind matters more. How much conviction someone has in their values affects their motivations for truths, with the result that we're functionally much smarter when working on things we care about, and probe unfathomable depths of stupidity when doing things we don't care about.","parent":"posts/untitled-9-30-2021.txt","score":0.8287835447179812},{"content":"The world cannot be distilled into neat, concrete categories. Neither can your thoughts. Isn't it time your notes got a little messier?","parent":"posts/Manifesto.txt","score":0.8280037514448968},{"content":"I desperately want programming to feel like this.","parent":"posts/Fragments.txt","score":0.8272867322894102},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8270848493574202},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8263308789079071},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.8258375360406224}],"Right now I'm listening to [Something About Us by Daft Punk](https://open.spotify.com/track/1NeLwFETswx8Fzxl2AFl91?si=bc9f206d498e4fdd), which might have something to do with how I'm feeling. What if words aren't enough to express a certain feeling? What if it's only the conjunction of words, images, videos and music, combined not in a determinate order like a moving picture or video, but presented indeterminately, in some form resembling a moodboard? That's the thesis behind [[synesthesia]] (a project I'm working on that will be closely integrated with [[exegesis]]).":[{"content":"Right now I'm listening to [Something About Us by Daft Punk](https://open.spotify.com/track/1NeLwFETswx8Fzxl2AFl91?si=bc9f206d498e4fdd), which might have something to do with how I'm feeling. What if words aren't enough to express a certain feeling? What if it's only the conjunction of words, images, videos and music, combined not in a determinate order like a moving picture or video, but presented indeterminately, in some form resembling a moodboard? That's the thesis behind [[synesthesia]] (a project I'm working on that will be closely integrated with [[exegesis]]).","parent":"posts/untitled-9-30-2021.txt","score":1},{"content":"Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]]","parent":"posts/untitled-9-21-2021.txt","score":0.8700834017724443},{"content":"TikTok has normalized tying music to everything - political messages, dances, jokes, short videos, etc. etc. Aiming to help do something similar with [[synesthesia]], but focused more on explicitly creative output.","parent":"posts/untitled-9-20-2021.txt","score":0.869610185694576},{"content":"TikTok and [[synesthesia]]","parent":"posts/untitled-9-20-2021.txt","score":0.8633678002682021},{"content":"Music is about context. A song is never just a song, it contains all the circumstances that it was listened to under - whether you heard it live, the street you were walking down when you heard it, the mood you were in when you heard it, the people it made you think of, etc.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8446575466839239},{"content":"Here, there is context (the theming of the video/playlist), and community (the commenters playing along with the theme). Taken together, they create something that can only be described as a vibe. I don't think you could even come close to doing something this cool with a Spotify playlist.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.839253105470937},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.838973745470461},{"content":"I feel pretty good right now, so I want to write down how it feels, so I can feel this way more often.","parent":"posts/untitled-9-30-2021.txt","score":0.8351085471601836},{"content":"I feel open to the future. I feel that there is meaning in this world, even if I don't know what it is currently, and it may be impossible to pin it down with words. I feel that the bad things that happen in this world do not lead to the conclusion that the world is a bad place. I feel ok not being able to explain everything. I feel I have something valuable to offer to others, I feel others have something valuable to offer to me. Change seems possible, albeit slow, and slowness feels OK.","parent":"posts/untitled-9-30-2021.txt","score":0.8343319679958097},{"content":"None of it worked, because the word disorganized is really just an epithet for nonlinear.","parent":"posts/Why I made exegesis.txt","score":0.8329728326221639},{"content":"The goal is to recreate the feeling of a musical jam session, but in a website.","parent":"posts/untitled-9-24-2021.txt","score":0.8318528450923026},{"content":"I desperately want programming to feel like this.","parent":"posts/Fragments.txt","score":0.8315047975545152},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8307387297378329},{"content":"Something weird is happening here - we have access to more music and genres than ever before in human history, and yet it feels like something important is missing. Many of the people I talk to listen to music all the time, but I get the sense that it's more to ward off the dreaded experience of silence than it is to actually enjoy music.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8305872545038987},{"content":"Consider two things I think to be missing from modern music: context and community. While its nothing compared to live music, I think certain Youtube videos capture these elements in a novel and exciting way.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8299933267076698},{"content":"What is the point of exegesis then? The point is serendipity - it's a place for me to capture little scraps of thought - ideas, feelings, anything that comes to you at the moment.","parent":"posts/Second Brains.txt","score":0.8286425639019727},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.825455907073316},{"content":"Is creative work painful by nature? Nietzsche calls boredom \"that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Maybe it is good for creative stamina to be burned out from time to time.","parent":"posts/Prometheus.txt","score":0.8252656503180937},{"content":"Listening to music","parent":"posts/untitled-9-21-2021.txt","score":0.8244554089859677},{"content":"However, I think there is something understated here, a point he makes briefly that I think is worth exploring further - that what ontology we adopt corresponds to \"our various interests and purposes.\"","parent":"posts/untitled-1-4-2022.txt","score":0.8240046287591674}]}