{"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims. ":[],"I haven't enjoyed reading something this much in a while. Usually I struggle to read more than 10 pages of something at a time, but I found this really engaging. Feels like the right level of philosophical sophistication for me right now - the concepts are comprehensible but still challenging and novel, and the biographical element adds a level of allure as well. ":[],"":[{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext?.txt","score":0.8514450468005932},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext?.txt","score":0.8455138568311819},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8437967333727141},{"content":"You're viewing this on a statically generated blog using Yurt!","parent":"posts/What is Yurt?.txt","score":0.8352868364347527},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8349617781702803},{"content":"Yurt is a static site generator, built off the same principles as Nomad Hypertext.","parent":"posts/What is Yurt?.txt","score":0.83147189188003},{"content":"// 1. Section Title","parent":"posts/Plaintext is your best friend.txt","score":0.8310407432809674},{"content":"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.","parent":"posts/What is Nomad Hypertext?.txt","score":0.8308738608102689},{"content":"In any case I wanted to try something new because that's what Recurse is all about, so I tried making a project with just JS and JSDoc for some semblance of type safety.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8289505733587093},{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext?.txt","score":0.8286014862219001},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt?.txt","score":0.82507608178487},{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text. Semantic search is all you need!","parent":"posts/What is Nomad Hypertext?.txt","score":0.8244515437960355},{"content":"I avoided this IPC-executable approach because I thought it'd be really complicated. To some extent, this was the correct decision - I'm glad I got a MVP of my project out during my time at Recurse.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8238590967309432},{"content":"Of course, if you're looking to raise a billion dollars on your consumer-facing notetaking app, plain text won't cut it. Lucky for us all, Jerome Powell has acted wisely to proscribe this possibility.","parent":"posts/Plaintext is your best friend.txt","score":0.8232601672203171},{"content":"The app is free and open source. Notes are stored as plain text files, which means you are free to use tools like git to sync them across multiple devices, and free to port your notes over to other apps if you wish.","parent":"posts/What is Nomad Hypertext?.txt","score":0.8229781287130151},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8220398049687068},{"content":"However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. \n\nFactoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8218034323666665},{"content":"The fact that most people interact with computers through web and mobile was not some foregone conclusion. It took serious effort and ingenuity from really smart people to make these platforms accessible to regular people. Once upon a time, filesystems and personal computers were the dominant paradigm of computing, and it was web and mobile that were strange, inaccessible pipe dreams. Increasingly, the opposite is the case.","parent":"posts/The AI-first operating system of the future.txt","score":0.8198483747080119},{"content":"The other thing I miss is links. You can still paste urls, however. It's ugly but it works.","parent":"posts/Plaintext is your best friend.txt","score":0.8196808161560437},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search\nGives inspiration","parent":"posts/What is Nomad Hypertext?.txt","score":0.8171806181110879}],"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.":[{"content":"I avoided this IPC-executable approach because I thought it'd be really complicated. To some extent, this was the correct decision - I'm glad I got a MVP of my project out during my time at Recurse.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8246436272233515},{"content":"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.","parent":"posts/What is Nomad Hypertext?.txt","score":0.8225964732459458},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8223203419351527},{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext?.txt","score":0.813962309176256},{"content":"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.","parent":"posts/Plaintext is your best friend.txt","score":0.8135600605202488},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search\nGives inspiration","parent":"posts/What is Nomad Hypertext?.txt","score":0.8109419015233924},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext?.txt","score":0.8075545966791916},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8045992477335775},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt?.txt","score":0.8029374961339173},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8026461676069125}],"[[Spinoza]] seems to reject the ego in favor of something transcendent - Goldstein claims in [[Betraying Spinoza]] that he thinks that as we become more rational, we increasingly have the same identity.":[],"Thoughts on the book":[],"An interesting contrast here, because as Goldstein herself admits, her project aims to understand Spinoza the man, going directly against his radically self effacing philosophy.":[],"I have an instinctive negative reaction against any sort of philosophy that preaches against personal identity/ego. The psychological reason for this is probably that I am a proud person. [[personal-reflection]]":[],"However I think I can also provide a principled argument against this \"anti-ego/pro-transcendental\" (albeit one that is also somewhat psychological). Along the lines of Nietzsche's argument, philosophy is deeply personal, and more often than not it reflects contingencies about the philosopher's personality rather than uncovering deep timeless truths. It seems to be the case that most philosophers who argue in favor of something transcendental and against the \"ego\" or \"personal identity\" are self-effacing individuals already. It's not like they'd be giving up much by renouncing their personal identities. Also, it's not particularly impressive for someone who's naturally humble to preach the virtues of humility - in a sense it seems like they're simply deifying aspects of their personality, rather than presenting a principled argument.":[],"Also contrast to [[Nietzsche]]'s famous dictum that all philosophy is a kind of personal confession on the part of the philosopher. This certainly seems true to an extent - a lot of biographers think Spinoza built his system out of need to cope with his own loneliness. ":[],"I do remember reading somewhere that Nietzsche admired Spinoza, so I'm curious to see how he resolved (or didn't resolve) the tension between his views on [[philosophy]] and Spinoza's. ":[]}