{"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world. ":[{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"What do I use [[exegesis]] for? I use it like a journal. I write down thoughts about my life, ideas that I have, things that I'd like to do, reflections on my day, etc. etc. None of these things could be called knowledge, none of them could be called rational.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.9325189719376096},{"content":"If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.9309662879427415},{"content":"My favorite use of [[exegesis]] is to write down ideas that I have. I write about exegesis in exegesis, and a lot of features that I've added to exegesis started as sudden thoughts that were captured in exegesis. In my experience, ideas are like seeds, and writing them down helps them grow. I might think nothing of a simple idea I capture one day, but a week later it might have renewed significance, and it could even spark new ideas.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.9204535210795549},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":0.9168586558988778},{"content":"Having done this daily exegesis braindump [[journal]] thing for a bit, I think there's something of value to her response. I get down my thoughts *easier* in my journal posts than I do in my private exegesis posts.","parent":"posts/untitled-9-24-2021.txt","score":0.9156947457519865},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.9048135380851756},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.9020240412279297},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.9010508251795031},{"content":"Exegesis is the Apple Notes to Roam Research's Microsoft Word. It is less powerful, but it is simpler. A notetaking app should not force your mind to conform to it, it should conform to your mind. Personally, I prefer having an open document to write into over a bullet point system, even if the latter allows for more complex queries and notetaking systems. Some people hate both and prefer the simplicity of pen and paper. Do what works for you.","parent":"posts/Second Brains.txt","score":0.9003354454865785},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter.txt","score":0.8999295473718216},{"content":"exegesis as crm [[exegesis]] [[ideas]]","parent":"posts/untitled-9-20-2021.txt","score":0.896231603817275},{"content":"What is the point of exegesis then? The point is serendipity - it's a place for me to capture little scraps of thought - ideas, feelings, anything that comes to you at the moment.","parent":"posts/Second Brains.txt","score":0.8962019179573077},{"content":"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]]","parent":"posts/untitled-9-20-2021.txt","score":0.8932716537390971},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8899315299705703},{"content":"If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.","parent":"posts/Second Brains.txt","score":0.8888198157212217},{"content":"Having talked to some users, it seems they use it the same way. Some have used [[exegesis]] to write short stories, other use it to write rap verses, but at the end of the day the focus is more on creativity rather than knowledge.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8883876830594916},{"content":"In writing this essay, I checked everything tagged \"exegesis\" and \"personal-reflection\" in exegesis. I didn't tag those thoughts for the purpose of writing this essay, they were written down spontaneously. That they have helped me write this essay is serendipitous.","parent":"posts/Second Brains.txt","score":0.8873491431085083},{"content":"The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well.","parent":"posts/Goals for Spring Quarter.txt","score":0.8873082460495374},{"content":"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.","parent":"posts/Reflections for the New Year.txt","score":0.8871434931888685}],"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking. ":[{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.9115426969432638},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.9042270891449413},{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis.txt","score":0.8974209097629069},{"content":"What do I use [[exegesis]] for? I use it like a journal. I write down thoughts about my life, ideas that I have, things that I'd like to do, reflections on my day, etc. etc. None of these things could be called knowledge, none of them could be called rational.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8971890183422168},{"content":"In other words, I don't use [[exegesis]] as a PKM at all, because very little of what I write in exegesis could be considered \"knowledge.\" I don't use it as a memory aide either, because when I'm learning something I almost never take notes. Instead, it's a way for me to form connections between ideas and reflections that I have. It's a tool for creative thought.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8965326340625748},{"content":"I made exegesis because I cannot organize. I struggle to organize my thoughts, I struggle to organize my belongings, I struggle to organize my priorities, I struggle to organize my life. Since Kindergarten, well meaning teachers have tried to help me stay organized to no avail; I have vivid memories of my 6th grade homeroom teacher holding me back during recess to help me organize my binder and desk, which were a mess of loose papers I had haphazardly shoved in. A failure to stay organized has been the proverbial monkey on my back for much of my life.","parent":"posts/Why I made exegesis.txt","score":0.8958137286912269},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.8899315299705703},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8896138662792025},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8890468930572265},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.8880184138332234},{"content":"exegesis as crm [[exegesis]] [[ideas]]","parent":"posts/untitled-9-20-2021.txt","score":0.884583200095724},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.8844738324822932},{"content":"If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8838165695014125},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8818007235559244},{"content":"What is the point of exegesis then? The point is serendipity - it's a place for me to capture little scraps of thought - ideas, feelings, anything that comes to you at the moment.","parent":"posts/Second Brains.txt","score":0.8809962496953673},{"content":"So too, there exists a tool for each person that would vindicate their peculiarities. It is my hope that exegesis will vindicate chaos, disorganization, messiness, disorder, and all other epithets hitherto applied to what is rightfully called creativity.","parent":"posts/Why I made exegesis.txt","score":0.8807616592600295},{"content":"None of it worked, because the word disorganized is really just an epithet for nonlinear.","parent":"posts/Why I made exegesis.txt","score":0.8783414387073449},{"content":"In some sense exegesis gave birth to itself, because I used it to organize my ideas about exegesis. On days where exegesis was not working because I had broken something while coding it, I noticed that I could not think as clearly. Its absence was felt.","parent":"posts/Second Brains.txt","score":0.8779604509434352},{"content":"Having done this daily exegesis braindump [[journal]] thing for a bit, I think there's something of value to her response. I get down my thoughts *easier* in my journal posts than I do in my private exegesis posts.","parent":"posts/untitled-9-24-2021.txt","score":0.877288464071969}],"This morning I was listening to a podcast suggested by [[Linus Lee]] - Changelog. I don't usually listen to podcasts, but I have had good experiences with audiobooks in the past. It was nice being able to absorb information over breakfast without staring at a screen. The subject material was interesting; it was some CMU professor doing research on individual programmers and the myth of the \"10x developer.\" ":[{"content":"This morning I was listening to a podcast suggested by [[Linus Lee]] - Changelog. I don't usually listen to podcasts, but I have had good experiences with audiobooks in the past. It was nice being able to absorb information over breakfast without staring at a screen. The subject material was interesting; it was some CMU professor doing research on individual programmers and the myth of the \"10x developer.\"","parent":"posts/untitled-9-20-2021.txt","score":1.0000000000000002},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8475385335261081},{"content":"Some thoughts from this morning. Sitting in the Peet's cafe near the gym at UC Davis, listening to 80s synthwave.","parent":"posts/untitled-9-21-2021.txt","score":0.8400051263972576},{"content":"I want to learn more code. Working on [[exegesis]] over the course of a year, I saw my coding ability improve substantially. Towards the last 2 months, while rewriting a part of the codebase, I found myself dumbfounded by some of the decisions and patterns I had used a year earlier. The code I wrote towards the end was noticeably cleaner and more maintainable, mostly because I had familiarized myself with [[React]] hooks. Learning NextJS and GraphQL was also very rewarding, and both technologies were used extensively in the final version of exegesis. Looking forwards, I am thinking about learning Go, Clojure and maybe Rust. Go is the most practical one of all these for my purposes, and could open up a lot of job offers. Clojure is the most interesting from a theoretical standpoint, since I've never used a lisp or functional language. Rust is interesting because I hate systems/low-level programming, but I suspect that might only be because I hate C, and maybe Rust's more modern features will sell me on it.","parent":"posts/Reflections for the New Year.txt","score":0.8388652644380671},{"content":"That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]]","parent":"posts/Reflections on exegesis.txt","score":0.8382804782601327},{"content":"These are my hobbies that I use to take a break from code related creative-work.","parent":"posts/Goals for Spring Quarter.txt","score":0.8373785643821987},{"content":"Learn more code (new languages, new frameworks, new databases, fancy tech like blockchain and ML, etc. etc.)","parent":"posts/Goals for Spring Quarter.txt","score":0.8361923973669639},{"content":"The steady rhythm of school and myriad 30-minute break periods it produces throughout the day have a good effect on my productivity, which is surprising. There's that famous [Paul Graham essay](http://www.paulgraham.com/makersschedule.html) where he talks about hacker schedules, or how programmers/creators prefer long periods of focused time over short fragmented work periods (that managers tend to prefer) because there's an overhead cost to loading a project into your head. [[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8349357128909403},{"content":"Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]]","parent":"posts/untitled-9-21-2021.txt","score":0.8343317232509494},{"content":"Finally, I want to take my studies more seriously. Next quarter, I am taking upper division classes on statistics for CS, databases, and information interfaces. I am especially excited about the database class, since database design problems were a big part of what I struggled with while building exegesis. I am also excited about the information interfaces class - exegesis is really just one giant information interface, isn't it? I cannot say I am excited about the stats class, I have never been fond of or good at math, but I will try to brave it with a stiff upper lip. I am considering posting my notes for these classes on [[exegesis]], so I can share them with classmates.","parent":"posts/Reflections for the New Year.txt","score":0.8339538940440534},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.831823548825344},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8318139223520522},{"content":"Some thoughts on my Operating Systems course.","parent":"posts/untitled-10-11-2021.txt","score":0.830879908239652},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8302502214053309},{"content":"I avoided this IPC-executable approach because I thought it'd be really complicated. To some extent, this was the correct decision - I'm glad I got a MVP of my project out during my time at Recurse.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8299596220993631},{"content":"I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.829848491247306},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.8298265959691473},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.827989406644544},{"content":"To make regular progress towards personal projects, I'll be writing more on my development progress with [[exegesis]], under the tag [[devlog]]. I'll also be publishing another post soon on my plans for future features, and when I expect to release them by. I will do something similar with my other projects.","parent":"posts/Goals for Spring Quarter.txt","score":0.8275002507025598},{"content":"Also encouraging was the fact that I started hearing about similar notetaking apps a couple months into developing exegesis. Apps like Roam Research, and Obsidian were making waves on Twitter, and were taking a similar approach to nonlinear writing that I wanted to take exegesis in. This proved that I wasn't alone in needing this kind of product.","parent":"posts/Second Brains.txt","score":0.8272902993728372}],"":[{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8593290080388},{"content":"The club does 2 things.","parent":"posts/untitled-9-24-2021.txt","score":0.8589669169415844},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8577220980911441},{"content":"Code:","parent":"posts/Goals for Spring Quarter.txt","score":0.856649564390397},{"content":"Executing","parent":"posts/Goals for Spring Quarter.txt","score":0.8556654491388678},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter.txt","score":0.8537043599402795},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8499151373626692},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter.txt","score":0.8497861585687644},{"content":"Learn a grappling art (because of quarantine, this will just be maintaining general fitness levels for now)","parent":"posts/Goals for Spring Quarter.txt","score":0.8496945903933114},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter.txt","score":0.8478182318510581},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8472546071060495},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8467379006001533},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8456538970968254},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8455300536527719},{"content":"I'm taking a gap quarter this Spring to work on some personal projects. It is always better to have a plan than to have no plan, even if things don't work out your way, so here are some tentative goals for my gap quarter.","parent":"posts/Goals for Spring Quarter.txt","score":0.8451682294721505},{"content":"Writing cascades","parent":"posts/untitled-10-1-2021.txt","score":0.8444322593169847},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8437967333727141},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.8436725970663741},{"content":"Sitting in the MU again, this time with a view of the quad. Listening to \"The Time of the Season\" by the Zombies.","parent":"posts/untitled-9-24-2021.txt","score":0.8434310607466774},{"content":"Visual developer tools","parent":"posts/untitled-9-24-2021.txt","score":0.8428686770659811}],"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]] ":[{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.9334015747868434},{"content":"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]]","parent":"posts/untitled-9-20-2021.txt","score":0.9325768103066472},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.9276481840238794},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.9042270891449413},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.9010508251795031},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.9007216455654037},{"content":"I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.","parent":"posts/Reflections for the New Year.txt","score":0.8973004712188722},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8924633048278167},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8915197650205969},{"content":"exegesis as crm [[exegesis]] [[ideas]]","parent":"posts/untitled-9-20-2021.txt","score":0.8913120988821076},{"content":"My favorite use of [[exegesis]] is to write down ideas that I have. I write about exegesis in exegesis, and a lot of features that I've added to exegesis started as sudden thoughts that were captured in exegesis. In my experience, ideas are like seeds, and writing them down helps them grow. I might think nothing of a simple idea I capture one day, but a week later it might have renewed significance, and it could even spark new ideas.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8904553342124597},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.8860343434504927},{"content":"So too, there exists a tool for each person that would vindicate their peculiarities. It is my hope that exegesis will vindicate chaos, disorganization, messiness, disorder, and all other epithets hitherto applied to what is rightfully called creativity.","parent":"posts/Why I made exegesis.txt","score":0.8858691922599984},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter.txt","score":0.8828800841704305},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.882565981620899},{"content":"What do I use [[exegesis]] for? I use it like a journal. I write down thoughts about my life, ideas that I have, things that I'd like to do, reflections on my day, etc. etc. None of these things could be called knowledge, none of them could be called rational.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8807131897580679},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.8790942818749736},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8789643035288699},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":0.8784504962759445}],"exegesis as crm [[exegesis]] [[ideas]] ":[{"content":"exegesis as crm [[exegesis]] [[ideas]]","parent":"posts/untitled-9-20-2021.txt","score":0.9999999999999999},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.9052734631890372},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.896231603817275},{"content":"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]]","parent":"posts/untitled-9-20-2021.txt","score":0.8926404327377382},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8913120988821076},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter.txt","score":0.8881642367301907},{"content":"My favorite use of [[exegesis]] is to write down ideas that I have. I write about exegesis in exegesis, and a lot of features that I've added to exegesis started as sudden thoughts that were captured in exegesis. In my experience, ideas are like seeds, and writing them down helps them grow. I might think nothing of a simple idea I capture one day, but a week later it might have renewed significance, and it could even spark new ideas.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8868030997069951},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":0.8846687390219252},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.884583200095724},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.879990206512073},{"content":"I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.","parent":"posts/Reflections for the New Year.txt","score":0.879337016602684},{"content":"What do I use [[exegesis]] for? I use it like a journal. I write down thoughts about my life, ideas that I have, things that I'd like to do, reflections on my day, etc. etc. None of these things could be called knowledge, none of them could be called rational.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8759159240173648},{"content":"What is the point of exegesis then? The point is serendipity - it's a place for me to capture little scraps of thought - ideas, feelings, anything that comes to you at the moment.","parent":"posts/Second Brains.txt","score":0.8729978406128615},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8722544749125075},{"content":"So too, there exists a tool for each person that would vindicate their peculiarities. It is my hope that exegesis will vindicate chaos, disorganization, messiness, disorder, and all other epithets hitherto applied to what is rightfully called creativity.","parent":"posts/Why I made exegesis.txt","score":0.8719303640121739},{"content":"Having talked to some users, it seems they use it the same way. Some have used [[exegesis]] to write short stories, other use it to write rap verses, but at the end of the day the focus is more on creativity rather than knowledge.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.870168304677883},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.869728801227555},{"content":"Finally, I want to take my studies more seriously. Next quarter, I am taking upper division classes on statistics for CS, databases, and information interfaces. I am especially excited about the database class, since database design problems were a big part of what I struggled with while building exegesis. I am also excited about the information interfaces class - exegesis is really just one giant information interface, isn't it? I cannot say I am excited about the stats class, I have never been fond of or good at math, but I will try to brave it with a stiff upper lip. I am considering posting my notes for these classes on [[exegesis]], so I can share them with classmates.","parent":"posts/Reflections for the New Year.txt","score":0.8680868660289716},{"content":"In other words, I don't use [[exegesis]] as a PKM at all, because very little of what I write in exegesis could be considered \"knowledge.\" I don't use it as a memory aide either, because when I'm learning something I almost never take notes. Instead, it's a way for me to form connections between ideas and reflections that I have. It's a tool for creative thought.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8673556663517673},{"content":"Exegesis is the Apple Notes to Roam Research's Microsoft Word. It is less powerful, but it is simpler. A notetaking app should not force your mind to conform to it, it should conform to your mind. Personally, I prefer having an open document to write into over a bullet point system, even if the latter allows for more complex queries and notetaking systems. Some people hate both and prefer the simplicity of pen and paper. Do what works for you.","parent":"posts/Second Brains.txt","score":0.8672579633843187}],"Finished Capitalist Realism":[{"content":"Finished Capitalist Realism","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.8968488672036907},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8786671441989431},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8652323083481256},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8626127925835241},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8420267973943428},{"content":"Yesterday I picked up a copy of [[Habermas]], a very short introduction at a used bookstore, because I recognized the name and it was $2.50 (my bookshelf is littered with books I purchased for similar reasons). The last book I read in the series was the very short introduction to Kant by Roger Scruton, which I enjoyed thoroughly.","parent":"posts/untitled-9-21-2021.txt","score":0.8249471760810089},{"content":"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8192448160024911},{"content":"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.","parent":"posts/untitled-9-20-2021.txt","score":0.8187238819756583},{"content":"That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]]","parent":"posts/Reflections on exegesis.txt","score":0.8178047143497555},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.8137121597988167},{"content":"Rational men at war with rationality","parent":"posts/untitled-9-21-2021.txt","score":0.8096816420110774},{"content":"\"[Adam] Curtis attacks the internet because in his view it facilitates communities of solipsists, interpassive networks of like-minds who confirm, rather than challenge, each others' assumptions and prejudices.... Curtis' critique has a point, but it misses important dimensions of what is happening on the net. Contrary to Curtis' account of blogging, blogs can generate new discourse networks that have no correlate in the social field outside cyberspace.\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8074977701159672},{"content":"I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.","parent":"posts/Fragments.txt","score":0.8063066818655963},{"content":"For a while, I exclusively worked on a long, serious projects. I wanted to build a billion dollar product. I wanted to be the founder of a successful startup. I wanted to write, but I wanted to write on my own platform that everybody else would also write on, that would have all the features I wanted that everybody else would love.","parent":"posts/Fragments.txt","score":0.8059972927621524},{"content":"[I'm reminded of the distinction made between Societies of Discipline and Societies of Control.](https://www.youtube.com/watch?v=B_i8_WuyqAY&ab_channel=Jonas%C4%8Ceika-CCKPhilosophy) Societies of Discipline control individual behavior by making restrictions in time in space (e.g. by requiring factory workers to be in the factory at certain hours, etc. etc.), while Societies of Control allow free movement but assert control through more direct, often computerized means.","parent":"posts/untitled-9-30-2021.txt","score":0.8057549609897564},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.805365993148043},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8050063012221172},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.80242529387545},{"content":"I could not help but find this extraordinarily similar to what the protagonist and narrator of [[Zen and the Art of Motorcycle Repair]] goes through - he starts as a scientist, looks for justifications for science in philosophy, becomes frustrated with philosophy and eventually embraces esotericism before going insane. The instrumental rationality that the Critical Theorists disliked seems roughly equivalent to the \"classical rationality\" Phaedrus talks about in [[Zen and the Art of Motorcycle Repair]] as well.","parent":"posts/untitled-9-21-2021.txt","score":0.8015625126720954}],"Some incredibly interesting excerpts I want to quote directly (emphases all mine):":[{"content":"Some incredibly interesting excerpts I want to quote directly (emphases all mine):","parent":"posts/untitled-9-20-2021.txt","score":0.9999999999999998},{"content":"\"From the moment I understood the weakness of my flesh, it disgusted me. I craved for strength and certainty of steel. I aspired to the purity of the blessed machine. Your kind cling to your flesh, as though it will not decay and fail you. One day the crude biomass you call a temple will wither and you will beg my kind to save you.\n\nBut I am already saved. For the Machine is immortal.\"\n\n- Magos Dominus Reditus, Warhammer 40k","parent":"posts/Second Brains.txt","score":0.865380780432097},{"content":"2. My critique here is nothing original - it echoes a lot of what Andy [[Matuschak]] and [[Linus Lee]] have touched upon in their essays. Here's a brief excerpt from [Linus' blog post](https://thesephist.com/posts/browser/) that expresses the point more eloquently:","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.847481577207975},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.8467530387638649},{"content":"In writing this essay, I checked everything tagged \"exegesis\" and \"personal-reflection\" in exegesis. I didn't tag those thoughts for the purpose of writing this essay, they were written down spontaneously. That they have helped me write this essay is serendipitous.","parent":"posts/Second Brains.txt","score":0.8421646313151415},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8415507692780719},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.8402848351875937},{"content":"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]]","parent":"posts/untitled-9-20-2021.txt","score":0.8401562465105822},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8344660057909203},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness.txt","score":0.8316107007359168},{"content":"\"Marino saw the rose, as Adam had seen it in Paradise, and he realized that it lay within its own eternity, not within his words, and that we might speak about the rose, allude to it, but never truly express it, and that the tall haughty volumes that made a golden dimness in the corner of his room were not (as his vanity had dreamed them) a mirror of the world, but just another thing added to the world's contents.\"","parent":"posts/On auteurs and language.txt","score":0.8286230914134729},{"content":"It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]]","parent":"posts/untitled-9-21-2021.txt","score":0.8286033807851436},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8277036115226241},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8241606621373904},{"content":"What is the point of exegesis then? The point is serendipity - it's a place for me to capture little scraps of thought - ideas, feelings, anything that comes to you at the moment.","parent":"posts/Second Brains.txt","score":0.8234195858480774},{"content":"This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"","parent":"posts/Second Brains.txt","score":0.8230457976318601},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8207068461882975},{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.820480329860304},{"content":"For a while, I exclusively worked on a long, serious projects. I wanted to build a billion dollar product. I wanted to be the founder of a successful startup. I wanted to write, but I wanted to write on my own platform that everybody else would also write on, that would have all the features I wanted that everybody else would love.","parent":"posts/Fragments.txt","score":0.81712484674976},{"content":"In [[Reflections for the New Year]], I outlined some things I wanted to get done this year. In no particular order, my goals were to:","parent":"posts/Goals for Spring Quarter.txt","score":0.8170487925557415}],"Adam Curtis and the internet":[{"content":"Adam Curtis and the internet","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"\"[Adam] Curtis attacks the internet because in his view it facilitates communities of solipsists, interpassive networks of like-minds who confirm, rather than challenge, each others' assumptions and prejudices.... Curtis' critique has a point, but it misses important dimensions of what is happening on the net. Contrary to Curtis' account of blogging, blogs can generate new discourse networks that have no correlate in the social field outside cyberspace.\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.9195987878107851},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots.txt","score":0.8444836401763024},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8405831622779346},{"content":"I don't think it's possible to fix our information ecosystem. In fact, I don't even know if it'd be desirable to fix it - as perverse as it is, there is also a chaotically beautiful side to the internet.","parent":"posts/Giant Robots.txt","score":0.8394367009691819},{"content":"The fact that most people interact with computers through web and mobile was not some foregone conclusion. It took serious effort and ingenuity from really smart people to make these platforms accessible to regular people. Once upon a time, filesystems and personal computers were the dominant paradigm of computing, and it was web and mobile that were strange, inaccessible pipe dreams. Increasingly, the opposite is the case.","parent":"posts/The AI-first operating system of the future.txt","score":0.8270575923013099},{"content":"If the internet is a hurricane of information, let us build steely exoskeletons to weather the storm.","parent":"posts/Giant Robots.txt","score":0.8257427331699225},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.8221201892192045},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8219314748739389},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.8208609998422777},{"content":"The goal is to recreate the feeling of a musical jam session, but in a website.","parent":"posts/untitled-9-24-2021.txt","score":0.8195694230068687},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.8170537567770982},{"content":"I spend an inordinate amount of time on Youtube. Having noticed this one morning, I quietly told myself that I wouldn't check Youtube for the rest of the work session - only to find that I would unconsciously press \"Y+enter\" and let the address bar's autocomplete lead me to Youtube. I would find myself on the site, not remembering how I had gotten there. More importantly, the home page recommendations had learned my preferences incredibly well. As soon as I landed on Youtube, there would be at least one video there ready for me to watch. That morning, I got nothing done. Youtube's algorithm had figured out that I really liked watching short clips of Mad Men and provided me a steady drip-feed of them, which I gorged on instead of getting anything done.","parent":"posts/Controlling what you see.txt","score":0.8135862595818825},{"content":"In general, computers have enabled the Promethean task of stealing creative abilities previously reserved for deities. Musicians have their electrically amplified instruments, their DAWs, the vast oceans of samples available on the internet; artists have been blessed with digital canvases, 3D modeling, and the ubiquity of screens that renders a possible canvas in every man's pocket.","parent":"posts/Prometheus.txt","score":0.8132347301417396},{"content":"Did the internet ruin my brain? No, I don't think either style of thinking is superior. Both have their place, and besides it's not like I'm incapable of linear thinking (I hope this essay is flowing in a somewhat logical manner!","parent":"posts/Why I made exegesis.txt","score":0.8110710515865541},{"content":"It is current year. Armed with fleets of server racks and neural nets trained upon eons of GPU compute time, social media conglomerates have razed and pillaged your attention span with a steady drip feed of content algorithmically optimized to deliver maximal doses of dopamine. Half the time you open your phone, you forget what you opened it for in the first place (checking the weather? for an important email?) and somehow end up on one of the many like farms installed on your phone, your thumbs scrolling like runners on a treadmill.","parent":"posts/Manifesto.txt","score":0.8108901179701493},{"content":"This morning I was listening to a podcast suggested by [[Linus Lee]] - Changelog. I don't usually listen to podcasts, but I have had good experiences with audiobooks in the past. It was nice being able to absorb information over breakfast without staring at a screen. The subject material was interesting; it was some CMU professor doing research on individual programmers and the myth of the \"10x developer.\"","parent":"posts/untitled-9-20-2021.txt","score":0.8106095119205392},{"content":"But the user has chosen to open Facebook, and chosen to sign up for the service. Isn't this a philosophical question about choice? Isn't free will real?","parent":"posts/Giant Robots.txt","score":0.8103758741264254},{"content":"Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].","parent":"posts/untitled-9-24-2021.txt","score":0.8101144681225347},{"content":"Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8078425153878968}],"\"[Adam] Curtis attacks the internet because in his view it facilitates communities of solipsists, interpassive networks of like-minds who confirm, rather than challenge, each others' assumptions and prejudices.... Curtis' critique has a point, but it misses important dimensions of what is happening on the net. Contrary to Curtis' account of blogging, blogs can generate new discourse networks that have no correlate in the social field outside cyberspace.\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] ":[{"content":"\"[Adam] Curtis attacks the internet because in his view it facilitates communities of solipsists, interpassive networks of like-minds who confirm, rather than challenge, each others' assumptions and prejudices.... Curtis' critique has a point, but it misses important dimensions of what is happening on the net. Contrary to Curtis' account of blogging, blogs can generate new discourse networks that have no correlate in the social field outside cyberspace.\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":1.0000000000000002},{"content":"Adam Curtis and the internet","parent":"posts/untitled-9-20-2021.txt","score":0.9195987878107851},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.9033705801180478},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8483417884159065},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.848029502386834},{"content":"2. My critique here is nothing original - it echoes a lot of what Andy [[Matuschak]] and [[Linus Lee]] have touched upon in their essays. Here's a brief excerpt from [Linus' blog post](https://thesephist.com/posts/browser/) that expresses the point more eloquently:","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8477608036438196},{"content":"Did the internet ruin my brain? No, I don't think either style of thinking is superior. Both have their place, and besides it's not like I'm incapable of linear thinking (I hope this essay is flowing in a somewhat logical manner!","parent":"posts/Why I made exegesis.txt","score":0.8475793611595268},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8466548776562527},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.846149582386581},{"content":"Naturally, [[Habermas]]'s thoughts on the public sphere - which referred to salons, coffee shops and other public spaces in his day, and probably the internet today - are relevant to the social features of [[exegesis]].","parent":"posts/untitled-9-21-2021.txt","score":0.8449169044069272},{"content":"I don't think it's possible to fix our information ecosystem. In fact, I don't even know if it'd be desirable to fix it - as perverse as it is, there is also a chaotically beautiful side to the internet.","parent":"posts/Giant Robots.txt","score":0.8439652075798616},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8423989398551123},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":0.8395723450983613},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots.txt","score":0.8378831268022711},{"content":"I think Computer Science is also subject to this double hermeneutic. The best example of this is computer security. Best practices are researched by computer scientists, and strategies against them are developed by security researchers and malicious actors. Conclusions are reached about how to best design computer systems, but these conclusions never last very long, because hostile actors have incentives to disrupt these conclusions. In the same way that social theories can be invalidated by people's awareness of those social theories, conclusions on computer system can as well.","parent":"posts/untitled-10-11-2021.txt","score":0.8365789132477118},{"content":"Class starts tomorrow. It's been a while since I've read the strangely authoritarian language of a course syllabus, a long string of \"thou shalt not\"s followed by more prohibitions and percentages. Thinking about the anti-educational-institution streak in certain tech circles and the many projects aiming to replace the university, I wonder if this kind of authoritarianism is inherent to education. Most alt-ed projects promise to liberate students from pointless assessments and the caprice of individual instructors but I wonder if these might be empty promises, like how most revolutionary movements end up becoming oppressive themselves.[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8357494826206224},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8350800879705036},{"content":"The auteur believes otherwise. Language, he says, cannot communicate an idea without botching it. And if communicating an idea were not bad enough, mediating between multiple ideas using as flawed a tool as language is immeasurably worse.","parent":"posts/On auteurs and language.txt","score":0.8350213270724287},{"content":"If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8347556389477583},{"content":"I want to read more. I started reading a lot more in quarantine, but slowed down towards the end of 2020 because I was spending a lot more time on [[exegesis]]. Now that I have more time, I want to start a steady reading habit. The particular corner of [[twitter]] I hang around is fond of citing various philosophers and ideas, many of which I'm interested in, but have never taken the time to study closely. This year, I want to dig deeper into these ideas, go beyond surface-level Twitter philosophy memes and Youtube philosophy videos and read some proper primary sources. Around this time last year, I read Roger Scruton's A very short introduction to Kant. I want to tackle the Critique of Pure Reason sometime this year. I may live-blog my notes on exegesis (though I can't guarantee they'll be very good).","parent":"posts/Reflections for the New Year.txt","score":0.8347052329703749}],"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.":[{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.9999999999999999},{"content":"Finished Capitalist Realism","parent":"posts/untitled-9-20-2021.txt","score":0.8968488672036907},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8913138637844572},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8650607165110826},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8641323330524773},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8635318882476856},{"content":"Fischer on possibility","parent":"posts/untitled-9-20-2021.txt","score":0.8510578942949961},{"content":"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.","parent":"posts/untitled-9-20-2021.txt","score":0.8457247871184304},{"content":"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8419112541551838},{"content":"I could not help but find this extraordinarily similar to what the protagonist and narrator of [[Zen and the Art of Motorcycle Repair]] goes through - he starts as a scientist, looks for justifications for science in philosophy, becomes frustrated with philosophy and eventually embraces esotericism before going insane. The instrumental rationality that the Critical Theorists disliked seems roughly equivalent to the \"classical rationality\" Phaedrus talks about in [[Zen and the Art of Motorcycle Repair]] as well.","parent":"posts/untitled-9-21-2021.txt","score":0.8391304816931092},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8359102649879233},{"content":"Yesterday I picked up a copy of [[Habermas]], a very short introduction at a used bookstore, because I recognized the name and it was $2.50 (my bookshelf is littered with books I purchased for similar reasons). The last book I read in the series was the very short introduction to Kant by Roger Scruton, which I enjoyed thoroughly.","parent":"posts/untitled-9-21-2021.txt","score":0.8350991938071374},{"content":"Read more (both fiction and non-fiction)","parent":"posts/Goals for Spring Quarter.txt","score":0.8332659648507205},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.8315491359498769},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.828834367553021},{"content":"Fischer on making weird shit","parent":"posts/untitled-9-20-2021.txt","score":0.8220992160595151},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness.txt","score":0.8209309751808914},{"content":"That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]]","parent":"posts/Reflections on exegesis.txt","score":0.8185451210276777},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8151172301055528},{"content":"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]]","parent":"posts/untitled-9-20-2021.txt","score":0.8150400438379614}],"Fischer on making weird shit":[{"content":"Fischer on making weird shit","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"Fischer on possibility","parent":"posts/untitled-9-20-2021.txt","score":0.8985050258091287},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8585919689535623},{"content":"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8466530454677761},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8236098663240758},{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.8220992160595151},{"content":"[Take this video for example.](https://www.youtube.com/watch?v=uMCSdgkdOJc&t=363s) It's titled 'this playlist will make you feel like a 19th century villain,' and it's a playlist full of mostly romantic-era orchestral pieces. But here, the music isn't just the music: there is a stylish photo of classical architecture to go with it, Tchaikovsky is introduced as 'Pyotr F*CKING Tchaikovsky,' and the description contains an edgy sounding Oscar Wilde quote to really set the mood.  Most importantly, the comments section is full of people playing along with the 19th century villain premise, cracking jokes about how the Youtube algorithm clearly wants them to join the Dark Side. One commenter describes the playlist with this pithy remark: \"committing serial homicide at the 1893 world's fair type beat.\"","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8216951547592617},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8215844633873655},{"content":"Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all.","parent":"posts/On auteurs and language.txt","score":0.816234013207793},{"content":"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.","parent":"posts/untitled-9-20-2021.txt","score":0.8111384996570683},{"content":"The auteur believes otherwise. Language, he says, cannot communicate an idea without botching it. And if communicating an idea were not bad enough, mediating between multiple ideas using as flawed a tool as language is immeasurably worse.","parent":"posts/On auteurs and language.txt","score":0.805938307421176},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness.txt","score":0.8058603011563777},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8055358865326836},{"content":"\"From the moment I understood the weakness of my flesh, it disgusted me. I craved for strength and certainty of steel. I aspired to the purity of the blessed machine. Your kind cling to your flesh, as though it will not decay and fail you. One day the crude biomass you call a temple will wither and you will beg my kind to save you.\n\nBut I am already saved. For the Machine is immortal.\"\n\n- Magos Dominus Reditus, Warhammer 40k","parent":"posts/Second Brains.txt","score":0.8031276141452082},{"content":"But this is something forbidden to mortal men. We face a kind of creative asymmetry - to bring beauty into the world, it is neccessary to confront ugliness. Creating beautiful, original music requires endless, stupid, and frustrating scale practice, finger exercises, and theory study; behind the sublime beauty of a master's painting lies hours of practice filling sketchbooks with mind numbing still lifes and ugly anatomical mistakes. On the one hand, it seems paradoxical that beauty, freedom and originality require ugliness, servitude, and repetition. On the other hand, it is almost coldly rational - perhaps there is a kind of aesthetic entropy at play, like there's a set amount of beauty in the universe, and to \"produce\" any more of it, you first have to take on ugliness as a burden.[[music]] [[aesthetics]] [[art]]","parent":"posts/Prometheus.txt","score":0.8027620845813022},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.8010678913827278}],"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]] ":[{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.9276481840238794},{"content":"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]]","parent":"posts/untitled-9-20-2021.txt","score":0.9101985946604682},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.9064252476397882},{"content":"\"[Adam] Curtis attacks the internet because in his view it facilitates communities of solipsists, interpassive networks of like-minds who confirm, rather than challenge, each others' assumptions and prejudices.... Curtis' critique has a point, but it misses important dimensions of what is happening on the net. Contrary to Curtis' account of blogging, blogs can generate new discourse networks that have no correlate in the social field outside cyberspace.\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.9033705801180478},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8896138662792025},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":0.8864062328547754},{"content":"Naturally, [[Habermas]]'s thoughts on the public sphere - which referred to salons, coffee shops and other public spaces in his day, and probably the internet today - are relevant to the social features of [[exegesis]].","parent":"posts/untitled-9-21-2021.txt","score":0.8812245347536736},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.8811683226565673},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.8810896052975447},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8773035091518336},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.876160663712309},{"content":"Talking to Emma Salinas, I tried convincing her that exegesis was a useful tool for personal reflection. She wasn't convinced, so I asked her what she thought a good way for personal reflection was, and she responded \"talking to people.\"","parent":"posts/untitled-9-24-2021.txt","score":0.8757592312480974},{"content":"What is the point of exegesis then? The point is serendipity - it's a place for me to capture little scraps of thought - ideas, feelings, anything that comes to you at the moment.","parent":"posts/Second Brains.txt","score":0.874362410082901},{"content":"exegesis as crm [[exegesis]] [[ideas]]","parent":"posts/untitled-9-20-2021.txt","score":0.8722544749125075},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter.txt","score":0.8718370087746178},{"content":"If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8690270589516105},{"content":"My favorite use of [[exegesis]] is to write down ideas that I have. I write about exegesis in exegesis, and a lot of features that I've added to exegesis started as sudden thoughts that were captured in exegesis. In my experience, ideas are like seeds, and writing them down helps them grow. I might think nothing of a simple idea I capture one day, but a week later it might have renewed significance, and it could even spark new ideas.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8686276090050784},{"content":"Thinking as social","parent":"posts/untitled-9-24-2021.txt","score":0.8683746707267578},{"content":"I want to read more. I started reading a lot more in quarantine, but slowed down towards the end of 2020 because I was spending a lot more time on [[exegesis]]. Now that I have more time, I want to start a steady reading habit. The particular corner of [[twitter]] I hang around is fond of citing various philosophers and ideas, many of which I'm interested in, but have never taken the time to study closely. This year, I want to dig deeper into these ideas, go beyond surface-level Twitter philosophy memes and Youtube philosophy videos and read some proper primary sources. Around this time last year, I read Roger Scruton's A very short introduction to Kant. I want to tackle the Critique of Pure Reason sometime this year. I may live-blog my notes on exegesis (though I can't guarantee they'll be very good).","parent":"posts/Reflections for the New Year.txt","score":0.8682022290557577}],"Fischer on possibility":[{"content":"Fischer on possibility","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"Fischer on making weird shit","parent":"posts/untitled-9-20-2021.txt","score":0.8985050258091287},{"content":"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8877768026902312},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8563086749585019},{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.8510578942949961},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8438456933325879},{"content":"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.","parent":"posts/untitled-9-20-2021.txt","score":0.8411333036019728},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8402407725819844},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8337904007081485},{"content":"To be sure, he thinks there are different respects in which an ontological theory can be simple - so both physicalist, phenomenalist, and Platonic ontologies can all be worth developing. On this matter I agree with him.","parent":"posts/untitled-1-4-2022.txt","score":0.8249769871397262},{"content":"Human beings can observe the conclusions that social science reach and modify their behavior, which can potentially render those conclusions invalid. This is a complete impossibility in the natural sciences - an atom cannot learn about atomic theories and change its behavior to invalidate those theories.","parent":"posts/untitled-10-11-2021.txt","score":0.8131295897444984},{"content":"The auteur believes otherwise. Language, he says, cannot communicate an idea without botching it. And if communicating an idea were not bad enough, mediating between multiple ideas using as flawed a tool as language is immeasurably worse.","parent":"posts/On auteurs and language.txt","score":0.8091904731155328},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.8089513015645119},{"content":"\"From the moment I understood the weakness of my flesh, it disgusted me. I craved for strength and certainty of steel. I aspired to the purity of the blessed machine. Your kind cling to your flesh, as though it will not decay and fail you. One day the crude biomass you call a temple will wither and you will beg my kind to save you.\n\nBut I am already saved. For the Machine is immortal.\"\n\n- Magos Dominus Reditus, Warhammer 40k","parent":"posts/Second Brains.txt","score":0.8073835199977286},{"content":"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]]","parent":"posts/untitled-9-20-2021.txt","score":0.8069547313455395},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8069538831951442},{"content":"I feel open to the future. I feel that there is meaning in this world, even if I don't know what it is currently, and it may be impossible to pin it down with words. I feel that the bad things that happen in this world do not lead to the conclusion that the world is a bad place. I feel ok not being able to explain everything. I feel I have something valuable to offer to others, I feel others have something valuable to offer to me. Change seems possible, albeit slow, and slowness feels OK.","parent":"posts/untitled-9-30-2021.txt","score":0.8064734426433211},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8060279116840396},{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.8059222689904696},{"content":"In game theory, there are mixed strategic games where the Nash equilibrium for all parties is to choose randomly. Here, the only way to blind one's opponent is to blind oneself too.","parent":"posts/Strategic blindness.txt","score":0.803699059199657}],"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]] ":[{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8871465352977017},{"content":"Finished Capitalist Realism","parent":"posts/untitled-9-20-2021.txt","score":0.8786671441989431},{"content":"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]]","parent":"posts/untitled-9-20-2021.txt","score":0.8636375449479305},{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.8635318882476856},{"content":"\"From the moment I understood the weakness of my flesh, it disgusted me. I craved for strength and certainty of steel. I aspired to the purity of the blessed machine. Your kind cling to your flesh, as though it will not decay and fail you. One day the crude biomass you call a temple will wither and you will beg my kind to save you.\n\nBut I am already saved. For the Machine is immortal.\"\n\n- Magos Dominus Reditus, Warhammer 40k","parent":"posts/Second Brains.txt","score":0.8582623106536025},{"content":"This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"","parent":"posts/Second Brains.txt","score":0.8571456918709669},{"content":"I feel open to the future. I feel that there is meaning in this world, even if I don't know what it is currently, and it may be impossible to pin it down with words. I feel that the bad things that happen in this world do not lead to the conclusion that the world is a bad place. I feel ok not being able to explain everything. I feel I have something valuable to offer to others, I feel others have something valuable to offer to me. Change seems possible, albeit slow, and slowness feels OK.","parent":"posts/untitled-9-30-2021.txt","score":0.8569386619733801},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.8494945223452431},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness.txt","score":0.8491690534429557},{"content":"\"[Adam] Curtis attacks the internet because in his view it facilitates communities of solipsists, interpassive networks of like-minds who confirm, rather than challenge, each others' assumptions and prejudices.... Curtis' critique has a point, but it misses important dimensions of what is happening on the net. Contrary to Curtis' account of blogging, blogs can generate new discourse networks that have no correlate in the social field outside cyberspace.\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.848029502386834},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8474134241400256},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8471845756313903},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.8458347812740009},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.8443588731249496},{"content":"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8430852526650657},{"content":"Some incredibly interesting excerpts I want to quote directly (emphases all mine):","parent":"posts/untitled-9-20-2021.txt","score":0.8415507692780719},{"content":"2. My critique here is nothing original - it echoes a lot of what Andy [[Matuschak]] and [[Linus Lee]] have touched upon in their essays. Here's a brief excerpt from [Linus' blog post](https://thesephist.com/posts/browser/) that expresses the point more eloquently:","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8412123990631861},{"content":"- Dostoevsky, Notes From Underground","parent":"posts/Second Brains.txt","score":0.8406410531991308},{"content":"It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]]","parent":"posts/untitled-9-21-2021.txt","score":0.8404882352939314}],"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]":[{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8991732491240902},{"content":"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.","parent":"posts/untitled-9-20-2021.txt","score":0.8939080458653567},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8871465352977017},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8772512605936802},{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.8650607165110826},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8650091134781682},{"content":"Finished Capitalist Realism","parent":"posts/untitled-9-20-2021.txt","score":0.8626127925835241},{"content":"But this is something forbidden to mortal men. We face a kind of creative asymmetry - to bring beauty into the world, it is neccessary to confront ugliness. Creating beautiful, original music requires endless, stupid, and frustrating scale practice, finger exercises, and theory study; behind the sublime beauty of a master's painting lies hours of practice filling sketchbooks with mind numbing still lifes and ugly anatomical mistakes. On the one hand, it seems paradoxical that beauty, freedom and originality require ugliness, servitude, and repetition. On the other hand, it is almost coldly rational - perhaps there is a kind of aesthetic entropy at play, like there's a set amount of beauty in the universe, and to \"produce\" any more of it, you first have to take on ugliness as a burden.[[music]] [[aesthetics]] [[art]]","parent":"posts/Prometheus.txt","score":0.8599815884611979},{"content":"Fischer on making weird shit","parent":"posts/untitled-9-20-2021.txt","score":0.8585919689535623},{"content":"Bad minimalism, on the other hand, shows a lack of direction and conviction. Take Google's icon redesigns. Not only are they significantly worse from a visibility standpoint, but they also express a confused and weak sense of direction, which is ostensibly to create a coherent \"brand image\" by making all the icons look really similar. But what is this \"brand image?\" Nothing, it's as empty as Google's mission, which slipped over the course of two decades from \"Don't be evil\" to its current sad, formless state. Generally speaking, cookie-cutter minimalism is ugly. Sometimes it is the pragmatic choice, for example, if you're building a minimum viable product and don't want to worry about design yet, but the fact that it is the least ugly choice doesn't change the fact that it's still ugly.","parent":"posts/Minimalism.txt","score":0.8578717919239016},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8567926790070534},{"content":"2. My critique here is nothing original - it echoes a lot of what Andy [[Matuschak]] and [[Linus Lee]] have touched upon in their essays. Here's a brief excerpt from [Linus' blog post](https://thesephist.com/posts/browser/) that expresses the point more eloquently:","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8566786329961749},{"content":"Of course, it is impossible to create a new kind of person out of thin air. Without traction with existing customers, it is impossible to gain the momentum needed to have enough cultural impact to create a new type of person. The synthesis between these two extremes is this: an innovative product is not one that merely solves problems for an existing kind of person, or one that creates an entirely new kind of person. Rather, it recognizes some kind of latent potential in existing people, and then transforms them into a new kind of person. For example, influencers did not exist when Instagram was created. However, there were people who wanted to share their photos with the world, and people that wanted to be recognized for their photos/beauty - it was this latent potential that Instagram unleashed.","parent":"posts/Creating new kinds of people.txt","score":0.850525585058688},{"content":"I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.","parent":"posts/Fragments.txt","score":0.8498015025768347},{"content":"There is a time and place for minimalism, and all in all I don't think it is an intrinsically bad thing. I should also point out that I like all three writers mentioned above. However, I do think it's overused as an aesthetic philosophy, and that this overuse is a symptom of a deeper cultural illness: a general lack of conviction and courage.","parent":"posts/Minimalism.txt","score":0.8495747468933273},{"content":"The auteur believes something similar about ideas. A description of an idea is never the idea itself, it is a second rate copy of an original - another thing added to the world's contents. Preferring not to clutter the world with such refuse, he becomes reclusive, reluctant to even speak of what he wishes to create. The result is either pure creativity untarnished by the translation of ideas into words, or something tantamount to the work of a madman - full of meaning to its creator but incomprehensible and useless to everyone else.","parent":"posts/On auteurs and language.txt","score":0.8490766906468468},{"content":"\"[Adam] Curtis attacks the internet because in his view it facilitates communities of solipsists, interpassive networks of like-minds who confirm, rather than challenge, each others' assumptions and prejudices.... Curtis' critique has a point, but it misses important dimensions of what is happening on the net. Contrary to Curtis' account of blogging, blogs can generate new discourse networks that have no correlate in the social field outside cyberspace.\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8483417884159065},{"content":"This raises the question: what is good minimalism, and what is bad minimalism? My tentative answer is this: Good minimalism is the use of absence to convey richness and detail; bad minimalism is the self-effacing tendency of aesthetic cowardice.","parent":"posts/Minimalism.txt","score":0.8453607205719714},{"content":"Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all.","parent":"posts/On auteurs and language.txt","score":0.8430855139989948}],"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]] ":[{"content":"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8991732491240902},{"content":"Fischer on possibility","parent":"posts/untitled-9-20-2021.txt","score":0.8877768026902312},{"content":"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.","parent":"posts/untitled-9-20-2021.txt","score":0.8871973009102507},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8816869680022076},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8672534389000164},{"content":"Fischer on making weird shit","parent":"posts/untitled-9-20-2021.txt","score":0.8466530454677761},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8430852526650657},{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.8419112541551838},{"content":"The auteur believes otherwise. Language, he says, cannot communicate an idea without botching it. And if communicating an idea were not bad enough, mediating between multiple ideas using as flawed a tool as language is immeasurably worse.","parent":"posts/On auteurs and language.txt","score":0.8390141724834933},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8378441167999899},{"content":"Of course, it is impossible to create a new kind of person out of thin air. Without traction with existing customers, it is impossible to gain the momentum needed to have enough cultural impact to create a new type of person. The synthesis between these two extremes is this: an innovative product is not one that merely solves problems for an existing kind of person, or one that creates an entirely new kind of person. Rather, it recognizes some kind of latent potential in existing people, and then transforms them into a new kind of person. For example, influencers did not exist when Instagram was created. However, there were people who wanted to share their photos with the world, and people that wanted to be recognized for their photos/beauty - it was this latent potential that Instagram unleashed.","parent":"posts/Creating new kinds of people.txt","score":0.8372245940540868},{"content":"Thinking as social","parent":"posts/untitled-9-24-2021.txt","score":0.8311519494419868},{"content":"Human beings can observe the conclusions that social science reach and modify their behavior, which can potentially render those conclusions invalid. This is a complete impossibility in the natural sciences - an atom cannot learn about atomic theories and change its behavior to invalidate those theories.","parent":"posts/untitled-10-11-2021.txt","score":0.8287118605796274},{"content":"The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.","parent":"posts/Creating new kinds of people.txt","score":0.8267158098339246},{"content":"Naturally, [[Habermas]]'s thoughts on the public sphere - which referred to salons, coffee shops and other public spaces in his day, and probably the internet today - are relevant to the social features of [[exegesis]].","parent":"posts/untitled-9-21-2021.txt","score":0.8256479041700409},{"content":"I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.","parent":"posts/Fragments.txt","score":0.8234516729793527},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8227153397302754},{"content":"Education and authoritarianism[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.822600951005738},{"content":"The assumption behind every collaborative creative endeavor is that language can capture ideas, and that language can mediate between ideas. Those who believe creative collaboration is possible believe that multiple creatives can enter the same room, use language to successfully communicate their ideas, use language to successfully mediate between their ideas, and use language to combine their ideas into a worthwhile final product.","parent":"posts/On auteurs and language.txt","score":0.8224411380354233}],"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.  ":[{"content":"There's almost a Jobsian element to what he's saying here. In fact, you could argue that Steve Jobs, with all his hippie/countercultural heritage, belonged to that \"postwar social consensus.\" Could our capitalist reality today give rise to another innovator like Jobs? Of course, I'm sure Mark Fischer was no fan of Apple or Jobs, but it's still an interesting question to raise.","parent":"posts/untitled-9-20-2021.txt","score":1.0000000000000002},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8939080458653567},{"content":"Speaking of which, Fischer has something to say on the social prerequisites for innovation. \"[I]t is now clear that a certain amount of stability is necessary for cultural vibrancy, the question to be asked is: how can this stability be provided, and by what agencies?\" His tentative answer to this is \"a public space that is not reducible to an aggregation of individuals and their interests\" (see the quote above where he says some innovations are impossible because the public has been displaced by the consumer) [[mark-fischer]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8871973009102507},{"content":"It could be interesting to compare [[Habermas]]' program for reestablishing a public sphere, and [[mark-fischer]]'s program for reestablishing a public subject (which I think in his view would necessitate a viable alternative to capitalism).","parent":"posts/untitled-9-21-2021.txt","score":0.8584077530134246},{"content":"I don't just mean that technologies create new sorts of jobs, which is a true statement but in my opinion understates the significance of what is being done. Each of the examples given above did not merely create a new kind of occupation - they created a nexus of richly interlinked cultural artifacts, characters, and identities. The introduction of the social media influencer did far more than just introduce a new kind of occupation. It also created a new social hierarchy, threatened old social hierarchies (the beef between old Hollywood elites and new internet stars, etc. etc.), [influenced the goals of an entire generation](https://www.fastcompany.com/90432765/why-do-kids-want-to-be-influencers), and resulted in a reordering of values where old values like modesty and moderation gave way to exuberance and excess. The sum of these new hierarchies, values, and occupations is the creation of a new type of person.","parent":"posts/Creating new kinds of people.txt","score":0.8554358430236206},{"content":"Finished [[mark-fischer]]'s [[Capitalist-Realism]] today. Incredible read. Since reading (or listening to the audiobook) of [[Fukuyama]]'s End of History, I always found the concept of an \"end of history\" interesting. Fukuyama himself is (roughly) opposite Fischer on the political spectrum, so it was interesting to read an analysis on the same subject (the end of history) from a different perspective.","parent":"posts/untitled-9-20-2021.txt","score":0.8457247871184304},{"content":"There is a particular kind of second order effect that is of special interest: technologies can create entire new types of people. Instagram created the influencer, Youtube produced the Youtuber, Soundcloud spawned its own eponymous kind of rapper. The more extreme political factions in America trace their lineages to 4Chan and Tumblr. To give an older example, the factory birthed the proletariat a century ago.","parent":"posts/Creating new kinds of people.txt","score":0.8449859357062585},{"content":"Fischer on possibility","parent":"posts/untitled-9-20-2021.txt","score":0.8411333036019728},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8402281760148208},{"content":"The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.","parent":"posts/Creating new kinds of people.txt","score":0.8352091752856808},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8339595687504578},{"content":"Of course, it is impossible to create a new kind of person out of thin air. Without traction with existing customers, it is impossible to gain the momentum needed to have enough cultural impact to create a new type of person. The synthesis between these two extremes is this: an innovative product is not one that merely solves problems for an existing kind of person, or one that creates an entirely new kind of person. Rather, it recognizes some kind of latent potential in existing people, and then transforms them into a new kind of person. For example, influencers did not exist when Instagram was created. However, there were people who wanted to share their photos with the world, and people that wanted to be recognized for their photos/beauty - it was this latent potential that Instagram unleashed.","parent":"posts/Creating new kinds of people.txt","score":0.8314622343826301},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.827555247481858},{"content":"The counter argument here is that people don't want to use files, and they don't want to manage their own systems. I don't think this is a forgone conclusion. Think about how much effort has been poured into making new technologies like touchscreens and AI legible to ordinary people.","parent":"posts/The AI-first operating system of the future.txt","score":0.8263478336867528},{"content":"Thinking as social","parent":"posts/untitled-9-24-2021.txt","score":0.8257375227274533},{"content":"Maybe Computer Science is a social science","parent":"posts/untitled-10-11-2021.txt","score":0.8241766996995643},{"content":"This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"","parent":"posts/Second Brains.txt","score":0.8233970383774043},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.8225422699417829},{"content":"Then again, the subject of Computer Science's empirical inquiries isn't a natural thing - it's manmade. Everything about a computer is manmade, from the processor to the operating system to the programs that run on it, and as such are subject to human conventions. I'm only half joking when I say this: Isn't computer science actually a social science?","parent":"posts/untitled-10-11-2021.txt","score":0.8225206352216},{"content":"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data.","parent":"posts/Controlling what you see.txt","score":0.8201800827075454}],"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]] ":[{"content":"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]]","parent":"posts/untitled-9-20-2021.txt","score":1.0000000000000002},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.9325768103066472},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.9101985946604682},{"content":"I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.","parent":"posts/Reflections for the New Year.txt","score":0.9009356527865816},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.8932716537390971},{"content":"exegesis as crm [[exegesis]] [[ideas]]","parent":"posts/untitled-9-20-2021.txt","score":0.8926404327377382},{"content":"Exegesis is the Apple Notes to Roam Research's Microsoft Word. It is less powerful, but it is simpler. A notetaking app should not force your mind to conform to it, it should conform to your mind. Personally, I prefer having an open document to write into over a bullet point system, even if the latter allows for more complex queries and notetaking systems. Some people hate both and prefer the simplicity of pen and paper. Do what works for you.","parent":"posts/Second Brains.txt","score":0.8891788456808801},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":0.887371823364764},{"content":"Also encouraging was the fact that I started hearing about similar notetaking apps a couple months into developing exegesis. Apps like Roam Research, and Obsidian were making waves on Twitter, and were taking a similar approach to nonlinear writing that I wanted to take exegesis in. This proved that I wasn't alone in needing this kind of product.","parent":"posts/Second Brains.txt","score":0.8872495000418426},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.8871618952669901},{"content":"If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.","parent":"posts/Second Brains.txt","score":0.877820190121596},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8757341008661965},{"content":"Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.874125216280102},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter.txt","score":0.8710147667155249},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8697837504198996},{"content":"What do I use [[exegesis]] for? I use it like a journal. I write down thoughts about my life, ideas that I have, things that I'd like to do, reflections on my day, etc. etc. None of these things could be called knowledge, none of them could be called rational.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8684621056872713},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8662711440914412},{"content":"Talking to Emma Salinas, I tried convincing her that exegesis was a useful tool for personal reflection. She wasn't convinced, so I asked her what she thought a good way for personal reflection was, and she responded \"talking to people.\"","parent":"posts/untitled-9-24-2021.txt","score":0.8657895585234905},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.865575289066378},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.8641245059454583}],"Building tools":[{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":1.0000000000000002},{"content":"Visual developer tools","parent":"posts/untitled-9-24-2021.txt","score":0.8865635223977756},{"content":"Tools for creative thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8687031443859965},{"content":"Creative tools vs rational tools","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8630720139012521},{"content":"None of it worked. Why? It's not that these tools don't work in general - plenty of people swear by them. The problem was either with the tools, or with me. Technology exists for the utility of the user, not the other way around, so I rejected the latter answer.","parent":"posts/Why I made exegesis.txt","score":0.8527609507965265},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8512993439268325},{"content":"Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8418926475571077},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.839213687414488},{"content":"This is not the case for programming. Making better tools for programming (new languages, new frameworks, new libraries) itself requires programming, and while making programming tools is different in important respects from writing regular programs, it is still programming. Making guitars is not playing guitars, making paints is not painting, but making better programming tools is programming. Programming, then, is an, intrinsically recursive creative medium.","parent":"posts/Prometheus.txt","score":0.8371661382925316},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.8364249918246832},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8339134903738746},{"content":"[[ideas]]: A tool that analyzes a react project and shows your component structure for you in a nice and visual way. Probably already exists, idk","parent":"posts/untitled-9-20-2021.txt","score":0.8317169809354455},{"content":"The two of these combined could be a powerful tool for focus - something to help you decompose a larger goal into smaller tasks, and something to remind you which particular little task you're working on so you don't get distracted. The less powerful it is the better, because at a certain point having enough features in your todo list means figuring out how to input todos become another todo item. [[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8313022783369748},{"content":"The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8294023360719653},{"content":"[[roam]] is a tool for rational thought. More broadly, any tool that subscribes to something like a Zettelkasten or Evergreen notes philosophy is a tool for rational thought. The selling point of a tool for rational thought is to manage knowledge - no wonder, since another commonly used name for these tools is PKM (Personal Knowledge Management).","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8289967458918464},{"content":"I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.826958585708081},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8231457121667508},{"content":"Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8208621997009703},{"content":"[[ideas]]: As I've matured as a [[React]] developer, I've found certain standard methods of handling things like state management, routing, styling, and data fetching. Because I've standardized on this approach, I've been writing higher order functions that abstract away a lot of the boilerplate. This has me thinking - it would almost certainly be possible to build some kind of visual tool to help scaffold a react app. Something in between no-code and a developer tool - like the [Nx.dev extension for VSCode](https://marketplace.visualstudio.com/items?itemName=nrwl.angular-console). [[code]]","parent":"posts/untitled-9-20-2021.txt","score":0.8195961101204363},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8193303986375585}],"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]] ":[{"content":"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]]","parent":"posts/untitled-9-20-2021.txt","score":0.9999999999999999},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness.txt","score":0.892841292729111},{"content":"It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]]","parent":"posts/untitled-9-21-2021.txt","score":0.8813368311623918},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.8661197153781617},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8636375449479305},{"content":"I feel open to the future. I feel that there is meaning in this world, even if I don't know what it is currently, and it may be impossible to pin it down with words. I feel that the bad things that happen in this world do not lead to the conclusion that the world is a bad place. I feel ok not being able to explain everything. I feel I have something valuable to offer to others, I feel others have something valuable to offer to me. Change seems possible, albeit slow, and slowness feels OK.","parent":"posts/untitled-9-30-2021.txt","score":0.8537475411955326},{"content":"\"From the moment I understood the weakness of my flesh, it disgusted me. I craved for strength and certainty of steel. I aspired to the purity of the blessed machine. Your kind cling to your flesh, as though it will not decay and fail you. One day the crude biomass you call a temple will wither and you will beg my kind to save you.\n\nBut I am already saved. For the Machine is immortal.\"\n\n- Magos Dominus Reditus, Warhammer 40k","parent":"posts/Second Brains.txt","score":0.8517287276468474},{"content":"\"Marino saw the rose, as Adam had seen it in Paradise, and he realized that it lay within its own eternity, not within his words, and that we might speak about the rose, allude to it, but never truly express it, and that the tall haughty volumes that made a golden dimness in the corner of his room were not (as his vanity had dreamed them) a mirror of the world, but just another thing added to the world's contents.\"","parent":"posts/On auteurs and language.txt","score":0.8514758640733167},{"content":"Nietzsche argues that there exists a philosophical system for each person that would justify their existence - like the \"books of apologia and prophecies that would vindicate for all time the actions of every person in the universe\" in The Library of Babel.","parent":"posts/Why I made exegesis.txt","score":0.8507664836169914},{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.8499423541203674},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8445359306608804},{"content":"There is yet another world to be discovered - and more than one. Embark, philosophers!\"","parent":"posts/Why I made exegesis.txt","score":0.84070665009559},{"content":"I could not help but find this extraordinarily similar to what the protagonist and narrator of [[Zen and the Art of Motorcycle Repair]] goes through - he starts as a scientist, looks for justifications for science in philosophy, becomes frustrated with philosophy and eventually embraces esotericism before going insane. The instrumental rationality that the Critical Theorists disliked seems roughly equivalent to the \"classical rationality\" Phaedrus talks about in [[Zen and the Art of Motorcycle Repair]] as well.","parent":"posts/untitled-9-21-2021.txt","score":0.8404751400240903},{"content":"A couple of ideas I think are very related but couldn't figure out how to weave in: [[Nietzsche]]'s distinction between the Apollonian and the Dionysian, the distinction made in [[Zen and the Art of Motorcycle Repair]] between Romantic Quality and Classical Quality.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8402456195960594},{"content":"Some incredibly interesting excerpts I want to quote directly (emphases all mine):","parent":"posts/untitled-9-20-2021.txt","score":0.8401562465105822},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.838827376920205},{"content":"This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"","parent":"posts/Second Brains.txt","score":0.8379036196971295},{"content":"There is a short story by [[Borges]], about an author who realizes on his deathbed that the words used to describe a rose are not a mere reflection of an object, but an object in their own right.","parent":"posts/On auteurs and language.txt","score":0.836636704771685},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.831114084111838},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.829784153044416}],"[[ideas]]: As I've matured as a [[React]] developer, I've found certain standard methods of handling things like state management, routing, styling, and data fetching. Because I've standardized on this approach, I've been writing higher order functions that abstract away a lot of the boilerplate. This has me thinking - it would almost certainly be possible to build some kind of visual tool to help scaffold a react app. Something in between no-code and a developer tool - like the [Nx.dev extension for VSCode](https://marketplace.visualstudio.com/items?itemName=nrwl.angular-console). [[code]] ":[{"content":"[[ideas]]: As I've matured as a [[React]] developer, I've found certain standard methods of handling things like state management, routing, styling, and data fetching. Because I've standardized on this approach, I've been writing higher order functions that abstract away a lot of the boilerplate. This has me thinking - it would almost certainly be possible to build some kind of visual tool to help scaffold a react app. Something in between no-code and a developer tool - like the [Nx.dev extension for VSCode](https://marketplace.visualstudio.com/items?itemName=nrwl.angular-console). [[code]]","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"[[ideas]]: A tool that analyzes a react project and shows your component structure for you in a nice and visual way. Probably already exists, idk","parent":"posts/untitled-9-20-2021.txt","score":0.9122166834025666},{"content":"Visual developer tools","parent":"posts/untitled-9-24-2021.txt","score":0.9037255078496476},{"content":"The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.9012512074341783},{"content":"I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.873872203813178},{"content":"Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8668880110375661},{"content":"For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8487721244800865},{"content":"In any case I wanted to try something new because that's what Recurse is all about, so I tried making a project with just JS and JSDoc for some semblance of type safety.","parent":"posts/The making of Nomad Hypertext.txt","score":0.846165455149972},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8425113320047762},{"content":"I opted to use Javascript instead of Typescript out of mix of curiosity and laziness. Like most people, I was introduced to Javascript before I was introduced to Typescript. Like most people, I suffered through many null errors and was relieved when I discovered that the Typescript compiler could save me from many of them. Like most people, though I am grateful for Typescript, I find it occasionally cumbersome.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8338740430133538},{"content":"Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.833170371643223},{"content":"The results were... mixed. I did get to move faster at the start, but started running into more and more type-related bugs as development went on. If I were to do this project again, I'd stick to Typescript.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8314832972375025},{"content":"You might object: Just because the vector DB and text embedding model are tied to JS doesn't mean your whole application does! You'd be right. I could have rolled the vector DB and text embedding model into a separate executable, compiling a node wrapper around those libraries into their own executables, then calling those executables from my Tauri app with IPC.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8220396262845099},{"content":"Why not Tauri? With Tauri you have to write your backend routes in Rust. Surprisingly, I could not find any in-memory vector databases in Rust. I also have never written Rust in my life, though I would have been happy to pick it up to avoid using Electron. More importantly, I don't think there was a library that would have let me run Hugging Face's text embedding model in Rust. For these reasons, I had to use JS for my backend, which meant I had to use Electron.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8207096479709594},{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8195961101204363},{"content":"Electron really, really, really sucks. For starters, you have to use CommonJS. That itself would be bad enough, but there are a huge pile of other inconveniences that Electron dumps on you: Using window.prompt() doesn't work (because it blocks the main thread apparently) and it generates HUGE executables without making the slightest effort to tree-shake anything (it was literally bundling in sample text files I was using in the repo). Creating my own window.prompt() alternative was an interesting exercise, but I wish I wasn't forced into doing it.","parent":"posts/The making of Nomad Hypertext.txt","score":0.818608615400155},{"content":"I read Rich Harris' twitter thread on how Javascript with JSDoc is actually pretty good, and decided to give it a shot. To be clear, I'm not blaming Rich Harris for my choice - he qualified his point, saying JS with JSDoc is preferable to Typescript for library development, because not having an intermediate build step makes it easier to reproduce bugs in a REPL. He still recommends using Typescript for projects (I think), so I was acting against his advice here.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8166023738755606},{"content":"I want to learn more code. Working on [[exegesis]] over the course of a year, I saw my coding ability improve substantially. Towards the last 2 months, while rewriting a part of the codebase, I found myself dumbfounded by some of the decisions and patterns I had used a year earlier. The code I wrote towards the end was noticeably cleaner and more maintainable, mostly because I had familiarized myself with [[React]] hooks. Learning NextJS and GraphQL was also very rewarding, and both technologies were used extensively in the final version of exegesis. Looking forwards, I am thinking about learning Go, Clojure and maybe Rust. Go is the most practical one of all these for my purposes, and could open up a lot of job offers. Clojure is the most interesting from a theoretical standpoint, since I've never used a lisp or functional language. Rust is interesting because I hate systems/low-level programming, but I suspect that might only be because I hate C, and maybe Rust's more modern features will sell me on it.","parent":"posts/Reflections for the New Year.txt","score":0.8145315454607064},{"content":"Learning Javascript, I never took notes, because all the reference docs were online anyways. Besides, the difficult part of programming isn't remembering APIs, it's the process of taking an idea and building it out, and there's no way to get better at that except by building. There's a reason most university CS courses don't test memorization heavily and instead focus on having students build projects. I suspect this is true for a lot of subjects.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8114467212091409},{"content":"This is not the case for programming. Making better tools for programming (new languages, new frameworks, new libraries) itself requires programming, and while making programming tools is different in important respects from writing regular programs, it is still programming. Making guitars is not playing guitars, making paints is not painting, but making better programming tools is programming. Programming, then, is an, intrinsically recursive creative medium.","parent":"posts/Prometheus.txt","score":0.8095448531119609}]," [[ideas]]: A tool that analyzes a react project and shows your component structure for you in a nice and visual way. Probably already exists, idk":[{"content":"[[ideas]]: A tool that analyzes a react project and shows your component structure for you in a nice and visual way. Probably already exists, idk","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"[[ideas]]: As I've matured as a [[React]] developer, I've found certain standard methods of handling things like state management, routing, styling, and data fetching. Because I've standardized on this approach, I've been writing higher order functions that abstract away a lot of the boilerplate. This has me thinking - it would almost certainly be possible to build some kind of visual tool to help scaffold a react app. Something in between no-code and a developer tool - like the [Nx.dev extension for VSCode](https://marketplace.visualstudio.com/items?itemName=nrwl.angular-console). [[code]]","parent":"posts/untitled-9-20-2021.txt","score":0.9122166834025666},{"content":"The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8978186156687243},{"content":"Visual developer tools","parent":"posts/untitled-9-24-2021.txt","score":0.8766852372015386},{"content":"Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8540709779811363},{"content":"I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8479787798435092},{"content":"Fortunately, it looks like there's progress being made here, with projects like [https://github.com/blocks/blocks.](https://github.com/blocks/blocks.) I want to build my own solutions, maybe borrowing from current projects.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8479267155796695},{"content":"For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8434497795661193},{"content":"In any case I wanted to try something new because that's what Recurse is all about, so I tried making a project with just JS and JSDoc for some semblance of type safety.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8434137024162389},{"content":"Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8375421245640055},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8348073091310788},{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8317169809354455},{"content":"The results were... mixed. I did get to move faster at the start, but started running into more and more type-related bugs as development went on. If I were to do this project again, I'd stick to Typescript.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8310618475982},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt.txt","score":0.8297771282165065},{"content":"However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. \n\nFactoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8280903939625919},{"content":"You're viewing this on a statically generated blog using Yurt!","parent":"posts/What is Yurt.txt","score":0.8278597899846841},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8268359554945566},{"content":"Why not Tauri? With Tauri you have to write your backend routes in Rust. Surprisingly, I could not find any in-memory vector databases in Rust. I also have never written Rust in my life, though I would have been happy to pick it up to avoid using Electron. More importantly, I don't think there was a library that would have let me run Hugging Face's text embedding model in Rust. For these reasons, I had to use JS for my backend, which meant I had to use Electron.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8264579864151181},{"content":"One, it meets up every week to critique a website chosen by members. The website might be one with exceptional design/animations/content/functionality. As a group, we'll discuss what we like about it, what we don't like, and then ideas for using the website's concepts in our own work. We'll also take guesses at how the website works technically, and take a look under the hood to see if our guesses are correct.","parent":"posts/untitled-9-24-2021.txt","score":0.824899971457001},{"content":"Electron really, really, really sucks. For starters, you have to use CommonJS. That itself would be bad enough, but there are a huge pile of other inconveniences that Electron dumps on you: Using window.prompt() doesn't work (because it blocks the main thread apparently) and it generates HUGE executables without making the slightest effort to tree-shake anything (it was literally bundling in sample text files I was using in the repo). Creating my own window.prompt() alternative was an interesting exercise, but I wish I wasn't forced into doing it.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8246616064317839}],"TikTok has normalized tying music to everything - political messages, dances, jokes, short videos, etc. etc. Aiming to help do something similar with [[synesthesia]], but focused more on explicitly creative output. ":[{"content":"TikTok has normalized tying music to everything - political messages, dances, jokes, short videos, etc. etc. Aiming to help do something similar with [[synesthesia]], but focused more on explicitly creative output.","parent":"posts/untitled-9-20-2021.txt","score":1.0000000000000002},{"content":"TikTok and [[synesthesia]]","parent":"posts/untitled-9-20-2021.txt","score":0.9547067045876123},{"content":"Right now I'm listening to [Something About Us by Daft Punk](https://open.spotify.com/track/1NeLwFETswx8Fzxl2AFl91?si=bc9f206d498e4fdd), which might have something to do with how I'm feeling. What if words aren't enough to express a certain feeling? What if it's only the conjunction of words, images, videos and music, combined not in a determinate order like a moving picture or video, but presented indeterminately, in some form resembling a moodboard? That's the thesis behind [[synesthesia]] (a project I'm working on that will be closely integrated with [[exegesis]]).","parent":"posts/untitled-9-30-2021.txt","score":0.869610185694576},{"content":"Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]]","parent":"posts/untitled-9-21-2021.txt","score":0.8646951506322138},{"content":"Here, there is context (the theming of the video/playlist), and community (the commenters playing along with the theme). Taken together, they create something that can only be described as a vibe. I don't think you could even come close to doing something this cool with a Spotify playlist.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.858744021192552},{"content":"The goal is to recreate the feeling of a musical jam session, but in a website.","parent":"posts/untitled-9-24-2021.txt","score":0.8531225902808665},{"content":"Consider two things I think to be missing from modern music: context and community. While its nothing compared to live music, I think certain Youtube videos capture these elements in a novel and exciting way.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8485147835654205},{"content":"Strangely enough, though Youtube is a general purpose video sharing site and Spotify is a platform dedicated to music, I think Youtube does a better job at capturing the spirit of music.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8377683153653249},{"content":"Whether its noticing that two songs use the same chord progression, stealing a nice lick from your favorite blues guitarist, making a mashup of two of your favorite songs, or translating a song into a different genre, playing music is all about making connections. Unfortunately, the way we listen to music prevents us from doing this.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8334994324732001},{"content":"Listening to music","parent":"posts/untitled-9-21-2021.txt","score":0.8310561646733646},{"content":"The main obstacle is the playlist. Playlists trap music and prevent listeners from creating rich connections between their songs - I will elaborate on this point later.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.828894356658032},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8286858481979914},{"content":"As mentioned earlier, the modern experience of listening to music alone is completely novel - before technology, listening to music was always a social affair, unless you were playing music for yourself.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8268485509797573},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8266623916539599},{"content":"There is a particular kind of second order effect that is of special interest: technologies can create entire new types of people. Instagram created the influencer, Youtube produced the Youtuber, Soundcloud spawned its own eponymous kind of rapper. The more extreme political factions in America trace their lineages to 4Chan and Tumblr. To give an older example, the factory birthed the proletariat a century ago.","parent":"posts/Creating new kinds of people.txt","score":0.8249666983094082},{"content":"The pandemic has made things even worse. Before the pandemic, music could still be a social experience, in the form of live shows and concerts, but now it has become a completely solo activity. Without live music, most people experience music as the blank grey rows in their Spotify playlists.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8242925710074298},{"content":"It is current year. Armed with fleets of server racks and neural nets trained upon eons of GPU compute time, social media conglomerates have razed and pillaged your attention span with a steady drip feed of content algorithmically optimized to deliver maximal doses of dopamine. Half the time you open your phone, you forget what you opened it for in the first place (checking the weather? for an important email?) and somehow end up on one of the many like farms installed on your phone, your thumbs scrolling like runners on a treadmill.","parent":"posts/Manifesto.txt","score":0.8237367182967172},{"content":"You could easily strip the audio from the video, touch it up a bit, and upload it as Spotify track. However, you'd miss out on so many precious details - how thrilled the old violinist is with the bassist's playing, the chatter from the onlookers praising their playing, the moment the camera pans to show the picturesque Italian street they're playing on, how they stop for a bit and the audience starts clapping prematurely, only to be pleasantly surprised when they start playing again with a faster rhythm.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8233217829287423},{"content":"It's these details that we miss about music. A song should never just be a song, but on a streaming platform, that's all it can really be - just another row in a playlist.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8216896275694875},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8200583182613035}],"TikTok and [[synesthesia]] ":[{"content":"TikTok and [[synesthesia]]","parent":"posts/untitled-9-20-2021.txt","score":1},{"content":"TikTok has normalized tying music to everything - political messages, dances, jokes, short videos, etc. etc. Aiming to help do something similar with [[synesthesia]], but focused more on explicitly creative output.","parent":"posts/untitled-9-20-2021.txt","score":0.9547067045876123},{"content":"Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]]","parent":"posts/untitled-9-21-2021.txt","score":0.8828094803055835},{"content":"Right now I'm listening to [Something About Us by Daft Punk](https://open.spotify.com/track/1NeLwFETswx8Fzxl2AFl91?si=bc9f206d498e4fdd), which might have something to do with how I'm feeling. What if words aren't enough to express a certain feeling? What if it's only the conjunction of words, images, videos and music, combined not in a determinate order like a moving picture or video, but presented indeterminately, in some form resembling a moodboard? That's the thesis behind [[synesthesia]] (a project I'm working on that will be closely integrated with [[exegesis]]).","parent":"posts/untitled-9-30-2021.txt","score":0.8633678002682021},{"content":"Working on a refactor for [[exegesis]] and [[synesthesia]], thinking about how to budget time. Working strategy is to take estimate for each feature, and double the time for each to account for stupid roadblocks (wifi not working, interrupted by something, bad documentation, etc. etc.) [[code]] [[devlog]]","parent":"posts/untitled-9-21-2021.txt","score":0.8333867318132241},{"content":"It is current year. Armed with fleets of server racks and neural nets trained upon eons of GPU compute time, social media conglomerates have razed and pillaged your attention span with a steady drip feed of content algorithmically optimized to deliver maximal doses of dopamine. Half the time you open your phone, you forget what you opened it for in the first place (checking the weather? for an important email?) and somehow end up on one of the many like farms installed on your phone, your thumbs scrolling like runners on a treadmill.","parent":"posts/Manifesto.txt","score":0.8290298964244301},{"content":"The goal is to recreate the feeling of a musical jam session, but in a website.","parent":"posts/untitled-9-24-2021.txt","score":0.8241884280019955},{"content":"Some thoughts from this morning. Sitting in the Peet's cafe near the gym at UC Davis, listening to 80s synthwave.","parent":"posts/untitled-9-21-2021.txt","score":0.8239011768374763},{"content":"Listening to music","parent":"posts/untitled-9-21-2021.txt","score":0.8190567358212845},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.8180569942519362},{"content":"Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.817554775184169},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8170382703939701},{"content":"The main obstacle is the playlist. Playlists trap music and prevent listeners from creating rich connections between their songs - I will elaborate on this point later.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8164464468121009},{"content":"As I looked further into these tools, I found that some had taken to calling them [Second Brains](https://fortelabs.co/blog/basboverview/). I thought this was incredibly exciting. The term sounds cyberpunk; building a \"second brain\" sounds way cooler than building a \"note taking app.\" At the same time, something about it unsettled me.","parent":"posts/Second Brains.txt","score":0.8161503138430654},{"content":"Consider two things I think to be missing from modern music: context and community. While its nothing compared to live music, I think certain Youtube videos capture these elements in a novel and exciting way.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.814863153709195},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8143765194893539},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8142463463802619},{"content":"As mentioned earlier, the modern experience of listening to music alone is completely novel - before technology, listening to music was always a social affair, unless you were playing music for yourself.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8136664578684021},{"content":"In a tantalizingly dialectical fashion, this phenomenon contains its own contradiction - on the very apps that have engineered the collapse of your attention span, you scroll past countless posts on social media addiction, hacks to improve your attention span, dopamine fasts, meditation routines, and even posts urging you to delete the apps on which they are hosted. But these hacks are nothing more than empty promises. The truth is that the world has changed, and you with it. There is no going back to the world where information was scarcer than attention.","parent":"posts/Manifesto.txt","score":0.8135085800879754},{"content":"I did not do a braindump yesterday, the words did not flow easily. Best not to force these things. [[journal]]","parent":"posts/untitled-9-24-2021.txt","score":0.8127186876663922}]}