{"Upset at this state of affairs, I found [a chrome extension](https://chrome.google.com/webstore/detail/news-feed-eradicator/fjcldmjmjhkklehbacihaiopjklihlgg?hl=en) that disabled the \"feeds\" on a number of sites (Facebook, Youtube, LinkedIn, even HackerNews). This helped immediately. The unconscious, muscle-memory impulse to press Y and autocomplete into Youtube was still there, but when I opened the page, the algorithmic suggestions were all gone. Staring at the blank space, I would realize that I hadn't opened Youtube because I really wanted to watch anything, I had opened it because it was my impulse to do that while bored. ":[{"content":"Upset at this state of affairs, I found [a chrome extension](https://chrome.google.com/webstore/detail/news-feed-eradicator/fjcldmjmjhkklehbacihaiopjklihlgg?hl=en) that disabled the \"feeds\" on a number of sites (Facebook, Youtube, LinkedIn, even HackerNews). This helped immediately. The unconscious, muscle-memory impulse to press Y and autocomplete into Youtube was still there, but when I opened the page, the algorithmic suggestions were all gone. Staring at the blank space, I would realize that I hadn't opened Youtube because I really wanted to watch anything, I had opened it because it was my impulse to do that while bored.","parent":"posts/Controlling what you see.txt","score":0.9999999999999998},{"content":"I spend an inordinate amount of time on Youtube. Having noticed this one morning, I quietly told myself that I wouldn't check Youtube for the rest of the work session - only to find that I would unconsciously press \"Y+enter\" and let the address bar's autocomplete lead me to Youtube. I would find myself on the site, not remembering how I had gotten there. More importantly, the home page recommendations had learned my preferences incredibly well. As soon as I landed on Youtube, there would be at least one video there ready for me to watch. That morning, I got nothing done. Youtube's algorithm had figured out that I really liked watching short clips of Mad Men and provided me a steady drip-feed of them, which I gorged on instead of getting anything done.","parent":"posts/Controlling what you see.txt","score":0.9095163983538505},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.8536308083198472},{"content":"I'm convinced that algorithmic feeds are poisonous. Algorithmic feeds in apps are like cocaine in old medicines or asbestos in buildings, and someday they'll be seen to be just as barbaric.","parent":"posts/Controlling what you see.txt","score":0.8498480231835739},{"content":"Users should have complete control over what they see. I'm not saying algorithmic feeds don't have their place, but they should be something users opt in to. Andy [[Matuschak]] coined the idea of \"[programmable attention](https://notes.andymatuschak.org/zJrfPCbY7GcpV9asEc8NTVzXTAV4TvRFMuY6)\" as something [[tools for thought]] could enable. I will say that this already exists, only in the opposite, sinister sense - right now it's the platform programming your attention, not you.","parent":"posts/Controlling what you see.txt","score":0.8481614896309814},{"content":"To what degree can you control what you see on your phone? On any major social media site? The overwhelming trend of the last decade has been to replace user-controlled feeds with algorithmically curated ones. When you go to a newspaper stand, you pick which paper you'd like, which section you'd like to browse, and which article you'd like to read. When you open Facebook, what you see is decided for you by an algorithm mathematically optimized to maximize the amount of time you spend in the app. In the first scenario, the experience is like browsing a menu and ordering a meal. Choices are offered, a deliberation is made. In the second scenario, the content is slop, and the user is a pig eating it from a trough.","parent":"posts/Giant Robots.txt","score":0.8405587775766789},{"content":"In a tantalizingly dialectical fashion, this phenomenon contains its own contradiction - on the very apps that have engineered the collapse of your attention span, you scroll past countless posts on social media addiction, hacks to improve your attention span, dopamine fasts, meditation routines, and even posts urging you to delete the apps on which they are hosted. But these hacks are nothing more than empty promises. The truth is that the world has changed, and you with it. There is no going back to the world where information was scarcer than attention.","parent":"posts/Manifesto.txt","score":0.8344743746358096},{"content":"It is current year. Armed with fleets of server racks and neural nets trained upon eons of GPU compute time, social media conglomerates have razed and pillaged your attention span with a steady drip feed of content algorithmically optimized to deliver maximal doses of dopamine. Half the time you open your phone, you forget what you opened it for in the first place (checking the weather? for an important email?) and somehow end up on one of the many like farms installed on your phone, your thumbs scrolling like runners on a treadmill.","parent":"posts/Manifesto.txt","score":0.8288428323103398},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.8286416299798806},{"content":"My theory is that the current wave rational tools for thought (PKMs, note-taking apps, [[roam]], etc.) will be disrupted by AI-powered tools and search engines. Note taking has always felt futile to me, because the information age has made remembering/memorizing information useless - why memorize when you can look it up? 1","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8279774854796926},{"content":"This was reassuring, because it meant I had made something genuinely useful. In the past, I have made things I simply had no desire to use - one example is [JAFT](https://nichwch.medium.com/what-is-jaft-f543a4fad9d7), a time tracking app I made after making YANA (the predecessor to exegesis). I stopped using it after a bit, and didn't bother renewing the domain. I don't miss JAFT at all. The fact that I did miss exegesis on the days where it wasn't operational was a good sign.","parent":"posts/Second Brains.txt","score":0.8278356455622564},{"content":"The other thing I miss is links. You can still paste urls, however. It's ugly but it works.","parent":"posts/Plaintext is your best friend.txt","score":0.8248402140046045},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8224632102990492},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots.txt","score":0.8212965308844401},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8185090954773306},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8181026316193833},{"content":"None of it worked, because the word disorganized is really just an epithet for nonlinear.","parent":"posts/Why I made exegesis.txt","score":0.8151220158593327},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8143989390473181},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8122261194116707},{"content":"None of it worked. Why? It's not that these tools don't work in general - plenty of people swear by them. The problem was either with the tools, or with me. Technology exists for the utility of the user, not the other way around, so I rejected the latter answer.","parent":"posts/Why I made exegesis.txt","score":0.8100806801041908}],"I'm convinced that algorithmic feeds are poisonous. Algorithmic feeds in apps are like cocaine in old medicines or asbestos in buildings, and someday they'll be seen to be just as barbaric.":[{"content":"I'm convinced that algorithmic feeds are poisonous. Algorithmic feeds in apps are like cocaine in old medicines or asbestos in buildings, and someday they'll be seen to be just as barbaric.","parent":"posts/Controlling what you see.txt","score":1.0000000000000002},{"content":"To what degree can you control what you see on your phone? On any major social media site? The overwhelming trend of the last decade has been to replace user-controlled feeds with algorithmically curated ones. When you go to a newspaper stand, you pick which paper you'd like, which section you'd like to browse, and which article you'd like to read. When you open Facebook, what you see is decided for you by an algorithm mathematically optimized to maximize the amount of time you spend in the app. In the first scenario, the experience is like browsing a menu and ordering a meal. Choices are offered, a deliberation is made. In the second scenario, the content is slop, and the user is a pig eating it from a trough.","parent":"posts/Giant Robots.txt","score":0.8762313468194044},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.8747650617320472},{"content":"Users should have complete control over what they see. I'm not saying algorithmic feeds don't have their place, but they should be something users opt in to. Andy [[Matuschak]] coined the idea of \"[programmable attention](https://notes.andymatuschak.org/zJrfPCbY7GcpV9asEc8NTVzXTAV4TvRFMuY6)\" as something [[tools for thought]] could enable. I will say that this already exists, only in the opposite, sinister sense - right now it's the platform programming your attention, not you.","parent":"posts/Controlling what you see.txt","score":0.8691847619896724},{"content":"It is current year. Armed with fleets of server racks and neural nets trained upon eons of GPU compute time, social media conglomerates have razed and pillaged your attention span with a steady drip feed of content algorithmically optimized to deliver maximal doses of dopamine. Half the time you open your phone, you forget what you opened it for in the first place (checking the weather? for an important email?) and somehow end up on one of the many like farms installed on your phone, your thumbs scrolling like runners on a treadmill.","parent":"posts/Manifesto.txt","score":0.864407724655473},{"content":"Upset at this state of affairs, I found [a chrome extension](https://chrome.google.com/webstore/detail/news-feed-eradicator/fjcldmjmjhkklehbacihaiopjklihlgg?hl=en) that disabled the \"feeds\" on a number of sites (Facebook, Youtube, LinkedIn, even HackerNews). This helped immediately. The unconscious, muscle-memory impulse to press Y and autocomplete into Youtube was still there, but when I opened the page, the algorithmic suggestions were all gone. Staring at the blank space, I would realize that I hadn't opened Youtube because I really wanted to watch anything, I had opened it because it was my impulse to do that while bored.","parent":"posts/Controlling what you see.txt","score":0.8498480231835739},{"content":"My theory is that the current wave rational tools for thought (PKMs, note-taking apps, [[roam]], etc.) will be disrupted by AI-powered tools and search engines. Note taking has always felt futile to me, because the information age has made remembering/memorizing information useless - why memorize when you can look it up? 1","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8495881681703903},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8490418205630358},{"content":"Who cares? Make all the metaphysical arguments you'd like, a sufficiently powerful recommendation algorithm will still be able to sway decisions enough for Facebook to make 86 billion dollars a year. Free will may or may not be real, but it is an empirical fact that the profitable choice is to act as if it isn't.","parent":"posts/Giant Robots.txt","score":0.8482596012315876},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.8467214275947668},{"content":"In a tantalizingly dialectical fashion, this phenomenon contains its own contradiction - on the very apps that have engineered the collapse of your attention span, you scroll past countless posts on social media addiction, hacks to improve your attention span, dopamine fasts, meditation routines, and even posts urging you to delete the apps on which they are hosted. But these hacks are nothing more than empty promises. The truth is that the world has changed, and you with it. There is no going back to the world where information was scarcer than attention.","parent":"posts/Manifesto.txt","score":0.8450247912423144},{"content":"This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"","parent":"posts/Second Brains.txt","score":0.841547334730353},{"content":"I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.837679053174466},{"content":"If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.","parent":"posts/Second Brains.txt","score":0.8369444623053299},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8368334225962498},{"content":"It is this property that allows programmers to cheat the Gods, and achieve divine levels of creative output thought forbidden to mortals. A programmer can create abstractions than enable them to create in days what previously took months. I myself rewrote a good part of exegesis 2 months before I released it, and the new abstractions I picked enabled me to redo in those 2 months what took me almost a year at first. Moreover, programmers can share their abstractions, and borrow the inventions of others as well.","parent":"posts/Prometheus.txt","score":0.836667127754801},{"content":"Nonlinearity's bad conscience","parent":"posts/Why I made exegesis.txt","score":0.8365401636565934},{"content":"As I looked further into these tools, I found that some had taken to calling them [Second Brains](https://fortelabs.co/blog/basboverview/). I thought this was incredibly exciting. The term sounds cyberpunk; building a \"second brain\" sounds way cooler than building a \"note taking app.\" At the same time, something about it unsettled me.","parent":"posts/Second Brains.txt","score":0.8355251908600183},{"content":"Also encouraging was the fact that I started hearing about similar notetaking apps a couple months into developing exegesis. Apps like Roam Research, and Obsidian were making waves on Twitter, and were taking a similar approach to nonlinear writing that I wanted to take exegesis in. This proved that I wasn't alone in needing this kind of product.","parent":"posts/Second Brains.txt","score":0.8355052408230336},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots.txt","score":0.834702857647294}],"I spend an inordinate amount of time on Youtube. Having noticed this one morning, I quietly told myself that I wouldn't check Youtube for the rest of the work session - only to find that I would unconsciously press \"Y+enter\" and let the address bar's autocomplete lead me to Youtube. I would find myself on the site, not remembering how I had gotten there. More importantly, the home page recommendations had learned my preferences incredibly well. As soon as I landed on Youtube, there would be at least one video there ready for me to watch. That morning, I got nothing done. Youtube's algorithm had figured out that I really liked watching short clips of Mad Men and provided me a steady drip-feed of them, which I gorged on instead of getting anything done. ":[{"content":"I spend an inordinate amount of time on Youtube. Having noticed this one morning, I quietly told myself that I wouldn't check Youtube for the rest of the work session - only to find that I would unconsciously press \"Y+enter\" and let the address bar's autocomplete lead me to Youtube. I would find myself on the site, not remembering how I had gotten there. More importantly, the home page recommendations had learned my preferences incredibly well. As soon as I landed on Youtube, there would be at least one video there ready for me to watch. That morning, I got nothing done. Youtube's algorithm had figured out that I really liked watching short clips of Mad Men and provided me a steady drip-feed of them, which I gorged on instead of getting anything done.","parent":"posts/Controlling what you see.txt","score":1},{"content":"Upset at this state of affairs, I found [a chrome extension](https://chrome.google.com/webstore/detail/news-feed-eradicator/fjcldmjmjhkklehbacihaiopjklihlgg?hl=en) that disabled the \"feeds\" on a number of sites (Facebook, Youtube, LinkedIn, even HackerNews). This helped immediately. The unconscious, muscle-memory impulse to press Y and autocomplete into Youtube was still there, but when I opened the page, the algorithmic suggestions were all gone. Staring at the blank space, I would realize that I hadn't opened Youtube because I really wanted to watch anything, I had opened it because it was my impulse to do that while bored.","parent":"posts/Controlling what you see.txt","score":0.9095163983538505},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.8516730401579748},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots.txt","score":0.8455116516676725},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8427131151391117},{"content":"This was reassuring, because it meant I had made something genuinely useful. In the past, I have made things I simply had no desire to use - one example is [JAFT](https://nichwch.medium.com/what-is-jaft-f543a4fad9d7), a time tracking app I made after making YANA (the predecessor to exegesis). I stopped using it after a bit, and didn't bother renewing the domain. I don't miss JAFT at all. The fact that I did miss exegesis on the days where it wasn't operational was a good sign.","parent":"posts/Second Brains.txt","score":0.8409333953270122},{"content":"Consider two things I think to be missing from modern music: context and community. While its nothing compared to live music, I think certain Youtube videos capture these elements in a novel and exciting way.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.837514536991475},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8364105166820421},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.8356318397583188},{"content":"I avoided this IPC-executable approach because I thought it'd be really complicated. To some extent, this was the correct decision - I'm glad I got a MVP of my project out during my time at Recurse.","parent":"posts/The making of Nomad Hypertext.txt","score":0.833151708144729},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8322190904692168},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8292695042309611},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8288718366387441},{"content":"In a tantalizingly dialectical fashion, this phenomenon contains its own contradiction - on the very apps that have engineered the collapse of your attention span, you scroll past countless posts on social media addiction, hacks to improve your attention span, dopamine fasts, meditation routines, and even posts urging you to delete the apps on which they are hosted. But these hacks are nothing more than empty promises. The truth is that the world has changed, and you with it. There is no going back to the world where information was scarcer than attention.","parent":"posts/Manifesto.txt","score":0.8287826566488148},{"content":"This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year.","parent":"posts/Reflections for the New Year.txt","score":0.8282346141840157},{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8279225707999253},{"content":"Users should have complete control over what they see. I'm not saying algorithmic feeds don't have their place, but they should be something users opt in to. Andy [[Matuschak]] coined the idea of \"[programmable attention](https://notes.andymatuschak.org/zJrfPCbY7GcpV9asEc8NTVzXTAV4TvRFMuY6)\" as something [[tools for thought]] could enable. I will say that this already exists, only in the opposite, sinister sense - right now it's the platform programming your attention, not you.","parent":"posts/Controlling what you see.txt","score":0.8278955778560243},{"content":"To what degree can you control what you see on your phone? On any major social media site? The overwhelming trend of the last decade has been to replace user-controlled feeds with algorithmically curated ones. When you go to a newspaper stand, you pick which paper you'd like, which section you'd like to browse, and which article you'd like to read. When you open Facebook, what you see is decided for you by an algorithm mathematically optimized to maximize the amount of time you spend in the app. In the first scenario, the experience is like browsing a menu and ordering a meal. Choices are offered, a deliberation is made. In the second scenario, the content is slop, and the user is a pig eating it from a trough.","parent":"posts/Giant Robots.txt","score":0.8275026695840016},{"content":"I'm convinced that algorithmic feeds are poisonous. Algorithmic feeds in apps are like cocaine in old medicines or asbestos in buildings, and someday they'll be seen to be just as barbaric.","parent":"posts/Controlling what you see.txt","score":0.8264900888528072},{"content":"That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]]","parent":"posts/Reflections on exegesis.txt","score":0.8260676888437555}],"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data. ":[{"content":"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data.","parent":"posts/Controlling what you see.txt","score":1.0000000000000002},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.9110993186274693},{"content":"My theory is that the current wave rational tools for thought (PKMs, note-taking apps, [[roam]], etc.) will be disrupted by AI-powered tools and search engines. Note taking has always felt futile to me, because the information age has made remembering/memorizing information useless - why memorize when you can look it up? 1","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8955813089712595},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8884829337767497},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.887717668646721},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8812958105155758},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.8812706350502293},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.8803881416452084},{"content":"[[roam]] is a tool for rational thought. More broadly, any tool that subscribes to something like a Zettelkasten or Evergreen notes philosophy is a tool for rational thought. The selling point of a tool for rational thought is to manage knowledge - no wonder, since another commonly used name for these tools is PKM (Personal Knowledge Management).","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8797371207558321},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8787992672564091},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8763581907309274},{"content":"Tools for creative thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8754503583880817},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.8743074723084805},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8729221277542621},{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8677398495144898},{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis.txt","score":0.8636418037884848},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8635026459111216},{"content":"This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"","parent":"posts/Second Brains.txt","score":0.8627016116260694},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8584569162096494},{"content":"The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.","parent":"posts/Creating new kinds of people.txt","score":0.8583249574581804}],"":[{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8593290080388},{"content":"The club does 2 things.","parent":"posts/untitled-9-24-2021.txt","score":0.8589669169415844},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8577220980911441},{"content":"Code:","parent":"posts/Goals for Spring Quarter.txt","score":0.856649564390397},{"content":"Executing","parent":"posts/Goals for Spring Quarter.txt","score":0.8556654491388678},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter.txt","score":0.8537043599402795},{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8514450468005932},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8499151373626692},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter.txt","score":0.8497861585687644},{"content":"Learn a grappling art (because of quarantine, this will just be maintaining general fitness levels for now)","parent":"posts/Goals for Spring Quarter.txt","score":0.8496945903933114},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter.txt","score":0.8478182318510581},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8472546071060495},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8467379006001533},{"content":"This is for scenarios where you do want to write in an organized manner. For example, right now, this entire page is about","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8466474388580029},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8456538970968254},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8455300536527719},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8455138568311819},{"content":"I'm taking a gap quarter this Spring to work on some personal projects. It is always better to have a plan than to have no plan, even if things don't work out your way, so here are some tentative goals for my gap quarter.","parent":"posts/Goals for Spring Quarter.txt","score":0.8451682294721505},{"content":"Writing cascades","parent":"posts/untitled-10-1-2021.txt","score":0.8444322593169847},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8437967333727141}],"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]] ":[{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":1},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.898812183834886},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.8878707879140119},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8869898991565297},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8860343434504927},{"content":"Tools for creative thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8835372659849138},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8834356900814057},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.88306782383192},{"content":"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data.","parent":"posts/Controlling what you see.txt","score":0.8803881416452084},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8727324650139547},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8721979474714285},{"content":"Thinking as social","parent":"posts/untitled-9-24-2021.txt","score":0.8667718454054663},{"content":"Creative tools vs rational tools","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8662349790897526},{"content":"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]]","parent":"posts/untitled-9-20-2021.txt","score":0.8641245059454583},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8622124581113859},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8611181618600547},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8610504564814605},{"content":"[[roam]] is a tool for rational thought. More broadly, any tool that subscribes to something like a Zettelkasten or Evergreen notes philosophy is a tool for rational thought. The selling point of a tool for rational thought is to manage knowledge - no wonder, since another commonly used name for these tools is PKM (Personal Knowledge Management).","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8591879882816174},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots.txt","score":0.8586835962801413},{"content":"The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.","parent":"posts/Creating new kinds of people.txt","score":0.8545319826223337}],"Users should have complete control over what they see. I'm not saying algorithmic feeds don't have their place, but they should be something users opt in to. Andy [[Matuschak]] coined the idea of \"[programmable attention](https://notes.andymatuschak.org/zJrfPCbY7GcpV9asEc8NTVzXTAV4TvRFMuY6)\" as something [[tools for thought]] could enable. I will say that this already exists, only in the opposite, sinister sense - right now it's the platform programming your attention, not you. ":[{"content":"Users should have complete control over what they see. I'm not saying algorithmic feeds don't have their place, but they should be something users opt in to. Andy [[Matuschak]] coined the idea of \"[programmable attention](https://notes.andymatuschak.org/zJrfPCbY7GcpV9asEc8NTVzXTAV4TvRFMuY6)\" as something [[tools for thought]] could enable. I will say that this already exists, only in the opposite, sinister sense - right now it's the platform programming your attention, not you.","parent":"posts/Controlling what you see.txt","score":1.0000000000000002},{"content":"To what degree can you control what you see on your phone? On any major social media site? The overwhelming trend of the last decade has been to replace user-controlled feeds with algorithmically curated ones. When you go to a newspaper stand, you pick which paper you'd like, which section you'd like to browse, and which article you'd like to read. When you open Facebook, what you see is decided for you by an algorithm mathematically optimized to maximize the amount of time you spend in the app. In the first scenario, the experience is like browsing a menu and ordering a meal. Choices are offered, a deliberation is made. In the second scenario, the content is slop, and the user is a pig eating it from a trough.","parent":"posts/Giant Robots.txt","score":0.880639759659005},{"content":"I'm convinced that algorithmic feeds are poisonous. Algorithmic feeds in apps are like cocaine in old medicines or asbestos in buildings, and someday they'll be seen to be just as barbaric.","parent":"posts/Controlling what you see.txt","score":0.8691847619896724},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.8603762753286862},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8585192877532924},{"content":"My theory is that the current wave rational tools for thought (PKMs, note-taking apps, [[roam]], etc.) will be disrupted by AI-powered tools and search engines. Note taking has always felt futile to me, because the information age has made remembering/memorizing information useless - why memorize when you can look it up? 1","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8495068795799462},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8491918572445185},{"content":"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data.","parent":"posts/Controlling what you see.txt","score":0.8485952837025339},{"content":"Upset at this state of affairs, I found [a chrome extension](https://chrome.google.com/webstore/detail/news-feed-eradicator/fjcldmjmjhkklehbacihaiopjklihlgg?hl=en) that disabled the \"feeds\" on a number of sites (Facebook, Youtube, LinkedIn, even HackerNews). This helped immediately. The unconscious, muscle-memory impulse to press Y and autocomplete into Youtube was still there, but when I opened the page, the algorithmic suggestions were all gone. Staring at the blank space, I would realize that I hadn't opened Youtube because I really wanted to watch anything, I had opened it because it was my impulse to do that while bored.","parent":"posts/Controlling what you see.txt","score":0.8481614896309814},{"content":"Local-first AI presents a huge opportunity to change this. Like the now-dominant paradigms of web and mobile computing, a local-first future is not a forgone conclusion - but it is possible. What if we tried really hard to make filesystems and composable, small, programs usable for ordinary people? What if we designed software in a way that allowed people to take control of their own data? What if we made a bet on increasing computer literacy, rather than surrendering ourselves to infantilizing users?","parent":"posts/The AI-first operating system of the future.txt","score":0.844163295931802},{"content":"In a tantalizingly dialectical fashion, this phenomenon contains its own contradiction - on the very apps that have engineered the collapse of your attention span, you scroll past countless posts on social media addiction, hacks to improve your attention span, dopamine fasts, meditation routines, and even posts urging you to delete the apps on which they are hosted. But these hacks are nothing more than empty promises. The truth is that the world has changed, and you with it. There is no going back to the world where information was scarcer than attention.","parent":"posts/Manifesto.txt","score":0.8434246939066068},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8417511493015727},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.8416331195991832},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8393408359777061},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8359493538029732},{"content":"Who cares? Make all the metaphysical arguments you'd like, a sufficiently powerful recommendation algorithm will still be able to sway decisions enough for Facebook to make 86 billion dollars a year. Free will may or may not be real, but it is an empirical fact that the profitable choice is to act as if it isn't.","parent":"posts/Giant Robots.txt","score":0.833697897200043},{"content":"The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8331437853052639},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8324006046103231},{"content":"I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8323583645582383},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8302927669811997}]}