{"":[{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8593290080388},{"content":"The club does 2 things.","parent":"posts/untitled-9-24-2021.txt","score":0.8589669169415844},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8577220980911441},{"content":"Code:","parent":"posts/Goals for Spring Quarter.txt","score":0.856649564390397},{"content":"Executing","parent":"posts/Goals for Spring Quarter.txt","score":0.8556654491388678},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter.txt","score":0.8537043599402795},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8499151373626692},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter.txt","score":0.8497861585687644},{"content":"Learn a grappling art (because of quarantine, this will just be maintaining general fitness levels for now)","parent":"posts/Goals for Spring Quarter.txt","score":0.8496945903933114},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter.txt","score":0.8478182318510581},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8472546071060495},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8467379006001533},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8456538970968254},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8455300536527719},{"content":"I'm taking a gap quarter this Spring to work on some personal projects. It is always better to have a plan than to have no plan, even if things don't work out your way, so here are some tentative goals for my gap quarter.","parent":"posts/Goals for Spring Quarter.txt","score":0.8451682294721505},{"content":"Writing cascades","parent":"posts/untitled-10-1-2021.txt","score":0.8444322593169847},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8437967333727141},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.8436725970663741},{"content":"Sitting in the MU again, this time with a view of the quad. Listening to \"The Time of the Season\" by the Zombies.","parent":"posts/untitled-9-24-2021.txt","score":0.8434310607466774},{"content":"Visual developer tools","parent":"posts/untitled-9-24-2021.txt","score":0.8428686770659811}],"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.":[{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":1.0000000000000002},{"content":"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.","parent":"posts/Plaintext is your best friend.txt","score":0.8964750193665462},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8936604696228478},{"content":"If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.","parent":"posts/Second Brains.txt","score":0.8917190152709774},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8847415344727535},{"content":"Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8839797869681402},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8821062136409578},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8682302650723894},{"content":"Learning Javascript, I never took notes, because all the reference docs were online anyways. Besides, the difficult part of programming isn't remembering APIs, it's the process of taking an idea and building it out, and there's no way to get better at that except by building. There's a reason most university CS courses don't test memorization heavily and instead focus on having students build projects. I suspect this is true for a lot of subjects.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.86600982795442},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8638877128159577},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.863625121188431},{"content":"Also encouraging was the fact that I started hearing about similar notetaking apps a couple months into developing exegesis. Apps like Roam Research, and Obsidian were making waves on Twitter, and were taking a similar approach to nonlinear writing that I wanted to take exegesis in. This proved that I wasn't alone in needing this kind of product.","parent":"posts/Second Brains.txt","score":0.8618988958559577},{"content":"Of course, if you're looking to raise a billion dollars on your consumer-facing notetaking app, plain text won't cut it. Lucky for us all, Jerome Powell has acted wisely to proscribe this possibility.","parent":"posts/Plaintext is your best friend.txt","score":0.8584339311739616},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8564805716036293},{"content":"Working on exegesis was a grueling affair at times. I rewrote the schema multiple times, rewrote the backend from scratch 2 months before release, chased countless UI bugs, and manually patched abandoned NPM packages. Part of it may have been due to my inexperience, but [working with ](https://nichwch.medium.com/making-yana-e3fade3f56e7)[rich text](https://medium.engineering/why-contenteditable-is-terrible-122d8a40e480) is just a [difficult task](https://twitter.com/thesephist/status/1360298464349999108), period. At one point, I considered giving up after finding a rival writing app I thought I simply couldn't compete with - I have a copy of an unfinished essay I started writing on why I had given up tucked away somewhere.","parent":"posts/Prometheus.txt","score":0.8555426044416811},{"content":"For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8545470140306266},{"content":"My theory is that the current wave rational tools for thought (PKMs, note-taking apps, [[roam]], etc.) will be disrupted by AI-powered tools and search engines. Note taking has always felt futile to me, because the information age has made remembering/memorizing information useless - why memorize when you can look it up? 1","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8524055679905899},{"content":"Exegesis is the Apple Notes to Roam Research's Microsoft Word. It is less powerful, but it is simpler. A notetaking app should not force your mind to conform to it, it should conform to your mind. Personally, I prefer having an open document to write into over a bullet point system, even if the latter allows for more complex queries and notetaking systems. Some people hate both and prefer the simplicity of pen and paper. Do what works for you.","parent":"posts/Second Brains.txt","score":0.8518581616593848},{"content":"People take notes to remember. The goal is to write down information, delivered in some lossy format like a lecture, video, or a book, and crystallize the main points in writing so you can access them later. The goal is a rational one, focused on knowledge.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8496822272287413},{"content":"In any case I wanted to try something new because that's what Recurse is all about, so I tried making a project with just JS and JSDoc for some semblance of type safety.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8496241971937336}],"Plaintext is your best friend.":[{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":1},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8829023765677338},{"content":"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.","parent":"posts/Plaintext is your best friend.txt","score":0.8736902590564416},{"content":"Here's the thing - I don't think anyone really needs right text that badly. Italics and bold don't matter that much. The one thing I find myself missing a lot is titles, but you can do something similar with plaintext simply by having a number before a line, like so:","parent":"posts/Plaintext is your best friend.txt","score":0.8491827978360544},{"content":"Yurt is a static site generator, built off the same principles as Nomad Hypertext.","parent":"posts/What is Yurt.txt","score":0.8434663551063123},{"content":"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links.","parent":"posts/Plaintext is your best friend.txt","score":0.840226545161426},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8396649877867414},{"content":"Of course, if you're looking to raise a billion dollars on your consumer-facing notetaking app, plain text won't cut it. Lucky for us all, Jerome Powell has acted wisely to proscribe this possibility.","parent":"posts/Plaintext is your best friend.txt","score":0.8347821040319133},{"content":"Also encouraging was the fact that I started hearing about similar notetaking apps a couple months into developing exegesis. Apps like Roam Research, and Obsidian were making waves on Twitter, and were taking a similar approach to nonlinear writing that I wanted to take exegesis in. This proved that I wasn't alone in needing this kind of product.","parent":"posts/Second Brains.txt","score":0.8312899845525346},{"content":"Exegesis is the Apple Notes to Roam Research's Microsoft Word. It is less powerful, but it is simpler. A notetaking app should not force your mind to conform to it, it should conform to your mind. Personally, I prefer having an open document to write into over a bullet point system, even if the latter allows for more complex queries and notetaking systems. Some people hate both and prefer the simplicity of pen and paper. Do what works for you.","parent":"posts/Second Brains.txt","score":0.829171752138456},{"content":"The way Napoleon understood the grammar of gunpowder and de Tocqueville understood the grammar of print and typography, I would like to master the grammar of hypertext.","parent":"posts/Fragments.txt","score":0.8269344096293204},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.822056847593647},{"content":"I may take a typography class this quarter. It's not required for graduation, but I figure it could help me design better products, and maybe make [[exegesis]] look prettier.","parent":"posts/untitled-9-22-2021.txt","score":0.8219306283432031},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.8210758202542365},{"content":"If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.","parent":"posts/Second Brains.txt","score":0.820951705238446},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.8199451047717906},{"content":"Typography","parent":"posts/untitled-9-22-2021.txt","score":0.8198287091111898},{"content":"The world cannot be distilled into neat, concrete categories. Neither can your thoughts. Isn't it time your notes got a little messier?","parent":"posts/Manifesto.txt","score":0.8196770957003721},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8186369913168211},{"content":"However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. \n\nFactoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8169946636930863}],"// 1. SECTION TITLE":[{"content":"// 1. SECTION TITLE","parent":"posts/Plaintext is your best friend.txt","score":0.9999999999999998},{"content":"// Context","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8651010669951706},{"content":"// MISTAKE 1: JAVASCRIPT INSTEAD OF TYPESCRIPT","parent":"posts/The making of Nomad Hypertext.txt","score":0.8585255527870423},{"content":"// Read this, liked it a lot.","parent":"posts/untitled-9-22-2021.txt","score":0.8345150358545},{"content":"// MISTAKE 3: NOT BEING UNIX-PILLED ENOUGH","parent":"posts/The making of Nomad Hypertext.txt","score":0.8329877639986104},{"content":"// Postscript","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8291785832062497},{"content":"// Reflections and originals","parent":"posts/On auteurs and language.txt","score":0.8255917120682301},{"content":"// Footnotes","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8252438687675564},{"content":"// [https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q](https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q)","parent":"posts/untitled-9-22-2021.txt","score":0.8250221847337066},{"content":"// MISTAKE 2: ELECTRON","parent":"posts/The making of Nomad Hypertext.txt","score":0.8243998469116918},{"content":"// Youtube vs Spotify","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8170960571363652},{"content":"// Community","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8168279445622868},{"content":"// Technology that you control","parent":"posts/Giant Robots.txt","score":0.8143094335989453},{"content":"// Connections","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8106443863894999},{"content":"// Technology that controls you","parent":"posts/Giant Robots.txt","score":0.8078213126404213}],"The other thing I miss is links. You can still paste urls, however. It's ugly but it works. ":[{"content":"The other thing I miss is links. You can still paste urls, however. It's ugly but it works.","parent":"posts/Plaintext is your best friend.txt","score":0.9999999999999998},{"content":"Edit: I have added very basic support for Markdown to Yurt - right now pretty much only links work.","parent":"posts/Plaintext is your best friend.txt","score":0.8822947319385676},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.8360760027915062},{"content":"1. The current wave of backlink-focused apps have a compelling response to this objection, which is that they're not focused on just copying information, they're focused on capturing the connections between ideas. Fair enough. But why require the end user to manually copy information down? It seems that this could be done more effectively through an annotation layer.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8324437970610852},{"content":"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links.","parent":"posts/Plaintext is your best friend.txt","score":0.8303975753644277},{"content":"Two, we will maintain a collective website at [https://rhizome.world/.](https://rhizome.world/.) The site is open source, you can find the repo here: [https://github.com/nichwch/rhizome-club.](https://github.com/nichwch/rhizome-club.)","parent":"posts/untitled-9-24-2021.txt","score":0.8288539743800842},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8279028127931476},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8275188815240552},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8256263105148265},{"content":"Upset at this state of affairs, I found [a chrome extension](https://chrome.google.com/webstore/detail/news-feed-eradicator/fjcldmjmjhkklehbacihaiopjklihlgg?hl=en) that disabled the \"feeds\" on a number of sites (Facebook, Youtube, LinkedIn, even HackerNews). This helped immediately. The unconscious, muscle-memory impulse to press Y and autocomplete into Youtube was still there, but when I opened the page, the algorithmic suggestions were all gone. Staring at the blank space, I would realize that I hadn't opened Youtube because I really wanted to watch anything, I had opened it because it was my impulse to do that while bored.","parent":"posts/Controlling what you see.txt","score":0.8248402140046045},{"content":"I want this new site to be a space for that.","parent":"posts/Fragments.txt","score":0.8230678868052852},{"content":"This was reassuring, because it meant I had made something genuinely useful. In the past, I have made things I simply had no desire to use - one example is [JAFT](https://nichwch.medium.com/what-is-jaft-f543a4fad9d7), a time tracking app I made after making YANA (the predecessor to exegesis). I stopped using it after a bit, and didn't bother renewing the domain. I don't miss JAFT at all. The fact that I did miss exegesis on the days where it wasn't operational was a good sign.","parent":"posts/Second Brains.txt","score":0.8221048847796864},{"content":"I spend an inordinate amount of time on Youtube. Having noticed this one morning, I quietly told myself that I wouldn't check Youtube for the rest of the work session - only to find that I would unconsciously press \"Y+enter\" and let the address bar's autocomplete lead me to Youtube. I would find myself on the site, not remembering how I had gotten there. More importantly, the home page recommendations had learned my preferences incredibly well. As soon as I landed on Youtube, there would be at least one video there ready for me to watch. That morning, I got nothing done. Youtube's algorithm had figured out that I really liked watching short clips of Mad Men and provided me a steady drip-feed of them, which I gorged on instead of getting anything done.","parent":"posts/Controlling what you see.txt","score":0.8204242631363519},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.8199290924592247},{"content":"However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. \n\nFactoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8196811075864399},{"content":"None of it worked. Why? It's not that these tools don't work in general - plenty of people swear by them. The problem was either with the tools, or with me. Technology exists for the utility of the user, not the other way around, so I rejected the latter answer.","parent":"posts/Why I made exegesis.txt","score":0.8144792899261991},{"content":"I think eventually, I might want to deploy a blog with a full fledged backend, so users can query anything they'd like to my blog.","parent":"posts/What is Yurt.txt","score":0.8143111757521635},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8140286243463865},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8138835980161693},{"content":"The idea will be for members to create their own pages on the site, to experiment with one-off ideas inspired by the website critiques.","parent":"posts/untitled-9-24-2021.txt","score":0.8137036580036497}],"Here's the thing - I don't think anyone really needs right text that badly. Italics and bold don't matter that much. The one thing I find myself missing a lot is titles, but you can do something similar with plaintext simply by having a number before a line, like so:":[{"content":"Here's the thing - I don't think anyone really needs right text that badly. Italics and bold don't matter that much. The one thing I find myself missing a lot is titles, but you can do something similar with plaintext simply by having a number before a line, like so:","parent":"posts/Plaintext is your best friend.txt","score":1.0000000000000002},{"content":"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.","parent":"posts/Plaintext is your best friend.txt","score":0.8834316335190427},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8612167644681432},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8491827978360544},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8337011760709369},{"content":"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links.","parent":"posts/Plaintext is your best friend.txt","score":0.8324173206914538},{"content":"I may take a typography class this quarter. It's not required for graduation, but I figure it could help me design better products, and maybe make [[exegesis]] look prettier.","parent":"posts/untitled-9-22-2021.txt","score":0.821956182460256},{"content":"Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8141067927765787},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8116995692101483},{"content":"Typography","parent":"posts/untitled-9-22-2021.txt","score":0.8100898139870238},{"content":"For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8095158029270144},{"content":"Tagging this all meta-acropolis, an edtech project I'm in the early stages of working on. Don't have any code for it, just ideas, but I plan on putting something together soon™. [[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8091082516394771},{"content":"The world cannot be distilled into neat, concrete categories. Neither can your thoughts. Isn't it time your notes got a little messier?","parent":"posts/Manifesto.txt","score":0.8084682863266962},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8073227996285103},{"content":"The way Napoleon understood the grammar of gunpowder and de Tocqueville understood the grammar of print and typography, I would like to master the grammar of hypertext.","parent":"posts/Fragments.txt","score":0.8069831399215001},{"content":"I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]]","parent":"posts/untitled-9-24-2021.txt","score":0.8064799765169333},{"content":"Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8015461163952604},{"content":"Of course, if you're looking to raise a billion dollars on your consumer-facing notetaking app, plain text won't cut it. Lucky for us all, Jerome Powell has acted wisely to proscribe this possibility.","parent":"posts/Plaintext is your best friend.txt","score":0.8008460594103319},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8005709405185895},{"content":"I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8003709209393906}],"~":[{"content":"A thousand suns","parent":"posts/Why I made exegesis.txt","score":0.8319412092112017},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8278526468544705},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8262986789560413},{"content":"You're viewing this on a statically generated blog using Yurt!","parent":"posts/What is Yurt.txt","score":0.8260014199682172},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8223588348016678},{"content":"\"From the moment I understood the weakness of my flesh, it disgusted me. I craved for strength and certainty of steel. I aspired to the purity of the blessed machine. Your kind cling to your flesh, as though it will not decay and fail you. One day the crude biomass you call a temple will wither and you will beg my kind to save you.\n\nBut I am already saved. For the Machine is immortal.\"\n\n- Magos Dominus Reditus, Warhammer 40k","parent":"posts/Second Brains.txt","score":0.8206241415459742},{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.8192152841997462},{"content":"Sitting in the MU again, this time with a view of the quad. Listening to \"The Time of the Season\" by the Zombies.","parent":"posts/untitled-9-24-2021.txt","score":0.8183824623083222},{"content":"Executing","parent":"posts/Goals for Spring Quarter.txt","score":0.8177347150596291},{"content":"I'm borrowing heavily from [[Zen and the Art of Motorcycle Repair]] here, obviously.","parent":"posts/untitled-9-30-2021.txt","score":0.8170123182828641},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8167884409523942},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8166671776230381},{"content":"This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"","parent":"posts/Second Brains.txt","score":0.8143794586493673},{"content":"Code:","parent":"posts/Goals for Spring Quarter.txt","score":0.8143709919826895},{"content":"I'm taking a gap quarter this Spring to work on some personal projects. It is always better to have a plan than to have no plan, even if things don't work out your way, so here are some tentative goals for my gap quarter.","parent":"posts/Goals for Spring Quarter.txt","score":0.8140836497805376},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.813830911515195},{"content":"The fact that most people interact with computers through web and mobile was not some foregone conclusion. It took serious effort and ingenuity from really smart people to make these platforms accessible to regular people. Once upon a time, filesystems and personal computers were the dominant paradigm of computing, and it was web and mobile that were strange, inaccessible pipe dreams. Increasingly, the opposite is the case.","parent":"posts/The AI-first operating system of the future.txt","score":0.81372877865983},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8134866602495796},{"content":"To make regular progress towards personal projects, I'll be writing more on my development progress with [[exegesis]], under the tag [[devlog]]. I'll also be publishing another post soon on my plans for future features, and when I expect to release them by. I will do something similar with my other projects.","parent":"posts/Goals for Spring Quarter.txt","score":0.8120322691349725},{"content":"rhizome.world","parent":"posts/untitled-9-24-2021.txt","score":0.8107301821596414}],"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc. ":[{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":1.0000000000000002},{"content":"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.","parent":"posts/Plaintext is your best friend.txt","score":0.9100535815565137},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8936604696228478},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8882857950800602},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8844372865627852},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8829023765677338},{"content":"Exegesis is the Apple Notes to Roam Research's Microsoft Word. It is less powerful, but it is simpler. A notetaking app should not force your mind to conform to it, it should conform to your mind. Personally, I prefer having an open document to write into over a bullet point system, even if the latter allows for more complex queries and notetaking systems. Some people hate both and prefer the simplicity of pen and paper. Do what works for you.","parent":"posts/Second Brains.txt","score":0.8814588541867616},{"content":"If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.","parent":"posts/Second Brains.txt","score":0.8793314275650559},{"content":"Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8775532467470629},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8686625856625385},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8670181896250482},{"content":"Of course, if you're looking to raise a billion dollars on your consumer-facing notetaking app, plain text won't cut it. Lucky for us all, Jerome Powell has acted wisely to proscribe this possibility.","parent":"posts/Plaintext is your best friend.txt","score":0.8644991728944869},{"content":"The world cannot be distilled into neat, concrete categories. Neither can your thoughts. Isn't it time your notes got a little messier?","parent":"posts/Manifesto.txt","score":0.8630150382048185},{"content":"Here's the thing - I don't think anyone really needs right text that badly. Italics and bold don't matter that much. The one thing I find myself missing a lot is titles, but you can do something similar with plaintext simply by having a number before a line, like so:","parent":"posts/Plaintext is your best friend.txt","score":0.8612167644681432},{"content":"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links.","parent":"posts/Plaintext is your best friend.txt","score":0.8602530892395219},{"content":"Also encouraging was the fact that I started hearing about similar notetaking apps a couple months into developing exegesis. Apps like Roam Research, and Obsidian were making waves on Twitter, and were taking a similar approach to nonlinear writing that I wanted to take exegesis in. This proved that I wasn't alone in needing this kind of product.","parent":"posts/Second Brains.txt","score":0.8532795225743878},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8524067756676068},{"content":"1. The current wave of backlink-focused apps have a compelling response to this objection, which is that they're not focused on just copying information, they're focused on capturing the connections between ideas. Fair enough. But why require the end user to manually copy information down? It seems that this could be done more effectively through an annotation layer.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8449973360851781},{"content":"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]]","parent":"posts/untitled-9-20-2021.txt","score":0.8402749334119811},{"content":"My theory is that the current wave rational tools for thought (PKMs, note-taking apps, [[roam]], etc.) will be disrupted by AI-powered tools and search engines. Note taking has always felt futile to me, because the information age has made remembering/memorizing information useless - why memorize when you can look it up? 1","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8402546842627255}],"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.":[{"content":"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.","parent":"posts/Plaintext is your best friend.txt","score":1.0000000000000002},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.9100535815565137},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8964750193665462},{"content":"Here's the thing - I don't think anyone really needs right text that badly. Italics and bold don't matter that much. The one thing I find myself missing a lot is titles, but you can do something similar with plaintext simply by having a number before a line, like so:","parent":"posts/Plaintext is your best friend.txt","score":0.8834316335190427},{"content":"Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8778301341890326},{"content":"If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.","parent":"posts/Second Brains.txt","score":0.8767776557155313},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8767604340944478},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8736902590564416},{"content":"Exegesis is the Apple Notes to Roam Research's Microsoft Word. It is less powerful, but it is simpler. A notetaking app should not force your mind to conform to it, it should conform to your mind. Personally, I prefer having an open document to write into over a bullet point system, even if the latter allows for more complex queries and notetaking systems. Some people hate both and prefer the simplicity of pen and paper. Do what works for you.","parent":"posts/Second Brains.txt","score":0.8719870970552531},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8717510906932759},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8707622827274708},{"content":"Of course, if you're looking to raise a billion dollars on your consumer-facing notetaking app, plain text won't cut it. Lucky for us all, Jerome Powell has acted wisely to proscribe this possibility.","parent":"posts/Plaintext is your best friend.txt","score":0.8696177206924869},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.863602437800307},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.858698862901461},{"content":"The world cannot be distilled into neat, concrete categories. Neither can your thoughts. Isn't it time your notes got a little messier?","parent":"posts/Manifesto.txt","score":0.856746948171307},{"content":"For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.853621399179337},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8517803251012422},{"content":"Also encouraging was the fact that I started hearing about similar notetaking apps a couple months into developing exegesis. Apps like Roam Research, and Obsidian were making waves on Twitter, and were taking a similar approach to nonlinear writing that I wanted to take exegesis in. This proved that I wasn't alone in needing this kind of product.","parent":"posts/Second Brains.txt","score":0.8491138489993479},{"content":"My theory is that the current wave rational tools for thought (PKMs, note-taking apps, [[roam]], etc.) will be disrupted by AI-powered tools and search engines. Note taking has always felt futile to me, because the information age has made remembering/memorizing information useless - why memorize when you can look it up? 1","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8436126530702293},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8413675494761205}],"Of course, if you're looking to raise a billion dollars on your consumer-facing notetaking app, plain text won't cut it. Lucky for us all, Jerome Powell has acted wisely to proscribe this possibility.":[{"content":"Of course, if you're looking to raise a billion dollars on your consumer-facing notetaking app, plain text won't cut it. Lucky for us all, Jerome Powell has acted wisely to proscribe this possibility.","parent":"posts/Plaintext is your best friend.txt","score":1},{"content":"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.","parent":"posts/Plaintext is your best friend.txt","score":0.8696177206924869},{"content":"Also encouraging was the fact that I started hearing about similar notetaking apps a couple months into developing exegesis. Apps like Roam Research, and Obsidian were making waves on Twitter, and were taking a similar approach to nonlinear writing that I wanted to take exegesis in. This proved that I wasn't alone in needing this kind of product.","parent":"posts/Second Brains.txt","score":0.8662823824718429},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8644991728944869},{"content":"Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.858913826706539},{"content":"If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.","parent":"posts/Second Brains.txt","score":0.8585694071407385},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8584339311739616},{"content":"Exegesis is the Apple Notes to Roam Research's Microsoft Word. It is less powerful, but it is simpler. A notetaking app should not force your mind to conform to it, it should conform to your mind. Personally, I prefer having an open document to write into over a bullet point system, even if the latter allows for more complex queries and notetaking systems. Some people hate both and prefer the simplicity of pen and paper. Do what works for you.","parent":"posts/Second Brains.txt","score":0.8503343703094908},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8503219998897403},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8467117271844669},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8430913906801764},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8411937537154963},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8347821040319133},{"content":"People take notes to remember. The goal is to write down information, delivered in some lossy format like a lecture, video, or a book, and crystallize the main points in writing so you can access them later. The goal is a rational one, focused on knowledge.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8310481646654223},{"content":"My theory is that the current wave rational tools for thought (PKMs, note-taking apps, [[roam]], etc.) will be disrupted by AI-powered tools and search engines. Note taking has always felt futile to me, because the information age has made remembering/memorizing information useless - why memorize when you can look it up? 1","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8306067585972013},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8276374616953817},{"content":"I may take a typography class this quarter. It's not required for graduation, but I figure it could help me design better products, and maybe make [[exegesis]] look prettier.","parent":"posts/untitled-9-22-2021.txt","score":0.8232505597230294},{"content":"1. The current wave of backlink-focused apps have a compelling response to this objection, which is that they're not focused on just copying information, they're focused on capturing the connections between ideas. Fair enough. But why require the end user to manually copy information down? It seems that this could be done more effectively through an annotation layer.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.820739667358955},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8199569327000643},{"content":"The world cannot be distilled into neat, concrete categories. Neither can your thoughts. Isn't it time your notes got a little messier?","parent":"posts/Manifesto.txt","score":0.8194108026502758}],"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links. ":[{"content":"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links.","parent":"posts/Plaintext is your best friend.txt","score":1.0000000000000002},{"content":"Yurt is a static site generator, built off the same principles as Nomad Hypertext.","parent":"posts/What is Yurt.txt","score":0.9091979616022754},{"content":"Edit: I have added very basic support for Markdown to Yurt - right now pretty much only links work.","parent":"posts/Plaintext is your best friend.txt","score":0.9007737818561415},{"content":"However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. \n\nFactoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8889775156533777},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.881064905878126},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.8789977487858618},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8602530892395219},{"content":"You're viewing this on a statically generated blog using Yurt!","parent":"posts/What is Yurt.txt","score":0.8488697292910957},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8466959005726166},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.840226545161426},{"content":"On the other hand, hypertext is built around the idea of a hyperlink, which is just a link from one document to another. Think about Wikipedia, and how every page is rich with links and connections to other pages. It is incoherent to talk about reading Wikipedia \"from start to end.\" Books create linear paths from A to B, hypertext creates entire worlds ripe for exploration.","parent":"posts/Why I made exegesis.txt","score":0.836685228118287},{"content":"Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8336402570193057},{"content":"I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8326510294676149},{"content":"Here's the thing - I don't think anyone really needs right text that badly. Italics and bold don't matter that much. The one thing I find myself missing a lot is titles, but you can do something similar with plaintext simply by having a number before a line, like so:","parent":"posts/Plaintext is your best friend.txt","score":0.8324173206914538},{"content":"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.","parent":"posts/Plaintext is your best friend.txt","score":0.8307968306523591},{"content":"The other thing I miss is links. You can still paste urls, however. It's ugly but it works.","parent":"posts/Plaintext is your best friend.txt","score":0.8303975753644277},{"content":"The way Napoleon understood the grammar of gunpowder and de Tocqueville understood the grammar of print and typography, I would like to master the grammar of hypertext.","parent":"posts/Fragments.txt","score":0.8215029029875434},{"content":"The vision is to have a tool that provides a visual interface for creating layouts, and maybe even rigging up basic stateful logic, or data fetching logic. I've more or less nailed down a preferred personal stack for creating projects with React, Express and Postgres, so it shouldn't be terribly difficult to even integrate database logic/fetching logic into such a tool (so long as some flexibility is lost on technology choice).[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8207802068735199},{"content":"1. The current wave of backlink-focused apps have a compelling response to this objection, which is that they're not focused on just copying information, they're focused on capturing the connections between ideas. Fair enough. But why require the end user to manually copy information down? It seems that this could be done more effectively through an annotation layer.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8202590736161491},{"content":"Why not Tauri? With Tauri you have to write your backend routes in Rust. Surprisingly, I could not find any in-memory vector databases in Rust. I also have never written Rust in my life, though I would have been happy to pick it up to avoid using Electron. More importantly, I don't think there was a library that would have let me run Hugging Face's text embedding model in Rust. For these reasons, I had to use JS for my backend, which meant I had to use Electron.","parent":"posts/The making of Nomad Hypertext.txt","score":0.820216141628212}],"Edit: I have added very basic support for Markdown to Yurt - right now pretty much only links work.":[{"content":"Edit: I have added very basic support for Markdown to Yurt - right now pretty much only links work.","parent":"posts/Plaintext is your best friend.txt","score":1},{"content":"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links.","parent":"posts/Plaintext is your best friend.txt","score":0.9007737818561415},{"content":"The other thing I miss is links. You can still paste urls, however. It's ugly but it works.","parent":"posts/Plaintext is your best friend.txt","score":0.8822947319385676},{"content":"You're viewing this on a statically generated blog using Yurt!","parent":"posts/What is Yurt.txt","score":0.8773437106594328},{"content":"Yurt is a static site generator, built off the same principles as Nomad Hypertext.","parent":"posts/What is Yurt.txt","score":0.8752938710872707},{"content":"However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. \n\nFactoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8535269069014153},{"content":"Two, we will maintain a collective website at [https://rhizome.world/.](https://rhizome.world/.) The site is open source, you can find the repo here: [https://github.com/nichwch/rhizome-club.](https://github.com/nichwch/rhizome-club.)","parent":"posts/untitled-9-24-2021.txt","score":0.8310783275304938},{"content":"1. The current wave of backlink-focused apps have a compelling response to this objection, which is that they're not focused on just copying information, they're focused on capturing the connections between ideas. Fair enough. But why require the end user to manually copy information down? It seems that this could be done more effectively through an annotation layer.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8277168030932495},{"content":"I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.","parent":"posts/Reflections for the New Year.txt","score":0.8265241049045361},{"content":"None of it worked. Why? It's not that these tools don't work in general - plenty of people swear by them. The problem was either with the tools, or with me. Technology exists for the utility of the user, not the other way around, so I rejected the latter answer.","parent":"posts/Why I made exegesis.txt","score":0.8261047411845959},{"content":"Visual developer tools","parent":"posts/untitled-9-24-2021.txt","score":0.8260667262376874},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.822972546066006},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.8228886713849628},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8219711085494883},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8205912068824326},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8179299240659907},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt.txt","score":0.8145263610572011},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8138825142700282},{"content":"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]]","parent":"posts/untitled-9-20-2021.txt","score":0.8135005169899312},{"content":"This was reassuring, because it meant I had made something genuinely useful. In the past, I have made things I simply had no desire to use - one example is [JAFT](https://nichwch.medium.com/what-is-jaft-f543a4fad9d7), a time tracking app I made after making YANA (the predecessor to exegesis). I stopped using it after a bit, and didn't bother renewing the domain. I don't miss JAFT at all. The fact that I did miss exegesis on the days where it wasn't operational was a good sign.","parent":"posts/Second Brains.txt","score":0.8134360834602793}]," ":[{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8593290080388},{"content":"The club does 2 things.","parent":"posts/untitled-9-24-2021.txt","score":0.8589669169415844},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8577220980911441},{"content":"Code:","parent":"posts/Goals for Spring Quarter.txt","score":0.856649564390397},{"content":"Executing","parent":"posts/Goals for Spring Quarter.txt","score":0.8556654491388678},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter.txt","score":0.8537043599402795},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8499151373626692},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter.txt","score":0.8497861585687644},{"content":"Learn a grappling art (because of quarantine, this will just be maintaining general fitness levels for now)","parent":"posts/Goals for Spring Quarter.txt","score":0.8496945903933114},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter.txt","score":0.8478182318510581},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8472546071060495},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8467379006001533},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8456538970968254},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8455300536527719},{"content":"I'm taking a gap quarter this Spring to work on some personal projects. It is always better to have a plan than to have no plan, even if things don't work out your way, so here are some tentative goals for my gap quarter.","parent":"posts/Goals for Spring Quarter.txt","score":0.8451682294721505},{"content":"Writing cascades","parent":"posts/untitled-10-1-2021.txt","score":0.8444322593169847},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8437967333727141},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.8436725970663741},{"content":"Sitting in the MU again, this time with a view of the quad. Listening to \"The Time of the Season\" by the Zombies.","parent":"posts/untitled-9-24-2021.txt","score":0.8434310607466774},{"content":"Visual developer tools","parent":"posts/untitled-9-24-2021.txt","score":0.8428686770659811}]}