{"Music is everywhere. Thanks to portable electronics and streaming services, the average person has likely listened to more music than all their ancestors did, combined. Not only do we listen to more music, we have access to a wider array of it as well - for just ten dollars a month, you can get access to an unfathomably large library of music, containing everything from 17th century baroque clavichord pieces to zoomer hyperpop.":[],"Here's another difference between the way we experience music and the way our ancestors did: it used to be the case that music was almost always a social experience. Before technology, if you wanted to listen to music, someone had to play music. It was a special, ceremonious event. The modern experience of listening to music alone, all the time would have been incomprehensible to our ancestors. ":[],"The pandemic has made things even worse. Before the pandemic, music could still be a social experience, in the form of live shows and concerts, but now it has become a completely solo activity. Without live music, most people experience music as the blank grey rows in their Spotify playlists. ":[],"":[{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8514450468005932},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8455138568311819},{"content":"You're viewing this on a statically generated blog using Yurt!","parent":"posts/What is Yurt.txt","score":0.8352868364347527},{"content":"Yurt is a static site generator, built off the same principles as Nomad Hypertext.","parent":"posts/What is Yurt.txt","score":0.83147189188003},{"content":"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.","parent":"posts/What is Nomad Hypertext.txt","score":0.8308738608102689},{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8286014862219001},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt.txt","score":0.82507608178487},{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text. Semantic search is all you need!","parent":"posts/What is Nomad Hypertext.txt","score":0.8244515437960355},{"content":"The app is free and open source. Notes are stored as plain text files, which means you are free to use tools like git to sync them across multiple devices, and free to port your notes over to other apps if you wish.","parent":"posts/What is Nomad Hypertext.txt","score":0.8229781287130151},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search \nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.8171806181110879},{"content":"I think eventually, I might want to deploy a blog with a full fledged backend, so users can query anything they'd like to my blog.","parent":"posts/What is Yurt.txt","score":0.8124904819875103},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.8052637922392895}],"Something weird is happening here - we have access to more music and genres than ever before in human history, and yet it feels like something important is missing. Many of the people I talk to listen to music all the time, but I get the sense that it's more to ward off the dreaded experience of silence than it is to actually enjoy music. ":[],"Here are a three things that are missing from the modern experience of music.":[],"// Context":[],"Music is about context. A song is never just a song, it contains all the circumstances that it was listened to under - whether you heard it live, the street you were walking down when you heard it, the mood you were in when you heard it, the people it made you think of, etc. ":[],"[Watch this performance of Autumn Leaves.](https://www.youtube.com/watch?v=7t3xBqAWLaU&list=PLo-DRv8z8J7ouU1ksk8YvSVjXCYLOKPEp&index=75) ":[],"You could easily strip the audio from the video, touch it up a bit, and upload it as Spotify track. However, you'd miss out on so many precious details - how thrilled the old violinist is with the bassist's playing, the chatter from the onlookers praising their playing, the moment the camera pans to show the picturesque Italian street they're playing on, how they stop for a bit and the audience starts clapping prematurely, only to be pleasantly surprised when they start playing again with a faster rhythm.":[],"It's these details that we miss about music. A song should never just be a song, but on a streaming platform, that's all it can really be - just another row in a playlist. ":[],"// Community":[],"As mentioned earlier, the modern experience of listening to music alone is completely novel - before technology, listening to music was always a social affair, unless you were playing music for yourself. ":[],"// Connections":[],"Whether its noticing that two songs use the same chord progression, stealing a nice lick from your favorite blues guitarist, making a mashup of two of your favorite songs, or translating a song into a different genre, playing music is all about making connections. Unfortunately, the way we listen to music prevents us from doing this.":[{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8093430808703175}],"The main obstacle is the playlist. Playlists trap music and prevent listeners from creating rich connections between their songs - I will elaborate on this point later.":[],"Strangely enough, though Youtube is a general purpose video sharing site and Spotify is a platform dedicated to music, I think Youtube does a better job at capturing the spirit of music.":[],"// Youtube vs Spotify":[],"Here, there is context (the theming of the video/playlist), and community (the commenters playing along with the theme). Taken together, they create something that can only be described as a vibe. I don't think you could even come close to doing something this cool with a Spotify playlist.":[],"Consider two things I think to be missing from modern music: context and community. While its nothing compared to live music, I think certain Youtube videos capture these elements in a novel and exciting way.":[{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search \nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.800552332129544}],"[Take this video for example.](https://www.youtube.com/watch?v=uMCSdgkdOJc&t=363s) It's titled 'this playlist will make you feel like a 19th century villain,' and it's a playlist full of mostly romantic-era orchestral pieces. But here, the music isn't just the music: there is a stylish photo of classical architecture to go with it, Tchaikovsky is introduced as 'Pyotr F*CKING Tchaikovsky,' and the description contains an edgy sounding Oscar Wilde quote to really set the mood.  Most importantly, the comments section is full of people playing along with the 19th century villain premise, cracking jokes about how the Youtube algorithm clearly wants them to join the Dark Side. One commenter describes the playlist with this pithy remark: \"committing serial homicide at the 1893 world's fair type beat.\"":[]}