{"The auteur is suspicious of language.":[],"Neither perspective is completely correct. The reality is that there is a tradeoff between the approach of creative collaboration and the approach of an auteur. What creative collaborators gain through specialization and the combination of talents, they lose in the fidelity of their ideas' expression; what the auteur loses through not being able to harness others' talents, he gains through the ability to express an idea to its fullest. Naturally, the more talents the auteur is able to accrue, the less he needs others, and the more worthwhile the tradeoff of solo work becomes.  ":[{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8118129443587316}],"":[{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8514450468005932},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8455138568311819},{"content":"You're viewing this on a statically generated blog using Yurt!","parent":"posts/What is Yurt.txt","score":0.8352868364347527},{"content":"Yurt is a static site generator, built off the same principles as Nomad Hypertext.","parent":"posts/What is Yurt.txt","score":0.83147189188003},{"content":"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.","parent":"posts/What is Nomad Hypertext.txt","score":0.8308738608102689},{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8286014862219001},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt.txt","score":0.82507608178487},{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text. Semantic search is all you need!","parent":"posts/What is Nomad Hypertext.txt","score":0.8244515437960355},{"content":"The app is free and open source. Notes are stored as plain text files, which means you are free to use tools like git to sync them across multiple devices, and free to port your notes over to other apps if you wish.","parent":"posts/What is Nomad Hypertext.txt","score":0.8229781287130151},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search \nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.8171806181110879},{"content":"I think eventually, I might want to deploy a blog with a full fledged backend, so users can query anything they'd like to my blog.","parent":"posts/What is Yurt.txt","score":0.8124904819875103},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.8052637922392895}],"The auteur believes otherwise. Language, he says, cannot communicate an idea without botching it. And if communicating an idea were not bad enough, mediating between multiple ideas using as flawed a tool as language is immeasurably worse. ":[{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search \nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.8134208474348356},{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8097761691495304},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8022753826472415}],"// Reflections and originals":[],"The assumption behind every collaborative creative endeavor is that language can capture ideas, and that language can mediate between ideas. Those who believe creative collaboration is possible believe that multiple creatives can enter the same room, use language to successfully communicate their ideas, use language to successfully mediate between their ideas, and use language to combine their ideas into a worthwhile final product. ":[{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8351041771974861}],"There is a short story by [[Borges]], about an author who realizes on his deathbed that the words used to describe a rose are not a mere reflection of an object, but an object in their own right.":[{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search \nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.8022766514954238}],"\"Marino saw the rose, as Adam had seen it in Paradise, and he realized that it lay within its own eternity, not within his words, and that we might speak about the rose, allude to it, but never truly express it, and that the tall haughty volumes that made a golden dimness in the corner of his room were not (as his vanity had dreamed them) a mirror of the world, but just another thing added to the world's contents.\"":[],"The auteur believes something similar about ideas. A description of an idea is never the idea itself, it is a second rate copy of an original - another thing added to the world's contents. Preferring not to clutter the world with such refuse, he becomes reclusive, reluctant to even speak of what he wishes to create. The result is either pure creativity untarnished by the translation of ideas into words, or something tantamount to the work of a madman - full of meaning to its creator but incomprehensible and useless to everyone else.":[{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8087881740922005},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search \nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.8019966883174156},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8006632874122922}],"Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all. ":[{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8154779806287151},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8096412229420169},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search \nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.8056044393681434}]}