{"I made exegesis because I cannot organize. I struggle to organize my thoughts, I struggle to organize my belongings, I struggle to organize my priorities, I struggle to organize my life. Since Kindergarten, well meaning teachers have tried to help me stay organized to no avail; I have vivid memories of my 6th grade homeroom teacher holding me back during recess to help me organize my binder and desk, which were a mess of loose papers I had haphazardly shoved in. A failure to stay organized has been the proverbial monkey on my back for much of my life.":[{"content":"I made exegesis because I cannot organize. I struggle to organize my thoughts, I struggle to organize my belongings, I struggle to organize my priorities, I struggle to organize my life. Since Kindergarten, well meaning teachers have tried to help me stay organized to no avail; I have vivid memories of my 6th grade homeroom teacher holding me back during recess to help me organize my binder and desk, which were a mess of loose papers I had haphazardly shoved in. A failure to stay organized has been the proverbial monkey on my back for much of my life.","parent":"posts/Why I made exegesis.txt","score":1},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8958137286912269},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8855448357103386},{"content":"In some sense exegesis gave birth to itself, because I used it to organize my ideas about exegesis. On days where exegesis was not working because I had broken something while coding it, I noticed that I could not think as clearly. Its absence was felt.","parent":"posts/Second Brains.txt","score":0.8771861933307736},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.8714845693897927},{"content":"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.","parent":"posts/Reflections for the New Year.txt","score":0.8663342259900857},{"content":"Working on exegesis was a grueling affair at times. I rewrote the schema multiple times, rewrote the backend from scratch 2 months before release, chased countless UI bugs, and manually patched abandoned NPM packages. Part of it may have been due to my inexperience, but [working with ](https://nichwch.medium.com/making-yana-e3fade3f56e7)[rich text](https://medium.engineering/why-contenteditable-is-terrible-122d8a40e480) is just a [difficult task](https://twitter.com/thesephist/status/1360298464349999108), period. At one point, I considered giving up after finding a rival writing app I thought I simply couldn't compete with - I have a copy of an unfinished essay I started writing on why I had given up tucked away somewhere.","parent":"posts/Prometheus.txt","score":0.8653858790564043},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8643263844094358},{"content":"Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8636129564566166},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.862376268474714},{"content":"What do I use [[exegesis]] for? I use it like a journal. I write down thoughts about my life, ideas that I have, things that I'd like to do, reflections on my day, etc. etc. None of these things could be called knowledge, none of them could be called rational.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8620688419526039},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter.txt","score":0.8614182259508876},{"content":"Finally, I want to take my studies more seriously. Next quarter, I am taking upper division classes on statistics for CS, databases, and information interfaces. I am especially excited about the database class, since database design problems were a big part of what I struggled with while building exegesis. I am also excited about the information interfaces class - exegesis is really just one giant information interface, isn't it? I cannot say I am excited about the stats class, I have never been fond of or good at math, but I will try to brave it with a stiff upper lip. I am considering posting my notes for these classes on [[exegesis]], so I can share them with classmates.","parent":"posts/Reflections for the New Year.txt","score":0.8609211974115515},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8602463061339862},{"content":"If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8585956852726251},{"content":"exegesis has taken about a year to make. Including the development of its predecessor, YANA, it's taken about a year and a half. When I started making YANA the summer after my freshman year, I thought it'd be a small project; just a little utility for me to track my thoughts. I had no idea it'd balloon into such a large endeavor.","parent":"posts/Reflections on exegesis.txt","score":0.8556127708124418},{"content":"If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.","parent":"posts/Second Brains.txt","score":0.8555986754415934},{"content":"The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well.","parent":"posts/Goals for Spring Quarter.txt","score":0.8552505359425903},{"content":"The world cannot be distilled into neat, concrete categories. Neither can your thoughts. Isn't it time your notes got a little messier?","parent":"posts/Manifesto.txt","score":0.8539033060634689},{"content":"In other words, I don't use [[exegesis]] as a PKM at all, because very little of what I write in exegesis could be considered \"knowledge.\" I don't use it as a memory aide either, because when I'm learning something I almost never take notes. Instead, it's a way for me to form connections between ideas and reflections that I have. It's a tool for creative thought.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8529491071270603}],"As I grew older, I tried to fix myself in various ways. I tried blocking out all of my time in a calendar. I tried blocking distracting websites. I tried living my life in a three-ring binder. I tried planners, I tried meditation, I tried todo lists, I tried kanban boards. I tried to not care, I tried caring too much. ":[{"content":"As I grew older, I tried to fix myself in various ways. I tried blocking out all of my time in a calendar. I tried blocking distracting websites. I tried living my life in a three-ring binder. I tried planners, I tried meditation, I tried todo lists, I tried kanban boards. I tried to not care, I tried caring too much.","parent":"posts/Why I made exegesis.txt","score":1.0000000000000002},{"content":"I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.","parent":"posts/Fragments.txt","score":0.8602551833352684},{"content":"There was a problem with both of these outlets, however: my short attention span. I struggled to work on larger drawings, because I'd give up on them and start new doodles. The same happened with code projects.","parent":"posts/Fragments.txt","score":0.8545770914393469},{"content":"I think it's important to have free time to just mess around and be bored, and explore dumb things that might turn out to be not so dumb - after all, \"boredom is that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Every activity I eventually took seriously - Model UN in high school, programming in college - started out as an casual hobby I never planned to take seriously. So, I'd rather have slow progress towards my goals and a sizeable chunk of time to mess around, than to fill my days to the point where I have no time to explore at all.","parent":"posts/Goals for Spring Quarter.txt","score":0.8493999450240084},{"content":"These are my hobbies that I use to take a break from code related creative-work.","parent":"posts/Goals for Spring Quarter.txt","score":0.8440633277604813},{"content":"I made exegesis because I cannot organize. I struggle to organize my thoughts, I struggle to organize my belongings, I struggle to organize my priorities, I struggle to organize my life. Since Kindergarten, well meaning teachers have tried to help me stay organized to no avail; I have vivid memories of my 6th grade homeroom teacher holding me back during recess to help me organize my binder and desk, which were a mess of loose papers I had haphazardly shoved in. A failure to stay organized has been the proverbial monkey on my back for much of my life.","parent":"posts/Why I made exegesis.txt","score":0.8435739350663679},{"content":"This project, too, has had a large effect on me - you can't work on something for a year and not have it affect you. I started this project sitting in a coffee shop; now I haven't sat in one for months. I know this sounds like navel gazing, but I've worked on this project through a pandemic, civil unrest, and statewide wildfires. Now it's finished, and I almost feel a little bittersweet releasing it.","parent":"posts/Reflections on exegesis.txt","score":0.8418370605393738},{"content":"In a tantalizingly dialectical fashion, this phenomenon contains its own contradiction - on the very apps that have engineered the collapse of your attention span, you scroll past countless posts on social media addiction, hacks to improve your attention span, dopamine fasts, meditation routines, and even posts urging you to delete the apps on which they are hosted. But these hacks are nothing more than empty promises. The truth is that the world has changed, and you with it. There is no going back to the world where information was scarcer than attention.","parent":"posts/Manifesto.txt","score":0.8404740649641393},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8324370298757998},{"content":"This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year.","parent":"posts/Reflections for the New Year.txt","score":0.8323977781166304},{"content":"None of it worked. Why? It's not that these tools don't work in general - plenty of people swear by them. The problem was either with the tools, or with me. Technology exists for the utility of the user, not the other way around, so I rejected the latter answer.","parent":"posts/Why I made exegesis.txt","score":0.8323759908340056},{"content":"In my teen years, I found programming and videogame development, and that became my creative outlet for a while. I found a way to scan my drawings into digital files, and for a while that was my way of combining art and programming.","parent":"posts/Fragments.txt","score":0.8296201816612556},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8293120741076062},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.8289156978353556},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8284735076964332},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8282496757193604},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.827006427992457},{"content":"I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.","parent":"posts/Fragments.txt","score":0.8269118301435286},{"content":"I did not do a braindump yesterday, the words did not flow easily. Best not to force these things. [[journal]]","parent":"posts/untitled-9-24-2021.txt","score":0.8263566646145666},{"content":"Growing up, my main creative outlet was drawing. As soon as a pencil or pen touched my hand I would have to draw something - it was almost involuntary. Many school notebooks were ruined this way, many concerned teachers advised me to keep my homework free of doodles.","parent":"posts/Fragments.txt","score":0.8252047551162698}],"":[{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8593290080388},{"content":"The club does 2 things.","parent":"posts/untitled-9-24-2021.txt","score":0.8589669169415844},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8577220980911441},{"content":"Code:","parent":"posts/Goals for Spring Quarter.txt","score":0.856649564390397},{"content":"Executing","parent":"posts/Goals for Spring Quarter.txt","score":0.8556654491388678},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter.txt","score":0.8537043599402795},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8499151373626692},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter.txt","score":0.8497861585687644},{"content":"Learn a grappling art (because of quarantine, this will just be maintaining general fitness levels for now)","parent":"posts/Goals for Spring Quarter.txt","score":0.8496945903933114},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter.txt","score":0.8478182318510581},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8472546071060495},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8467379006001533},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8456538970968254},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8455300536527719},{"content":"I'm taking a gap quarter this Spring to work on some personal projects. It is always better to have a plan than to have no plan, even if things don't work out your way, so here are some tentative goals for my gap quarter.","parent":"posts/Goals for Spring Quarter.txt","score":0.8451682294721505},{"content":"Writing cascades","parent":"posts/untitled-10-1-2021.txt","score":0.8444322593169847},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8437967333727141},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.8436725970663741},{"content":"Sitting in the MU again, this time with a view of the quad. Listening to \"The Time of the Season\" by the Zombies.","parent":"posts/untitled-9-24-2021.txt","score":0.8434310607466774},{"content":"Visual developer tools","parent":"posts/untitled-9-24-2021.txt","score":0.8428686770659811}],"None of it worked, because the word disorganized is really just an epithet for nonlinear. ":[{"content":"None of it worked, because the word disorganized is really just an epithet for nonlinear.","parent":"posts/Why I made exegesis.txt","score":1.0000000000000002},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8783414387073449},{"content":"What is disorganized/nonlinear thinking? It can be best understood in contrast to \"organized\" thinking, and this contrast can be best illustrated in the difference between the structure of a traditional nonfiction book and the idea of hypertext, which the internet is built around.","parent":"posts/Why I made exegesis.txt","score":0.8759761817010178},{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis.txt","score":0.867765491475899},{"content":"Nonlinearity's bad conscience","parent":"posts/Why I made exegesis.txt","score":0.8619885560116511},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8476093990945927},{"content":"I did not do a braindump yesterday, the words did not flow easily. Best not to force these things. [[journal]]","parent":"posts/untitled-9-24-2021.txt","score":0.8446243916334641},{"content":"None of it worked. Why? It's not that these tools don't work in general - plenty of people swear by them. The problem was either with the tools, or with me. Technology exists for the utility of the user, not the other way around, so I rejected the latter answer.","parent":"posts/Why I made exegesis.txt","score":0.841640844300193},{"content":"If minimalism is the tendency to subtract, then it is the reason for subtracting that makes all the difference.","parent":"posts/Minimalism.txt","score":0.8392122027730381},{"content":"The world cannot be distilled into neat, concrete categories. Neither can your thoughts. Isn't it time your notes got a little messier?","parent":"posts/Manifesto.txt","score":0.837637332040896},{"content":"I made exegesis because I cannot organize. I struggle to organize my thoughts, I struggle to organize my belongings, I struggle to organize my priorities, I struggle to organize my life. Since Kindergarten, well meaning teachers have tried to help me stay organized to no avail; I have vivid memories of my 6th grade homeroom teacher holding me back during recess to help me organize my binder and desk, which were a mess of loose papers I had haphazardly shoved in. A failure to stay organized has been the proverbial monkey on my back for much of my life.","parent":"posts/Why I made exegesis.txt","score":0.8370014506093163},{"content":"Right now I'm listening to [Something About Us by Daft Punk](https://open.spotify.com/track/1NeLwFETswx8Fzxl2AFl91?si=bc9f206d498e4fdd), which might have something to do with how I'm feeling. What if words aren't enough to express a certain feeling? What if it's only the conjunction of words, images, videos and music, combined not in a determinate order like a moving picture or video, but presented indeterminately, in some form resembling a moodboard? That's the thesis behind [[synesthesia]] (a project I'm working on that will be closely integrated with [[exegesis]]).","parent":"posts/untitled-9-30-2021.txt","score":0.8329728326221639},{"content":"Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all.","parent":"posts/On auteurs and language.txt","score":0.8313507261692202},{"content":"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.","parent":"posts/Plaintext is your best friend.txt","score":0.830366813229871},{"content":"The auteur believes otherwise. Language, he says, cannot communicate an idea without botching it. And if communicating an idea were not bad enough, mediating between multiple ideas using as flawed a tool as language is immeasurably worse.","parent":"posts/On auteurs and language.txt","score":0.8278715625034364},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8274296719533417},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8270259511886673},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8266820623596006},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8250538298247369},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8250280708355892}],"None of it worked. Why? It's not that these tools don't work in general - plenty of people swear by them. The problem was either with the tools, or with me. Technology exists for the utility of the user, not the other way around, so I rejected the latter answer. ":[{"content":"None of it worked. Why? It's not that these tools don't work in general - plenty of people swear by them. The problem was either with the tools, or with me. Technology exists for the utility of the user, not the other way around, so I rejected the latter answer.","parent":"posts/Why I made exegesis.txt","score":1},{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8527609507965265},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8479689961085868},{"content":"I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8471680741871559},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8469104521981823},{"content":"Creative tools vs rational tools","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8436937548082685},{"content":"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data.","parent":"posts/Controlling what you see.txt","score":0.8422280595796258},{"content":"None of it worked, because the word disorganized is really just an epithet for nonlinear.","parent":"posts/Why I made exegesis.txt","score":0.841640844300193},{"content":"The fact that most people interact with computers through web and mobile was not some foregone conclusion. It took serious effort and ingenuity from really smart people to make these platforms accessible to regular people. Once upon a time, filesystems and personal computers were the dominant paradigm of computing, and it was web and mobile that were strange, inaccessible pipe dreams. Increasingly, the opposite is the case.","parent":"posts/The AI-first operating system of the future.txt","score":0.8408890948437698},{"content":"There is at least one creative medium for which this is not true, however, and that is programming. Here is a unique and strange property of programming: Making tools to program better itself involves programming. This is not true for music or art - the process of making a guitar is not the art of playing the guitar, the process of making paints is not the art of painting, and while luthiers and paint-makers are certainly artists in their own right (and are often good at playing the guitar and painting, respectively), they practice an art that is distinct from the art that they enable.","parent":"posts/Prometheus.txt","score":0.8405412736874106},{"content":"Visual developer tools","parent":"posts/untitled-9-24-2021.txt","score":0.8388646426720425},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8374387818839353},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots.txt","score":0.8372536774875493},{"content":"The counter argument here is that people don't want to use files, and they don't want to manage their own systems. I don't think this is a forgone conclusion. Think about how much effort has been poured into making new technologies like touchscreens and AI legible to ordinary people.","parent":"posts/The AI-first operating system of the future.txt","score":0.8363133083319378},{"content":"Electron really, really, really sucks. For starters, you have to use CommonJS. That itself would be bad enough, but there are a huge pile of other inconveniences that Electron dumps on you: Using window.prompt() doesn't work (because it blocks the main thread apparently) and it generates HUGE executables without making the slightest effort to tree-shake anything (it was literally bundling in sample text files I was using in the repo). Creating my own window.prompt() alternative was an interesting exercise, but I wish I wasn't forced into doing it.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8362453258126036},{"content":"Tools for creative thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8353293467717249},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8331621078797956},{"content":"There was a problem with both of these outlets, however: my short attention span. I struggled to work on larger drawings, because I'd give up on them and start new doodles. The same happened with code projects.","parent":"posts/Fragments.txt","score":0.8331507775407606},{"content":"This was reassuring, because it meant I had made something genuinely useful. In the past, I have made things I simply had no desire to use - one example is [JAFT](https://nichwch.medium.com/what-is-jaft-f543a4fad9d7), a time tracking app I made after making YANA (the predecessor to exegesis). I stopped using it after a bit, and didn't bother renewing the domain. I don't miss JAFT at all. The fact that I did miss exegesis on the days where it wasn't operational was a good sign.","parent":"posts/Second Brains.txt","score":0.8329790174764871},{"content":"This is not the case for programming. Making better tools for programming (new languages, new frameworks, new libraries) itself requires programming, and while making programming tools is different in important respects from writing regular programs, it is still programming. Making guitars is not playing guitars, making paints is not painting, but making better programming tools is programming. Programming, then, is an, intrinsically recursive creative medium.","parent":"posts/Prometheus.txt","score":0.8329462311770179}],"Nonlinearity's bad conscience":[{"content":"Nonlinearity's bad conscience","parent":"posts/Why I made exegesis.txt","score":1},{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis.txt","score":0.8659279988406355},{"content":"None of it worked, because the word disorganized is really just an epithet for nonlinear.","parent":"posts/Why I made exegesis.txt","score":0.8619885560116511},{"content":"I'm convinced that algorithmic feeds are poisonous. Algorithmic feeds in apps are like cocaine in old medicines or asbestos in buildings, and someday they'll be seen to be just as barbaric.","parent":"posts/Controlling what you see.txt","score":0.8365401636565934},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8277427809473814},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8234365444444506},{"content":"On some level the underlying psychological drive behind bad minimalism is similar to the one of a slacking but intelligent student - the slacker thinks, \"I only studied 30 minutes and still got a C plus\" because he is scared of trying hard and still getting an unsatisfactory grade, the bad minimalist thinks, \"I only used flat designs to make my product and it looks presentable\" because he is scared that if he tries to make something beautiful he'll be ridiculed for it. It is an ego protection mechanism.","parent":"posts/Minimalism.txt","score":0.8234323972486586},{"content":"Bad minimalism, on the other hand, shows a lack of direction and conviction. Take Google's icon redesigns. Not only are they significantly worse from a visibility standpoint, but they also express a confused and weak sense of direction, which is ostensibly to create a coherent \"brand image\" by making all the icons look really similar. But what is this \"brand image?\" Nothing, it's as empty as Google's mission, which slipped over the course of two decades from \"Don't be evil\" to its current sad, formless state. Generally speaking, cookie-cutter minimalism is ugly. Sometimes it is the pragmatic choice, for example, if you're building a minimum viable product and don't want to worry about design yet, but the fact that it is the least ugly choice doesn't change the fact that it's still ugly.","parent":"posts/Minimalism.txt","score":0.8221595100512405},{"content":"I did not do a braindump yesterday, the words did not flow easily. Best not to force these things. [[journal]]","parent":"posts/untitled-9-24-2021.txt","score":0.8219031741969522},{"content":"Good vs Bad minimalism","parent":"posts/Minimalism.txt","score":0.8218362145357829},{"content":"But this is something forbidden to mortal men. We face a kind of creative asymmetry - to bring beauty into the world, it is neccessary to confront ugliness. Creating beautiful, original music requires endless, stupid, and frustrating scale practice, finger exercises, and theory study; behind the sublime beauty of a master's painting lies hours of practice filling sketchbooks with mind numbing still lifes and ugly anatomical mistakes. On the one hand, it seems paradoxical that beauty, freedom and originality require ugliness, servitude, and repetition. On the other hand, it is almost coldly rational - perhaps there is a kind of aesthetic entropy at play, like there's a set amount of beauty in the universe, and to \"produce\" any more of it, you first have to take on ugliness as a burden.[[music]] [[aesthetics]] [[art]]","parent":"posts/Prometheus.txt","score":0.8211163030101356},{"content":"If minimalism is the tendency to subtract, then it is the reason for subtracting that makes all the difference.","parent":"posts/Minimalism.txt","score":0.8203402996189092},{"content":"There are few feelings worse than wanting desperately to make something, and feeling as if you do not have the capability to make it.","parent":"posts/untitled-9-22-2021.txt","score":0.8201171448379247},{"content":"It's like an excess of rationality always ends eating itself. Those who take rationality serious enough end up directing rational criticism at rationality itself - a dynamic similar to what [[Nietzsche]] thought had happened to Christianity (that Christianity bore the value of truth-seeking, which ended up being turned against it).","parent":"posts/untitled-9-21-2021.txt","score":0.8197240710298924},{"content":"[[mark-fischer]] argues that capitalism creates boring products because it leads to companies giving people what they want, when really \"the most powerful forms of desire are precisely cravings for the strange, the unexpected, the weird. These can only be supplied by artists and media professionals who are prepared to give people something different from that which already satisfies them... to wager on the strange and our appetite for it. It is another irony that capitalism's society of risk is much less likely to take this kind of risk than was the supposedly stodgy, centralized culture of the postwar social consensus.\" He goes on to argue that some \"innovations are unthinkable now that the public has been displaced by the consumer.\"  [[quotes]] [[Capitalist-Realism]] [[aesthetics]] [[exegesis]]","parent":"posts/untitled-9-20-2021.txt","score":0.8181181965881559},{"content":"This raises the question: what is good minimalism, and what is bad minimalism? My tentative answer is this: Good minimalism is the use of absence to convey richness and detail; bad minimalism is the self-effacing tendency of aesthetic cowardice.","parent":"posts/Minimalism.txt","score":0.8180684239603753},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.8168893791508064},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8166422666730688},{"content":"Human beings can observe the conclusions that social science reach and modify their behavior, which can potentially render those conclusions invalid. This is a complete impossibility in the natural sciences - an atom cannot learn about atomic theories and change its behavior to invalidate those theories.","parent":"posts/untitled-10-11-2021.txt","score":0.8147890938818474},{"content":"This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"","parent":"posts/Second Brains.txt","score":0.8146448325187743}],"On the other hand, hypertext is built around the idea of a hyperlink, which is just a link from one document to another. Think about Wikipedia, and how every page is rich with links and connections to other pages. It is incoherent to talk about reading Wikipedia \"from start to end.\" Books create linear paths from A to B, hypertext creates entire worlds ripe for exploration.":[{"content":"On the other hand, hypertext is built around the idea of a hyperlink, which is just a link from one document to another. Think about Wikipedia, and how every page is rich with links and connections to other pages. It is incoherent to talk about reading Wikipedia \"from start to end.\" Books create linear paths from A to B, hypertext creates entire worlds ripe for exploration.","parent":"posts/Why I made exegesis.txt","score":1},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.8941398360736161},{"content":"What is disorganized/nonlinear thinking? It can be best understood in contrast to \"organized\" thinking, and this contrast can be best illustrated in the difference between the structure of a traditional nonfiction book and the idea of hypertext, which the internet is built around.","parent":"posts/Why I made exegesis.txt","score":0.8742560660693761},{"content":"The way Napoleon understood the grammar of gunpowder and de Tocqueville understood the grammar of print and typography, I would like to master the grammar of hypertext.","parent":"posts/Fragments.txt","score":0.8527655007646815},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.8478947360737923},{"content":"We are all familiar with the structure of a traditional nonfiction book - it is organized into chapters, separated topically, and each of those chapters consists of smaller subsections, each composed of paragraphs that introduce ideas in a linear and logical fashion. You read a book from start to end.","parent":"posts/Why I made exegesis.txt","score":0.8459221004883626},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8428274654907675},{"content":"Yurt is a static site generator, built off the same principles as Nomad Hypertext.","parent":"posts/What is Yurt.txt","score":0.8377373573351871},{"content":"1. The current wave of backlink-focused apps have a compelling response to this objection, which is that they're not focused on just copying information, they're focused on capturing the connections between ideas. Fair enough. But why require the end user to manually copy information down? It seems that this could be done more effectively through an annotation layer.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8367263159567165},{"content":"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links.","parent":"posts/Plaintext is your best friend.txt","score":0.836685228118287},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8355186379424284},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.833587660763091},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt.txt","score":0.8310660652460613},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8302906643878909},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8276484685035732},{"content":"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.","parent":"posts/Plaintext is your best friend.txt","score":0.8242283652450061},{"content":"Did the internet ruin my brain? No, I don't think either style of thinking is superior. Both have their place, and besides it's not like I'm incapable of linear thinking (I hope this essay is flowing in a somewhat logical manner!","parent":"posts/Why I made exegesis.txt","score":0.8239641327446358},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.8236252582982282},{"content":"Front end development should be way more visual. A great deal of front-end development pain points cannot be fixed with fancier libraries and languages, because the fundamental mismatch is trying to create something visual with a text-based tool.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8228411584776986},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8222333422218084}],"We are all familiar with the structure of a traditional nonfiction book - it is organized into chapters, separated topically, and each of those chapters consists of smaller subsections, each composed of paragraphs that introduce ideas in a linear and logical fashion. You read a book from start to end.":[{"content":"We are all familiar with the structure of a traditional nonfiction book - it is organized into chapters, separated topically, and each of those chapters consists of smaller subsections, each composed of paragraphs that introduce ideas in a linear and logical fashion. You read a book from start to end.","parent":"posts/Why I made exegesis.txt","score":1},{"content":"What is disorganized/nonlinear thinking? It can be best understood in contrast to \"organized\" thinking, and this contrast can be best illustrated in the difference between the structure of a traditional nonfiction book and the idea of hypertext, which the internet is built around.","parent":"posts/Why I made exegesis.txt","score":0.8775225792320975},{"content":"On the other hand, hypertext is built around the idea of a hyperlink, which is just a link from one document to another. Think about Wikipedia, and how every page is rich with links and connections to other pages. It is incoherent to talk about reading Wikipedia \"from start to end.\" Books create linear paths from A to B, hypertext creates entire worlds ripe for exploration.","parent":"posts/Why I made exegesis.txt","score":0.8459221004883626},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8410522047670536},{"content":"My aim in reading [[philosophy]] is more for general intellectual enrichment and to provide insights into my work, not philosophy for its own sake, so I feel fine with reading summaries as opposed to heavy primary literature (except where the primary literature interests me). For thinkers who are influential that don't interest me very much (like Kant), I've found summaries from the very short series and the Stanford Encyclopedia of Philosophy to be very helpful.","parent":"posts/untitled-9-21-2021.txt","score":0.8409835405980173},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.835847332492322},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.8340729110700776},{"content":"Yesterday I picked up a copy of [[Habermas]], a very short introduction at a used bookstore, because I recognized the name and it was $2.50 (my bookshelf is littered with books I purchased for similar reasons). The last book I read in the series was the very short introduction to Kant by Roger Scruton, which I enjoyed thoroughly.","parent":"posts/untitled-9-21-2021.txt","score":0.8302541910996675},{"content":"I want to read more. I started reading a lot more in quarantine, but slowed down towards the end of 2020 because I was spending a lot more time on [[exegesis]]. Now that I have more time, I want to start a steady reading habit. The particular corner of [[twitter]] I hang around is fond of citing various philosophers and ideas, many of which I'm interested in, but have never taken the time to study closely. This year, I want to dig deeper into these ideas, go beyond surface-level Twitter philosophy memes and Youtube philosophy videos and read some proper primary sources. Around this time last year, I read Roger Scruton's A very short introduction to Kant. I want to tackle the Critique of Pure Reason sometime this year. I may live-blog my notes on exegesis (though I can't guarantee they'll be very good).","parent":"posts/Reflections for the New Year.txt","score":0.8206597347668443},{"content":"Read more (both fiction and non-fiction)","parent":"posts/Goals for Spring Quarter.txt","score":0.8204625245720027},{"content":"For reading, I read whatever I want, whenever I want. I do think setting a goal of reading at least 5 times a week wouldn't hurt, however.","parent":"posts/Goals for Spring Quarter.txt","score":0.8184151153556152},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8183310447184362},{"content":"People take notes to remember. The goal is to write down information, delivered in some lossy format like a lecture, video, or a book, and crystallize the main points in writing so you can access them later. The goal is a rational one, focused on knowledge.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8175109186830766},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8159074086817071},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.8159055893542014},{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis.txt","score":0.8110524614589661},{"content":"Writing cascades","parent":"posts/untitled-10-1-2021.txt","score":0.8106788867727991},{"content":"I made exegesis because I cannot organize. I struggle to organize my thoughts, I struggle to organize my belongings, I struggle to organize my priorities, I struggle to organize my life. Since Kindergarten, well meaning teachers have tried to help me stay organized to no avail; I have vivid memories of my 6th grade homeroom teacher holding me back during recess to help me organize my binder and desk, which were a mess of loose papers I had haphazardly shoved in. A failure to stay organized has been the proverbial monkey on my back for much of my life.","parent":"posts/Why I made exegesis.txt","score":0.808966905177411},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8069599060387408},{"content":"So far I've only read the introduction, but Habermas' work seems heavily related to [[mark-fischer]]'s - specifically, when Fischer talks about the lack of a public subject at the end of [[Capitalist-Realism]]. The book talks about Habermas' early work as addressing the emergence and decline of a \"public sphere\" in modern Europe, and how he broke from other Critical Theorists because he believed that the idea of a public sphere, while still ideological, could serve genuinely emancipatory ends.","parent":"posts/untitled-9-21-2021.txt","score":0.8061113945802216}],"What is disorganized/nonlinear thinking? It can be best understood in contrast to \"organized\" thinking, and this contrast can be best illustrated in the difference between the structure of a traditional nonfiction book and the idea of hypertext, which the internet is built around. ":[{"content":"What is disorganized/nonlinear thinking? It can be best understood in contrast to \"organized\" thinking, and this contrast can be best illustrated in the difference between the structure of a traditional nonfiction book and the idea of hypertext, which the internet is built around.","parent":"posts/Why I made exegesis.txt","score":1},{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis.txt","score":0.879842530710028},{"content":"We are all familiar with the structure of a traditional nonfiction book - it is organized into chapters, separated topically, and each of those chapters consists of smaller subsections, each composed of paragraphs that introduce ideas in a linear and logical fashion. You read a book from start to end.","parent":"posts/Why I made exegesis.txt","score":0.8775225792320975},{"content":"Did the internet ruin my brain? No, I don't think either style of thinking is superior. Both have their place, and besides it's not like I'm incapable of linear thinking (I hope this essay is flowing in a somewhat logical manner!","parent":"posts/Why I made exegesis.txt","score":0.8763858461101279},{"content":"None of it worked, because the word disorganized is really just an epithet for nonlinear.","parent":"posts/Why I made exegesis.txt","score":0.8759761817010178},{"content":"On the other hand, hypertext is built around the idea of a hyperlink, which is just a link from one document to another. Think about Wikipedia, and how every page is rich with links and connections to other pages. It is incoherent to talk about reading Wikipedia \"from start to end.\" Books create linear paths from A to B, hypertext creates entire worlds ripe for exploration.","parent":"posts/Why I made exegesis.txt","score":0.8742560660693761},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.862213778010297},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8610987583943011},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8570886877200089},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8491866875412418},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8481369625423172},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8462347793518324},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8411158778917565},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.839129820862724},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8364928074415091},{"content":"As I looked further into these tools, I found that some had taken to calling them [Second Brains](https://fortelabs.co/blog/basboverview/). I thought this was incredibly exciting. The term sounds cyberpunk; building a \"second brain\" sounds way cooler than building a \"note taking app.\" At the same time, something about it unsettled me.","parent":"posts/Second Brains.txt","score":0.8358525829622955},{"content":"The world cannot be distilled into neat, concrete categories. Neither can your thoughts. Isn't it time your notes got a little messier?","parent":"posts/Manifesto.txt","score":0.8346328981706578},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8328182163984544},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.8313216784237996},{"content":"Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all.","parent":"posts/On auteurs and language.txt","score":0.8308850794107369}],"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.":[{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":1},{"content":"On the other hand, hypertext is built around the idea of a hyperlink, which is just a link from one document to another. Think about Wikipedia, and how every page is rich with links and connections to other pages. It is incoherent to talk about reading Wikipedia \"from start to end.\" Books create linear paths from A to B, hypertext creates entire worlds ripe for exploration.","parent":"posts/Why I made exegesis.txt","score":0.8941398360736161},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8715630480940243},{"content":"What is disorganized/nonlinear thinking? It can be best understood in contrast to \"organized\" thinking, and this contrast can be best illustrated in the difference between the structure of a traditional nonfiction book and the idea of hypertext, which the internet is built around.","parent":"posts/Why I made exegesis.txt","score":0.862213778010297},{"content":"My theory is that the current wave rational tools for thought (PKMs, note-taking apps, [[roam]], etc.) will be disrupted by AI-powered tools and search engines. Note taking has always felt futile to me, because the information age has made remembering/memorizing information useless - why memorize when you can look it up? 1","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8557657476940191},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8532476358680059},{"content":"I spend an inordinate amount of time on Youtube. Having noticed this one morning, I quietly told myself that I wouldn't check Youtube for the rest of the work session - only to find that I would unconsciously press \"Y+enter\" and let the address bar's autocomplete lead me to Youtube. I would find myself on the site, not remembering how I had gotten there. More importantly, the home page recommendations had learned my preferences incredibly well. As soon as I landed on Youtube, there would be at least one video there ready for me to watch. That morning, I got nothing done. Youtube's algorithm had figured out that I really liked watching short clips of Mad Men and provided me a steady drip-feed of them, which I gorged on instead of getting anything done.","parent":"posts/Controlling what you see.txt","score":0.8516730401579748},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8513156091789323},{"content":"As I looked further into these tools, I found that some had taken to calling them [Second Brains](https://fortelabs.co/blog/basboverview/). I thought this was incredibly exciting. The term sounds cyberpunk; building a \"second brain\" sounds way cooler than building a \"note taking app.\" At the same time, something about it unsettled me.","parent":"posts/Second Brains.txt","score":0.8478427997963128},{"content":"Did the internet ruin my brain? No, I don't think either style of thinking is superior. Both have their place, and besides it's not like I'm incapable of linear thinking (I hope this essay is flowing in a somewhat logical manner!","parent":"posts/Why I made exegesis.txt","score":0.8473878432113902},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8450321821435993},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8442083192142255},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots.txt","score":0.8425492446392757},{"content":"But the feed has replaced the book as society's primary medium of information. Content flows in a stream, in no particular order, organized according to no specific topic - scrolling down some app, one may be confronted with content regarding math, science, politics, humor, or entertainment in any order. With or without our consent, our minds have been soldered to the system, programmed by all-powerful recommendation algorithms to swallow ever-increasing quantities of information.","parent":"posts/Manifesto.txt","score":0.8422244229995177},{"content":"Yesterday I had an idea for a club, and I've decided to start it. It will be called the [[Davis Hypertext Society]].","parent":"posts/untitled-9-24-2021.txt","score":0.842084541288138},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8416354271585705},{"content":"The way Napoleon understood the grammar of gunpowder and de Tocqueville understood the grammar of print and typography, I would like to master the grammar of hypertext.","parent":"posts/Fragments.txt","score":0.8394487458945011},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8378620281018688},{"content":"I don't think it's possible to fix our information ecosystem. In fact, I don't even know if it'd be desirable to fix it - as perverse as it is, there is also a chaotically beautiful side to the internet.","parent":"posts/Giant Robots.txt","score":0.8370912078454825},{"content":"In the physical world, you can pass things down through the generations - a leather jacket your father owned, a relic couch from your grandparents, your uncle's vintage 1960s Stratocaster, etc. etc. These objects carry their history with them; they are imbued with the spirit of their past owners and their experiences.","parent":"posts/Generational Computing.txt","score":0.8370603645319358}],"A thousand suns":[{"content":"A thousand suns","parent":"posts/Why I made exegesis.txt","score":1},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.8255299519729962},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8152423140210244},{"content":"\"Marino saw the rose, as Adam had seen it in Paradise, and he realized that it lay within its own eternity, not within his words, and that we might speak about the rose, allude to it, but never truly express it, and that the tall haughty volumes that made a golden dimness in the corner of his room were not (as his vanity had dreamed them) a mirror of the world, but just another thing added to the world's contents.\"","parent":"posts/On auteurs and language.txt","score":0.8007751394253375}],"Did the internet ruin my brain? No, I don't think either style of thinking is superior. Both have their place, and besides it's not like I'm incapable of linear thinking (I hope this essay is flowing in a somewhat logical manner!":[{"content":"Did the internet ruin my brain? No, I don't think either style of thinking is superior. Both have their place, and besides it's not like I'm incapable of linear thinking (I hope this essay is flowing in a somewhat logical manner!","parent":"posts/Why I made exegesis.txt","score":1.0000000000000002},{"content":"What is disorganized/nonlinear thinking? It can be best understood in contrast to \"organized\" thinking, and this contrast can be best illustrated in the difference between the structure of a traditional nonfiction book and the idea of hypertext, which the internet is built around.","parent":"posts/Why I made exegesis.txt","score":0.8763858461101279},{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis.txt","score":0.8757699326954056},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8751601747822152},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8673314366695017},{"content":"2. My critique here is nothing original - it echoes a lot of what Andy [[Matuschak]] and [[Linus Lee]] have touched upon in their essays. Here's a brief excerpt from [Linus' blog post](https://thesephist.com/posts/browser/) that expresses the point more eloquently:","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8638431889248263},{"content":"As I looked further into these tools, I found that some had taken to calling them [Second Brains](https://fortelabs.co/blog/basboverview/). I thought this was incredibly exciting. The term sounds cyberpunk; building a \"second brain\" sounds way cooler than building a \"note taking app.\" At the same time, something about it unsettled me.","parent":"posts/Second Brains.txt","score":0.8543690248857134},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8536458839760466},{"content":"If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8490914287903792},{"content":"\"[Adam] Curtis attacks the internet because in his view it facilitates communities of solipsists, interpassive networks of like-minds who confirm, rather than challenge, each others' assumptions and prejudices.... Curtis' critique has a point, but it misses important dimensions of what is happening on the net. Contrary to Curtis' account of blogging, blogs can generate new discourse networks that have no correlate in the social field outside cyberspace.\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8475793611595268},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.8473878432113902},{"content":"Thinking as social","parent":"posts/untitled-9-24-2021.txt","score":0.8461778786995083},{"content":"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data.","parent":"posts/Controlling what you see.txt","score":0.845336662398504},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.843424522370708},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8426647547461321},{"content":"The auteur believes otherwise. Language, he says, cannot communicate an idea without botching it. And if communicating an idea were not bad enough, mediating between multiple ideas using as flawed a tool as language is immeasurably worse.","parent":"posts/On auteurs and language.txt","score":0.8418311624060226},{"content":"The shift from normal school (Society of Discipline) to online school (Society of Control) back to normal school (Society of Discipline) has vividly illustrated the difference between the two. Tentatively, I'd say I say I prefer in person.","parent":"posts/untitled-9-30-2021.txt","score":0.84048634810125},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots.txt","score":0.8400326044840468},{"content":"In writing this essay, I checked everything tagged \"exegesis\" and \"personal-reflection\" in exegesis. I didn't tag those thoughts for the purpose of writing this essay, they were written down spontaneously. That they have helped me write this essay is serendipitous.","parent":"posts/Second Brains.txt","score":0.8397325028867626},{"content":"There was a problem with both of these outlets, however: my short attention span. I struggled to work on larger drawings, because I'd give up on them and start new doodles. The same happened with code projects.","parent":"posts/Fragments.txt","score":0.8387843968800114}],"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.":[{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis.txt","score":0.9999999999999998},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8974209097629069},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8955487735799},{"content":"What is disorganized/nonlinear thinking? It can be best understood in contrast to \"organized\" thinking, and this contrast can be best illustrated in the difference between the structure of a traditional nonfiction book and the idea of hypertext, which the internet is built around.","parent":"posts/Why I made exegesis.txt","score":0.879842530710028},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8786187718096323},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8781297271946126},{"content":"Did the internet ruin my brain? No, I don't think either style of thinking is superior. Both have their place, and besides it's not like I'm incapable of linear thinking (I hope this essay is flowing in a somewhat logical manner!","parent":"posts/Why I made exegesis.txt","score":0.8757699326954056},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8756797223678305},{"content":"I fell into this kind of thinking while building exegesis, and it put an enormous amount of pressure on me, because it made me feel as if it wasn't just a notetaking app I was building, but a shrine for the mind. I would look at other notetaking systems like Roam Research and feel threatened - my notetaking app wasn't as powerful as theirs, therefore my mind would be weaker than theirs. Every little imperfection, every unimplemented feature, every bug felt sacrilegious - this was my second brain I was building after all. Needless to say, this led to a lot of feature creep, because my second brain had to be perfect.","parent":"posts/Second Brains.txt","score":0.8686906533247795},{"content":"Thinking as social","parent":"posts/untitled-9-24-2021.txt","score":0.868262738973883},{"content":"None of it worked, because the word disorganized is really just an epithet for nonlinear.","parent":"posts/Why I made exegesis.txt","score":0.867765491475899},{"content":"Nonlinearity's bad conscience","parent":"posts/Why I made exegesis.txt","score":0.8659279988406355},{"content":"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data.","parent":"posts/Controlling what you see.txt","score":0.8636418037884848},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.861479487681022},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.859730493010029},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8592067003486785},{"content":"Tools for creative thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8588978932193913},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.857894293754784},{"content":"The world cannot be distilled into neat, concrete categories. Neither can your thoughts. Isn't it time your notes got a little messier?","parent":"posts/Manifesto.txt","score":0.8565771302975115},{"content":"My theory is that the current wave rational tools for thought (PKMs, note-taking apps, [[roam]], etc.) will be disrupted by AI-powered tools and search engines. Note taking has always felt futile to me, because the information age has made remembering/memorizing information useless - why memorize when you can look it up? 1","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.850087003202573}],"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up. ":[{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":1.0000000000000002},{"content":"However, the world has been designed for the first kind of thinking. So far,  our institutions and our tools have been designed for linear thought, not non-linear thought - not necessarily out of malice, but because our tools for organizing information (books) were stuck being linear for so long. As a result of this, non-linear thinkers have developed a kind of bad conscience - we view disorganized thinking as a problem to remedy. We build tools to rid ourselves of nonlinear thinking, never to embrace it.","parent":"posts/Why I made exegesis.txt","score":0.8955487735799},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8832453457583835},{"content":"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data.","parent":"posts/Controlling what you see.txt","score":0.8812958105155758},{"content":"Did the internet ruin my brain? No, I don't think either style of thinking is superior. Both have their place, and besides it's not like I'm incapable of linear thinking (I hope this essay is flowing in a somewhat logical manner!","parent":"posts/Why I made exegesis.txt","score":0.8751601747822152},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.8715630480940243},{"content":"My theory is that the current wave rational tools for thought (PKMs, note-taking apps, [[roam]], etc.) will be disrupted by AI-powered tools and search engines. Note taking has always felt futile to me, because the information age has made remembering/memorizing information useless - why memorize when you can look it up? 1","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.870780335329678},{"content":"Tools for creative thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8678616844758856},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.866282015830884},{"content":"Thinking as social","parent":"posts/untitled-9-24-2021.txt","score":0.8651758799741247},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8645738511140137},{"content":"What is disorganized/nonlinear thinking? It can be best understood in contrast to \"organized\" thinking, and this contrast can be best illustrated in the difference between the structure of a traditional nonfiction book and the idea of hypertext, which the internet is built around.","parent":"posts/Why I made exegesis.txt","score":0.8610987583943011},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.8610504564814605},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.8597114937694239},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.858733111875438},{"content":"I want digital technology to bridge divides between generations instead of widening them. I want it to foster remembrance instead of forgetting. I want it to reward thinking multiple generations into the future instead of until the end of the quarter.","parent":"posts/Generational Computing.txt","score":0.8587102716891907},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.8567095444361519},{"content":"The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.","parent":"posts/Creating new kinds of people.txt","score":0.8552798902672715},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.8550030239335824},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8529972647639684}],"So too, there exists a tool for each person that would vindicate their peculiarities. It is my hope that exegesis will vindicate chaos, disorganization, messiness, disorder, and all other epithets hitherto applied to what is rightfully called creativity. ":[{"content":"So too, there exists a tool for each person that would vindicate their peculiarities. It is my hope that exegesis will vindicate chaos, disorganization, messiness, disorder, and all other epithets hitherto applied to what is rightfully called creativity.","parent":"posts/Why I made exegesis.txt","score":0.9999999999999999},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8965875161913304},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8858691922599984},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.8818389687144741},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter.txt","score":0.881067147985067},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8807616592600295},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.8796139932650032},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":0.8756593791911135},{"content":"exegesis as crm [[exegesis]] [[ideas]]","parent":"posts/untitled-9-20-2021.txt","score":0.8719303640121739},{"content":"Tools for creative thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8688326630349478},{"content":"What do I use [[exegesis]] for? I use it like a journal. I write down thoughts about my life, ideas that I have, things that I'd like to do, reflections on my day, etc. etc. None of these things could be called knowledge, none of them could be called rational.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8678911660122082},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.866549061409902},{"content":"My favorite use of [[exegesis]] is to write down ideas that I have. I write about exegesis in exegesis, and a lot of features that I've added to exegesis started as sudden thoughts that were captured in exegesis. In my experience, ideas are like seeds, and writing them down helps them grow. I might think nothing of a simple idea I capture one day, but a week later it might have renewed significance, and it could even spark new ideas.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8650449803953671},{"content":"In some sense exegesis gave birth to itself, because I used it to organize my ideas about exegesis. On days where exegesis was not working because I had broken something while coding it, I noticed that I could not think as clearly. Its absence was felt.","parent":"posts/Second Brains.txt","score":0.8648517875084253},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8639410549504613},{"content":"What is the point of exegesis then? The point is serendipity - it's a place for me to capture little scraps of thought - ideas, feelings, anything that comes to you at the moment.","parent":"posts/Second Brains.txt","score":0.8629792503791819},{"content":"Anyone doing creative work must carefully toe the line between two extremes: the collaborative extreme of butchering ideas by putting them into words, the auteur's extreme of refusing to communicate anything about an idea at all.","parent":"posts/On auteurs and language.txt","score":0.8619927509082249},{"content":"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]]","parent":"posts/untitled-9-20-2021.txt","score":0.8601342179946279},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8600254062760695},{"content":"It is this property that allows programmers to cheat the Gods, and achieve divine levels of creative output thought forbidden to mortals. A programmer can create abstractions than enable them to create in days what previously took months. I myself rewrote a good part of exegesis 2 months before I released it, and the new abstractions I picked enabled me to redo in those 2 months what took me almost a year at first. Moreover, programmers can share their abstractions, and borrow the inventions of others as well.","parent":"posts/Prometheus.txt","score":0.8577151641367418}],"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...":[{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":1.0000000000000002},{"content":"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]]","parent":"posts/untitled-9-20-2021.txt","score":0.8661197153781617},{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.8659799369654586},{"content":"I have an instinctive negative reaction against any sort of philosophy that preaches against personal identity/ego. The psychological reason for this is probably that I am a proud person. [[personal-reflection]]","parent":"posts/untitled-2-6-2022.txt","score":0.8649902767793601},{"content":"However I think I can also provide a principled argument against this \"anti-ego/pro-transcendental\" (albeit one that is also somewhat psychological). Along the lines of Nietzsche's argument, philosophy is deeply personal, and more often than not it reflects contingencies about the philosopher's personality rather than uncovering deep timeless truths. It seems to be the case that most philosophers who argue in favor of something transcendental and against the \"ego\" or \"personal identity\" are self-effacing individuals already. It's not like they'd be giving up much by renouncing their personal identities. Also, it's not particularly impressive for someone who's naturally humble to preach the virtues of humility - in a sense it seems like they're simply deifying aspects of their personality, rather than presenting a principled argument.","parent":"posts/untitled-2-6-2022.txt","score":0.859470498601018},{"content":"It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]]","parent":"posts/untitled-9-21-2021.txt","score":0.8554131423232538},{"content":"An aesthetic/ethical frame of mind concerns itself with beauty and values. It cares not about the ability of the individual, but their conviction - how strongly they believe in the values they've subordinated themselves to.","parent":"posts/untitled-9-30-2021.txt","score":0.8516193107024977},{"content":"Nietzsche argues that there exists a philosophical system for each person that would justify their existence - like the \"books of apologia and prophecies that would vindicate for all time the actions of every person in the universe\" in The Library of Babel.","parent":"posts/Why I made exegesis.txt","score":0.850097086183858},{"content":"Also contrast to [[Nietzsche]]'s famous dictum that all philosophy is a kind of personal confession on the part of the philosopher. This certainly seems true to an extent - a lot of biographers think Spinoza built his system out of need to cope with his own loneliness.","parent":"posts/untitled-2-6-2022.txt","score":0.8489424404625212},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8477317028785807},{"content":"In the introduction to the [[Habermas]] book, the author briefly discusses the Critical Theorists he spent his youth with, and how they believed rationality was man's only hope for emancipation. However, they also believed rationality had devolved into \"instrumental rationality\" - a kind of ruthlessly utilitarian rationality - that would also end up dooming mankind. Because of this contradiction, the Critical Theorists became extremely pessimistic.","parent":"posts/untitled-9-21-2021.txt","score":0.8475767342433339},{"content":"Some incredibly interesting excerpts I want to quote directly (emphases all mine):","parent":"posts/untitled-9-20-2021.txt","score":0.8467530387638649},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8458347812740009},{"content":"It's like an excess of rationality always ends eating itself. Those who take rationality serious enough end up directing rational criticism at rationality itself - a dynamic similar to what [[Nietzsche]] thought had happened to Christianity (that Christianity bore the value of truth-seeking, which ended up being turned against it).","parent":"posts/untitled-9-21-2021.txt","score":0.8455135586384352},{"content":"So too, there exists a tool for each person that would vindicate their peculiarities. It is my hope that exegesis will vindicate chaos, disorganization, messiness, disorder, and all other epithets hitherto applied to what is rightfully called creativity.","parent":"posts/Why I made exegesis.txt","score":0.8449265590164291},{"content":"I follow this [guy on twitter](https://twitter.com/nickcammarata) ([[nick-cammarata]]) that tweets about happiness a lot, and a common theme seems to be noticing what well being is, and imagining what the highest well being feels like.","parent":"posts/untitled-9-30-2021.txt","score":0.8443710280132581},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness.txt","score":0.8435331994447816},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8432865032947241},{"content":"In ethics, Rawls proposed the idea of the \"veil of justice\", where decision makers imagine they did not know their own position in society before making a decision. Here, someone blinds themselves to their own position for the sake of impartiality.","parent":"posts/Strategic blindness.txt","score":0.842687754180575},{"content":"To be sure, he thinks there are different respects in which an ontological theory can be simple - so both physicalist, phenomenalist, and Platonic ontologies can all be worth developing. On this matter I agree with him.","parent":"posts/untitled-1-4-2022.txt","score":0.8426260269441298}],"There is yet another world to be discovered - and more than one. Embark, philosophers!\"":[{"content":"There is yet another world to be discovered - and more than one. Embark, philosophers!\"","parent":"posts/Why I made exegesis.txt","score":1.0000000000000002},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8571242248159334},{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.850859791372041},{"content":"Nietzsche argues that there exists a philosophical system for each person that would justify their existence - like the \"books of apologia and prophecies that would vindicate for all time the actions of every person in the universe\" in The Library of Babel.","parent":"posts/Why I made exegesis.txt","score":0.8459716142484554},{"content":"I want to read more. I started reading a lot more in quarantine, but slowed down towards the end of 2020 because I was spending a lot more time on [[exegesis]]. Now that I have more time, I want to start a steady reading habit. The particular corner of [[twitter]] I hang around is fond of citing various philosophers and ideas, many of which I'm interested in, but have never taken the time to study closely. This year, I want to dig deeper into these ideas, go beyond surface-level Twitter philosophy memes and Youtube philosophy videos and read some proper primary sources. Around this time last year, I read Roger Scruton's A very short introduction to Kant. I want to tackle the Critique of Pure Reason sometime this year. I may live-blog my notes on exegesis (though I can't guarantee they'll be very good).","parent":"posts/Reflections for the New Year.txt","score":0.841486584556257},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.8407163995323431},{"content":"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]]","parent":"posts/untitled-9-20-2021.txt","score":0.84070665009559},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8343704676872177},{"content":"To be sure, he thinks there are different respects in which an ontological theory can be simple - so both physicalist, phenomenalist, and Platonic ontologies can all be worth developing. On this matter I agree with him.","parent":"posts/untitled-1-4-2022.txt","score":0.8312163728942747},{"content":"It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]]","parent":"posts/untitled-9-21-2021.txt","score":0.8251590491686431},{"content":"My aim in reading [[philosophy]] is more for general intellectual enrichment and to provide insights into my work, not philosophy for its own sake, so I feel fine with reading summaries as opposed to heavy primary literature (except where the primary literature interests me). For thinkers who are influential that don't interest me very much (like Kant), I've found summaries from the very short series and the Stanford Encyclopedia of Philosophy to be very helpful.","parent":"posts/untitled-9-21-2021.txt","score":0.82306490506049},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8223413408347793},{"content":"Education and authoritarianism[[meta-acropolis]] [[ideas]]","parent":"posts/untitled-9-21-2021.txt","score":0.8204991772195361},{"content":"In any case, it seems appropriate to begin [[meta-acropolis]], a project concerned with educational ontology with [[metaphysics]], the umbrella subject ontology is grouped under.","parent":"posts/untitled-1-4-2022.txt","score":0.8184271912890009},{"content":"In \"On What there is\", [[Quine]] relies heavily upon the idea that what ontology we subscribe to should depend on the idea of simplicity. In other words, we should adopt the simplest ontology possible.","parent":"posts/untitled-1-4-2022.txt","score":0.817580813542466},{"content":"So too, there exists a tool for each person that would vindicate their peculiarities. It is my hope that exegesis will vindicate chaos, disorganization, messiness, disorder, and all other epithets hitherto applied to what is rightfully called creativity.","parent":"posts/Why I made exegesis.txt","score":0.8167347025204102},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8165491181829466},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8164283265729907},{"content":"Learn more code (new languages, new frameworks, new databases, fancy tech like blockchain and ML, etc. etc.)","parent":"posts/Goals for Spring Quarter.txt","score":0.816058750083283},{"content":"I feel open to the future. I feel that there is meaning in this world, even if I don't know what it is currently, and it may be impossible to pin it down with words. I feel that the bad things that happen in this world do not lead to the conclusion that the world is a bad place. I feel ok not being able to explain everything. I feel I have something valuable to offer to others, I feel others have something valuable to offer to me. Change seems possible, albeit slow, and slowness feels OK.","parent":"posts/untitled-9-30-2021.txt","score":0.8159487344876841}],"Nietzsche argues that there exists a philosophical system for each person that would justify their existence - like the \"books of apologia and prophecies that would vindicate for all time the actions of every person in the universe\" in The Library of Babel.":[{"content":"Nietzsche argues that there exists a philosophical system for each person that would justify their existence - like the \"books of apologia and prophecies that would vindicate for all time the actions of every person in the universe\" in The Library of Babel.","parent":"posts/Why I made exegesis.txt","score":0.9999999999999998},{"content":"Also contrast to [[Nietzsche]]'s famous dictum that all philosophy is a kind of personal confession on the part of the philosopher. This certainly seems true to an extent - a lot of biographers think Spinoza built his system out of need to cope with his own loneliness.","parent":"posts/untitled-2-6-2022.txt","score":0.8622173757799297},{"content":"I do remember reading somewhere that Nietzsche admired Spinoza, so I'm curious to see how he resolved (or didn't resolve) the tension between his views on [[philosophy]] and Spinoza's.","parent":"posts/untitled-2-6-2022.txt","score":0.8592506716761276},{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.8586695016063799},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8555576093631001},{"content":"I'm reminded of the [[Nietzsche]]an theme of self awareness/consciousness being a sickness that he riffs upon occasionally in [[The Gay Science]].","parent":"posts/Strategic blindness.txt","score":0.8536306760337546},{"content":"To be sure, he thinks there are different respects in which an ontological theory can be simple - so both physicalist, phenomenalist, and Platonic ontologies can all be worth developing. On this matter I agree with him.","parent":"posts/untitled-1-4-2022.txt","score":0.8514680446505108},{"content":"It also seems like [[philosophy]] requires a war-like state of mind - against others, against oneself, against philosophy itself. I'm again reminded of an aphorism from [[The Gay Science]], simply titled \"excelsior\" - \"Thou wilt never more pray, never more worship, never more repose in infinite trust - thou refusest to stand still and dismiss thy thoughts before an ultimate wisdom, an ultimate virtue, an ultimate power, - thou hast no constant guardian and friend in thy seven solitudes - thou livest without the outlook on a mountain that has snow on its head and fire in its heart - there is no longer any requiter for thee, nor any amender with his finishing touch - there is no longer any reason in that which happens, or any love in that which will happen to thee - there is no longer any resting-place for thy weary heart, where it has only to find and no longer to seek, thou art opposed to any kind of ultimate peace, thou desirest the eternal recurrence of war and peace: - man of renunciation, wilt thou renounce in all these things? Who will give thee the strength to do so? No one has yet had this strength!\" - There is a lake which one day refused to flow away, and threw up a dam at the place where it had hitherto discharged: since then this lake has always risen higher and higher. Perhaps the very renunciation will also furnish us with the strength with which the renunciation itself can be borne; perhaps man will ever rise higher and higher from that point onward, when he no longer flows out into a God.\"[[quotes]] [[Nietzsche]] [[philosophy]] [[The Gay Science]]","parent":"posts/untitled-9-21-2021.txt","score":0.8508304654361899},{"content":"Reminds me of a quote from [[Nietzsche]] in [[The Gay Science]] - \"Indeed, at hearing the news that 'the old god is dead', we philosophers and 'free spirits' feel illuminated by a new dawn; our heart overflows with gratitude, amazement, forebodings, expectation - finally the horizon seems clear again, even if not bright; finally our ships may set out again, set out to face any danger; every daring of the lover of knowledge is allowed again; the sea, our sea, lies open again; maybe there has never been such an 'open sea'.”[[quotes]] [[Nietzsche]] [[The Gay Science]]","parent":"posts/untitled-9-20-2021.txt","score":0.8507664836169914},{"content":"\"Consider how each individual is affected by an overall philosophical justification of his way of living and thinking: he experiences it as a sun that shines especially for him and bestows warmth, blessings, and fertility on him; it makes him independent of praise and blame, self-sufficient, rich, liberal with happiness and good will; incessantly it refashions evil into good, leads all energies to bloom and ripen, and does not permit the petty weeds of grief and chagrin to come up at all. In the end one exclaims: How I wish that many such new suns were yet to be created! Those who are evil or unhappy and the exceptional human being - all these should also have their philosophy, their good right, their sunshine! What is needful is not pity for them. We must learn to abandon this arrogant fancy, however long humanity has hitherto spent learning and practicing it...","parent":"posts/Why I made exegesis.txt","score":0.850097086183858},{"content":"However I think I can also provide a principled argument against this \"anti-ego/pro-transcendental\" (albeit one that is also somewhat psychological). Along the lines of Nietzsche's argument, philosophy is deeply personal, and more often than not it reflects contingencies about the philosopher's personality rather than uncovering deep timeless truths. It seems to be the case that most philosophers who argue in favor of something transcendental and against the \"ego\" or \"personal identity\" are self-effacing individuals already. It's not like they'd be giving up much by renouncing their personal identities. Also, it's not particularly impressive for someone who's naturally humble to preach the virtues of humility - in a sense it seems like they're simply deifying aspects of their personality, rather than presenting a principled argument.","parent":"posts/untitled-2-6-2022.txt","score":0.8498981356046802},{"content":"There is yet another world to be discovered - and more than one. Embark, philosophers!\"","parent":"posts/Why I made exegesis.txt","score":0.8459716142484554},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8445614439852468},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8422436739479073},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8421746811709883},{"content":"So too, there exists a tool for each person that would vindicate their peculiarities. It is my hope that exegesis will vindicate chaos, disorganization, messiness, disorder, and all other epithets hitherto applied to what is rightfully called creativity.","parent":"posts/Why I made exegesis.txt","score":0.8391781888446456},{"content":"[[Quine]] is a \"formalist\" with regards to ontological theories. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.838996520123392},{"content":"My aim in reading [[philosophy]] is more for general intellectual enrichment and to provide insights into my work, not philosophy for its own sake, so I feel fine with reading summaries as opposed to heavy primary literature (except where the primary literature interests me). For thinkers who are influential that don't interest me very much (like Kant), I've found summaries from the very short series and the Stanford Encyclopedia of Philosophy to be very helpful.","parent":"posts/untitled-9-21-2021.txt","score":0.8358687627257819},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8350095464632036},{"content":"In \"On What there is\", [[Quine]] relies heavily upon the idea that what ontology we subscribe to should depend on the idea of simplicity. In other words, we should adopt the simplest ontology possible.","parent":"posts/untitled-1-4-2022.txt","score":0.8335797936833145}]}