{"":[{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8593290080388},{"content":"The club does 2 things.","parent":"posts/untitled-9-24-2021.txt","score":0.8589669169415844},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8577220980911441},{"content":"Code:","parent":"posts/Goals for Spring Quarter.txt","score":0.856649564390397},{"content":"Executing","parent":"posts/Goals for Spring Quarter.txt","score":0.8556654491388678},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter.txt","score":0.8537043599402795},{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8514450468005932},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8499151373626692},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter.txt","score":0.8497861585687644},{"content":"Learn a grappling art (because of quarantine, this will just be maintaining general fitness levels for now)","parent":"posts/Goals for Spring Quarter.txt","score":0.8496945903933114},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter.txt","score":0.8478182318510581},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8472546071060495},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8467379006001533},{"content":"This is for scenarios where you do want to write in an organized manner. For example, right now, this entire page is about","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8466474388580029},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8456538970968254},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8455300536527719},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8455138568311819},{"content":"I'm taking a gap quarter this Spring to work on some personal projects. It is always better to have a plan than to have no plan, even if things don't work out your way, so here are some tentative goals for my gap quarter.","parent":"posts/Goals for Spring Quarter.txt","score":0.8451682294721505},{"content":"Writing cascades","parent":"posts/untitled-10-1-2021.txt","score":0.8444322593169847},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8437967333727141}],"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine. ":[{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":1},{"content":"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.","parent":"posts/What is Nomad Hypertext.txt","score":0.8699300681505606},{"content":"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data.","parent":"posts/Controlling what you see.txt","score":0.8677398495144898},{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text.","parent":"posts/What is Nomad Hypertext.txt","score":0.866547162642143},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt.txt","score":0.865922385652317},{"content":"It's pretty simple for the most part, you just write. If you want to see ideas that are related to a paragraph, click the # next to the paragraph.","parent":"posts/What is Nomad Hypertext.txt","score":0.8639032511497253},{"content":"As I looked further into these tools, I found that some had taken to calling them [Second Brains](https://fortelabs.co/blog/basboverview/). I thought this was incredibly exciting. The term sounds cyberpunk; building a \"second brain\" sounds way cooler than building a \"note taking app.\" At the same time, something about it unsettled me.","parent":"posts/Second Brains.txt","score":0.8491905564458625},{"content":"The second would be [All you need is links](https://subconscious.substack.com/p/all-you-need-is-links) by Gordon Brander. He puts forth the case that you can implement pretty much any feature you might want a tool for thought to have, using only hyperlinks. I found the idea that you could create a myriad of functionality with just one powerful feature extremely fascinating. \n\nWhat he says about links, I believe to be true about semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8465829268321472},{"content":"Tools for creative thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8444935026608846},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8437299587269823},{"content":"In my teen years, I found programming and videogame development, and that became my creative outlet for a while. I found a way to scan my drawings into digital files, and for a while that was my way of combining art and programming.","parent":"posts/Fragments.txt","score":0.8428179506749617},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8423018226311856},{"content":"The internet raised an entire generation to think nonlinearly, and it is only recently that tools for thinking have caught up.","parent":"posts/Why I made exegesis.txt","score":0.8404918302099669},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.840152005030881},{"content":"[[ideas]]: A tool that analyzes a react project and shows your component structure for you in a nice and visual way. Probably already exists, idk","parent":"posts/untitled-9-20-2021.txt","score":0.839541132381683},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.839335327179952},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8391297639360582},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8379176808831033},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.83785760899154},{"content":"In general, computers have enabled the Promethean task of stealing creative abilities previously reserved for deities. Musicians have their electrically amplified instruments, their DAWs, the vast oceans of samples available on the internet; artists have been blessed with digital canvases, 3D modeling, and the ubiquity of screens that renders a possible canvas in every man's pocket.","parent":"posts/Prometheus.txt","score":0.8364825826914521}],"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes. ":[{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.9999999999999998},{"content":"It's pretty simple for the most part, you just write. If you want to see ideas that are related to a paragraph, click the # next to the paragraph.","parent":"posts/What is Nomad Hypertext.txt","score":0.8884360131915683},{"content":"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.","parent":"posts/What is Nomad Hypertext.txt","score":0.8880659814719757},{"content":"I could instead create all these pages, and tag them with their parents. Then, from the parent note, you would able to see the linked notes (like the sub directories, in a file system).","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8770740479607668},{"content":"This is for scenarios where you do want to write in an organized manner. For example, right now, this entire page is about","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8576297081628028},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt.txt","score":0.8570047064462835},{"content":"One of my biggest pet peeves about exegesis right now is titling conflicts. All note titles must be unique, because when you leave a tag with a note's title, it will link you to that note. If you have multiple notes with the same title, then the app would not know where to direct you.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8550486991015054},{"content":"Sometimes, you want multiple paragraphs to be grouped together as if they were one. This might be because you're using new lines for emphasis, rather than as a split between ideas. \n\nTo group multiple paragraphs together, put a ~ before the starting paragraph and another ~ after the ending paragraph.  \n\nThis collection of three paragraphs is an example of how to do that.","parent":"posts/What is Nomad Hypertext.txt","score":0.8531010334532511},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.852900505851659},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8520847995665434},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8484072154704749},{"content":"Right now users can apply tags to paragraphs and highlights. I would like to allow users to apply tags to an entire page as well.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8450623208047316},{"content":"To solve this, I want to introduce a 'namespace' feature. Basically, note titles would only have to be unique within a particular 'namespace.' I could create a namespace titled 'private', and a namespace titled 'public', and have a note titled 'exegesis' in both. Then, I could publish the 'exegesis' note from the 'public' namespace only. Links would be bounded within their namespaces - a note with a tag to 'exegesis' in the 'public' namespace would only link to the 'exegesis' page in the 'public' namespace.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8408501609446454},{"content":"The app is free and open source. Notes are stored as plain text files, which means you are free to use tools like git to sync them across multiple devices, and free to port your notes over to other apps if you wish.","parent":"posts/What is Nomad Hypertext.txt","score":0.8364695683025376},{"content":"If you want some text to not show up in the search index (if it's private, or not very important, or any other reason), prepend the paragraph with two slashes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8339369511825392},{"content":"Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8338840874411502},{"content":", but it'd be terribly tedious to highlight the entire thing to tag it exegesis (not to mention, since overlapping tags are not supported, this would stop you from adding tags to smaller segments). It would be nice to be able to simply tag this page 'exegesis' and have it show up when filtering for the exegesis tag.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8321142022737724},{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8319952088988662},{"content":"Edit: I have added very basic support for Markdown to Yurt - right now pretty much only links work.","parent":"posts/Plaintext is your best friend.txt","score":0.8266857164191831},{"content":"I want to build a system that will enable someone to write about a problem that they have, then discover that their great aunt encountered the exact same problem in her life, and how she came to a solution.","parent":"posts/Generational Computing.txt","score":0.826195496451354}],"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.":[{"content":"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.","parent":"posts/What is Nomad Hypertext.txt","score":1.0000000000000002},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt.txt","score":0.9173546459317327},{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8880659814719757},{"content":"It's pretty simple for the most part, you just write. If you want to see ideas that are related to a paragraph, click the # next to the paragraph.","parent":"posts/What is Nomad Hypertext.txt","score":0.8853292662250393},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8844334471945244},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8786014903445767},{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8699300681505606},{"content":"The app is free and open source. Notes are stored as plain text files, which means you are free to use tools like git to sync them across multiple devices, and free to port your notes over to other apps if you wish.","parent":"posts/What is Nomad Hypertext.txt","score":0.8564783148090083},{"content":"People take notes to remember. The goal is to write down information, delivered in some lossy format like a lecture, video, or a book, and crystallize the main points in writing so you can access them later. The goal is a rational one, focused on knowledge.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8557593776949816},{"content":"Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8534700928858229},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8533427136732172},{"content":"I could instead create all these pages, and tag them with their parents. Then, from the parent note, you would able to see the linked notes (like the sub directories, in a file system).","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.853013187730845},{"content":"This is for scenarios where you do want to write in an organized manner. For example, right now, this entire page is about","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8509515514539466},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8502432847770379},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.84899338404756},{"content":"Exegesis is the Apple Notes to Roam Research's Microsoft Word. It is less powerful, but it is simpler. A notetaking app should not force your mind to conform to it, it should conform to your mind. Personally, I prefer having an open document to write into over a bullet point system, even if the latter allows for more complex queries and notetaking systems. Some people hate both and prefer the simplicity of pen and paper. Do what works for you.","parent":"posts/Second Brains.txt","score":0.8457919528517137},{"content":"My theory is that the current wave rational tools for thought (PKMs, note-taking apps, [[roam]], etc.) will be disrupted by AI-powered tools and search engines. Note taking has always felt futile to me, because the information age has made remembering/memorizing information useless - why memorize when you can look it up? 1","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8442304277592891},{"content":"Of course, if you're looking to raise a billion dollars on your consumer-facing notetaking app, plain text won't cut it. Lucky for us all, Jerome Powell has acted wisely to proscribe this possibility.","parent":"posts/Plaintext is your best friend.txt","score":0.8408637533712433},{"content":"An additional benefit is that this allows users to construct folder-like organization schemes. For example, if I wanted to replicate a folder structure I'd constructed in Notion that looked like this:","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8404946525957601},{"content":"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.","parent":"posts/Plaintext is your best friend.txt","score":0.8374510906274564}],"Nomad Hypertext is a writing app built around semantic search. ":[{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":1},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search\nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.9333090191893725},{"content":"I was greatly inspired by two blogposts. The first, [Hyperlink Maximalism](https://thesephist.com/posts/hyperlink/) by Linus Lee talks about generating hyperlinks automatically between documents, and comes with a [demo](https://notation.app) that made a deep impression on me. To be honest, nomad hypertext is just Linus' demo using semantic search instead of full text search.","parent":"posts/What is Nomad Hypertext.txt","score":0.9330681709911436},{"content":"There are lots of tools for thought out there with names inspired by great empires or their capitals: Roam (Rome) Research, Athens Research, Vienna Hypertext, etc. etc. I like all of these apps and have taken inspiration from them.\n\nBut isn't it strange that they have such imperial names? Tools for thought aren't about hierarchy and order, they're about freeing your thoughts to mingle with each other. It's less about ordering your thoughts into a hierarchical empire, and more about letting them wander freely, so that they might bear fruit. \n\nThat's why I picked the name nomad hypertext.","parent":"posts/What is Nomad Hypertext.txt","score":0.9151239566033346},{"content":"// HOW TO USE NOMAD HYPERTEXT","parent":"posts/What is Nomad Hypertext.txt","score":0.91061429741966},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.9104599483210772},{"content":"However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. \n\nFactoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.","parent":"posts/The making of Nomad Hypertext.txt","score":0.9097940323598066},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.9018091339147541},{"content":"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links.","parent":"posts/Plaintext is your best friend.txt","score":0.8920608841198197},{"content":"Yurt is a static site generator, built off the same principles as Nomad Hypertext.","parent":"posts/What is Yurt.txt","score":0.8883728375969453},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8585245563908193},{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text.","parent":"posts/What is Nomad Hypertext.txt","score":0.8567202864876738},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.856438668453693},{"content":"On the other hand, hypertext is built around the idea of a hyperlink, which is just a link from one document to another. Think about Wikipedia, and how every page is rich with links and connections to other pages. It is incoherent to talk about reading Wikipedia \"from start to end.\" Books create linear paths from A to B, hypertext creates entire worlds ripe for exploration.","parent":"posts/Why I made exegesis.txt","score":0.8561222452884774},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8553905866429953},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.853536232828452},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt.txt","score":0.8529484099318667},{"content":"The second would be [All you need is links](https://subconscious.substack.com/p/all-you-need-is-links) by Gordon Brander. He puts forth the case that you can implement pretty much any feature you might want a tool for thought to have, using only hyperlinks. I found the idea that you could create a myriad of functionality with just one powerful feature extremely fascinating. \n\nWhat he says about links, I believe to be true about semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8504454163219866},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8492020640158635},{"content":"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.","parent":"posts/What is Nomad Hypertext.txt","score":0.84899338404756}],"// HOW TO USE NOMAD HYPERTEXT":[{"content":"// HOW TO USE NOMAD HYPERTEXT","parent":"posts/What is Nomad Hypertext.txt","score":0.9999999999999999},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.91061429741966},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.8890474254639446},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8805950337110664},{"content":"I was greatly inspired by two blogposts. The first, [Hyperlink Maximalism](https://thesephist.com/posts/hyperlink/) by Linus Lee talks about generating hyperlinks automatically between documents, and comes with a [demo](https://notation.app) that made a deep impression on me. To be honest, nomad hypertext is just Linus' demo using semantic search instead of full text search.","parent":"posts/What is Nomad Hypertext.txt","score":0.861444958749235},{"content":"Yurt is a static site generator, built off the same principles as Nomad Hypertext.","parent":"posts/What is Yurt.txt","score":0.8564380143441639},{"content":"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links.","parent":"posts/Plaintext is your best friend.txt","score":0.8532290476268194},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search\nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.8443617091311654},{"content":"There are lots of tools for thought out there with names inspired by great empires or their capitals: Roam (Rome) Research, Athens Research, Vienna Hypertext, etc. etc. I like all of these apps and have taken inspiration from them.\n\nBut isn't it strange that they have such imperial names? Tools for thought aren't about hierarchy and order, they're about freeing your thoughts to mingle with each other. It's less about ordering your thoughts into a hierarchical empire, and more about letting them wander freely, so that they might bear fruit. \n\nThat's why I picked the name nomad hypertext.","parent":"posts/What is Nomad Hypertext.txt","score":0.8419271730079018},{"content":"// MISTAKE 3: NOT BEING UNIX-PILLED ENOUGH","parent":"posts/The making of Nomad Hypertext.txt","score":0.8362551905203593},{"content":"However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. \n\nFactoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8337563230601178},{"content":"// FREE AND OPEN SOURCE","parent":"posts/What is Nomad Hypertext.txt","score":0.8324913761450815},{"content":"// MISTAKE 1: JAVASCRIPT INSTEAD OF TYPESCRIPT","parent":"posts/The making of Nomad Hypertext.txt","score":0.8324849205685318},{"content":"// 1. SECTION TITLE","parent":"posts/Plaintext is your best friend.txt","score":0.8314246038163389},{"content":"// Page tags","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8274353367179748},{"content":"// Edit: 1/6/2021","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.822088665550628},{"content":"// Namespaces","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8207173709598412},{"content":"// SEMANTIC SEARCH IS ALL YOU NEED","parent":"posts/What is Nomad Hypertext.txt","score":0.820466876206644},{"content":"// Context","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8169422629133519},{"content":"// Footnotes","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8160524137981975}],"// SEMANTIC SEARCH IS ALL YOU NEED":[{"content":"// SEMANTIC SEARCH IS ALL YOU NEED","parent":"posts/What is Nomad Hypertext.txt","score":1.0000000000000002},{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text.","parent":"posts/What is Nomad Hypertext.txt","score":0.8663810699591552},{"content":"// 1. SECTION TITLE","parent":"posts/Plaintext is your best friend.txt","score":0.8488904690196407},{"content":"// Like this! This line will not show up in the index.","parent":"posts/What is Nomad Hypertext.txt","score":0.8414526123288735},{"content":"// ABOUT THE NAME","parent":"posts/What is Nomad Hypertext.txt","score":0.8410314564465311},{"content":"// FREE AND OPEN SOURCE","parent":"posts/What is Nomad Hypertext.txt","score":0.8400663629006161},{"content":"// Key Features","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8363353290712334},{"content":"// Long Term goals","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8360951873158019},{"content":"// Namespaces","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.833875246454844},{"content":"//\t\t\t|___Music Theory","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8297170867532724},{"content":"// Context","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8288982309876232},{"content":"// MISTAKE 1: JAVASCRIPT INSTEAD OF TYPESCRIPT","parent":"posts/The making of Nomad Hypertext.txt","score":0.827327400223343},{"content":"// MISTAKE 3: NOT BEING UNIX-PILLED ENOUGH","parent":"posts/The making of Nomad Hypertext.txt","score":0.822794995570417},{"content":"// Edit: 1/6/2021","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8217862737213875},{"content":"// Read this, liked it a lot.","parent":"posts/untitled-9-22-2021.txt","score":0.8212574118120904},{"content":"// HOW TO USE NOMAD HYPERTEXT","parent":"posts/What is Nomad Hypertext.txt","score":0.820466876206644},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8201600770743185},{"content":"// MISTAKE 2: ELECTRON","parent":"posts/The making of Nomad Hypertext.txt","score":0.8139593532133714},{"content":"// Reflections and originals","parent":"posts/On auteurs and language.txt","score":0.8125908837368326},{"content":"// Technology that controls you","parent":"posts/Giant Robots.txt","score":0.8123885457885632}],"The app is free and open source. Notes are stored as plain text files, which means you are free to use tools like git to sync them across multiple devices, and free to port your notes over to other apps if you wish. ":[{"content":"The app is free and open source. Notes are stored as plain text files, which means you are free to use tools like git to sync them across multiple devices, and free to port your notes over to other apps if you wish.","parent":"posts/What is Nomad Hypertext.txt","score":1},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8892730407817299},{"content":"Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8731342470144368},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8651802379754988},{"content":"Exegesis is the Apple Notes to Roam Research's Microsoft Word. It is less powerful, but it is simpler. A notetaking app should not force your mind to conform to it, it should conform to your mind. Personally, I prefer having an open document to write into over a bullet point system, even if the latter allows for more complex queries and notetaking systems. Some people hate both and prefer the simplicity of pen and paper. Do what works for you.","parent":"posts/Second Brains.txt","score":0.8599554441999157},{"content":"If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.","parent":"posts/Second Brains.txt","score":0.8594150884167533},{"content":"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.","parent":"posts/What is Nomad Hypertext.txt","score":0.8564783148090083},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8560673574259473},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8543161301835261},{"content":"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.","parent":"posts/Plaintext is your best friend.txt","score":0.8508486808653293},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8484007433795021},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8469784280717327},{"content":"Of course, if you're looking to raise a billion dollars on your consumer-facing notetaking app, plain text won't cut it. Lucky for us all, Jerome Powell has acted wisely to proscribe this possibility.","parent":"posts/Plaintext is your best friend.txt","score":0.8437050221907724},{"content":"People take notes to remember. The goal is to write down information, delivered in some lossy format like a lecture, video, or a book, and crystallize the main points in writing so you can access them later. The goal is a rational one, focused on knowledge.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8414949827854467},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8410439655107205},{"content":"Also encouraging was the fact that I started hearing about similar notetaking apps a couple months into developing exegesis. Apps like Roam Research, and Obsidian were making waves on Twitter, and were taking a similar approach to nonlinear writing that I wanted to take exegesis in. This proved that I wasn't alone in needing this kind of product.","parent":"posts/Second Brains.txt","score":0.8401923139197199},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt.txt","score":0.8388502961534119},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8388299125848345},{"content":"One of my biggest pet peeves about exegesis right now is titling conflicts. All note titles must be unique, because when you leave a tag with a note's title, it will link you to that note. If you have multiple notes with the same title, then the app would not know where to direct you.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8367912789428302},{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8364695683025376}],"// FREE AND OPEN SOURCE":[{"content":"// FREE AND OPEN SOURCE","parent":"posts/What is Nomad Hypertext.txt","score":1.0000000000000002},{"content":"// Edit: 1/6/2021","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8611639075229721},{"content":"// MISTAKE 3: NOT BEING UNIX-PILLED ENOUGH","parent":"posts/The making of Nomad Hypertext.txt","score":0.8560959094780675},{"content":"// ABOUT THE NAME","parent":"posts/What is Nomad Hypertext.txt","score":0.8549289936641548},{"content":"// 1. SECTION TITLE","parent":"posts/Plaintext is your best friend.txt","score":0.8403639207685019},{"content":"// SEMANTIC SEARCH IS ALL YOU NEED","parent":"posts/What is Nomad Hypertext.txt","score":0.8400663629006161},{"content":"// Read this, liked it a lot.","parent":"posts/untitled-9-22-2021.txt","score":0.8389673827976402},{"content":"// Key Features","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8383360844639377},{"content":"// MISTAKE 1: JAVASCRIPT INSTEAD OF TYPESCRIPT","parent":"posts/The making of Nomad Hypertext.txt","score":0.8351064898795407},{"content":"// HOW TO USE NOMAD HYPERTEXT","parent":"posts/What is Nomad Hypertext.txt","score":0.8324913761450815},{"content":"// Community","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8319953018540032},{"content":"// Namespaces","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8313204602261172},{"content":"// Context","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8286370318739898},{"content":"// Youtube vs Spotify","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8282476166997322},{"content":"// Like this! This line will not show up in the index.","parent":"posts/What is Nomad Hypertext.txt","score":0.8268625392736421},{"content":"// Reflections and originals","parent":"posts/On auteurs and language.txt","score":0.8260605961991103},{"content":"// Technology that you control","parent":"posts/Giant Robots.txt","score":0.8255873374358401},{"content":"// MISTAKE 2: ELECTRON","parent":"posts/The making of Nomad Hypertext.txt","score":0.8241104200341773},{"content":"// Long Term goals","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8209207397768004},{"content":"// Technology that controls you","parent":"posts/Giant Robots.txt","score":0.8196328120283879}],"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text. ":[{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text.","parent":"posts/What is Nomad Hypertext.txt","score":1.0000000000000002},{"content":"The second would be [All you need is links](https://subconscious.substack.com/p/all-you-need-is-links) by Gordon Brander. He puts forth the case that you can implement pretty much any feature you might want a tool for thought to have, using only hyperlinks. I found the idea that you could create a myriad of functionality with just one powerful feature extremely fascinating. \n\nWhat he says about links, I believe to be true about semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.897346495962769},{"content":"I was greatly inspired by two blogposts. The first, [Hyperlink Maximalism](https://thesephist.com/posts/hyperlink/) by Linus Lee talks about generating hyperlinks automatically between documents, and comes with a [demo](https://notation.app) that made a deep impression on me. To be honest, nomad hypertext is just Linus' demo using semantic search instead of full text search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8779396092063506},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.8733410437152355},{"content":"However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. \n\nFactoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8719613995388409},{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.866547162642143},{"content":"// SEMANTIC SEARCH IS ALL YOU NEED","parent":"posts/What is Nomad Hypertext.txt","score":0.8663810699591552},{"content":"In general, a file system represents a tree structure, and a tagging system represents a graph structure. Since a tree structure is a specific case of a graph structure, it is possible to accomplish a file system like approach with a tagging approach.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8623886190508707},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search\nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.8575354857789923},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8567202864876738},{"content":"I could instead create all these pages, and tag them with their parents. Then, from the parent note, you would able to see the linked notes (like the sub directories, in a file system).","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8559489185992836},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8557046072114154},{"content":"It's pretty simple for the most part, you just write. If you want to see ideas that are related to a paragraph, click the # next to the paragraph.","parent":"posts/What is Nomad Hypertext.txt","score":0.8532148785071338},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8485820548808909},{"content":"1. The current wave of backlink-focused apps have a compelling response to this objection, which is that they're not focused on just copying information, they're focused on capturing the connections between ideas. Fair enough. But why require the end user to manually copy information down? It seems that this could be done more effectively through an annotation layer.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8475820251223019},{"content":"An additional benefit is that this allows users to construct folder-like organization schemes. For example, if I wanted to replicate a folder structure I'd constructed in Notion that looked like this:","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8461501731543338},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8385190628415884},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8380802735770462},{"content":"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.","parent":"posts/What is Nomad Hypertext.txt","score":0.8371927031712236},{"content":"I think eventually, I might want to deploy a blog with a full fledged backend, so users can query anything they'd like to my blog.","parent":"posts/What is Yurt.txt","score":0.8342313524726851}],"It's pretty simple for the most part, you just write. If you want to see ideas that are related to a paragraph, click the # next to the paragraph. ":[{"content":"It's pretty simple for the most part, you just write. If you want to see ideas that are related to a paragraph, click the # next to the paragraph.","parent":"posts/What is Nomad Hypertext.txt","score":1.0000000000000002},{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8884360131915683},{"content":"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.","parent":"posts/What is Nomad Hypertext.txt","score":0.8853292662250393},{"content":"This is for scenarios where you do want to write in an organized manner. For example, right now, this entire page is about","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8768658217239843},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt.txt","score":0.8697668168866999},{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8639032511497253},{"content":"Sometimes, you want multiple paragraphs to be grouped together as if they were one. This might be because you're using new lines for emphasis, rather than as a split between ideas. \n\nTo group multiple paragraphs together, put a ~ before the starting paragraph and another ~ after the ending paragraph.  \n\nThis collection of three paragraphs is an example of how to do that.","parent":"posts/What is Nomad Hypertext.txt","score":0.8634347458944949},{"content":"The bottom line is with a notetaking app, what I'm really looking for is the ability to see connections between my ideas. I don't care about pretty formatting. Plain text is uglier, but it increases the range of things you can do with your notes - you can pipe it into an LLM, you can pipe it into a summarizer, you can take notes on Apple Notes then paste them into your notes later, you can set up a service that lets you text a number that will then paste your texts into your notes, etc. etc.","parent":"posts/Plaintext is your best friend.txt","score":0.8632755256771197},{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text.","parent":"posts/What is Nomad Hypertext.txt","score":0.8532148785071338},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8498589238179579},{"content":"I could instead create all these pages, and tag them with their parents. Then, from the parent note, you would able to see the linked notes (like the sub directories, in a file system).","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8498042475066475},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8491963079867418},{"content":"My favorite use of [[exegesis]] is to write down ideas that I have. I write about exegesis in exegesis, and a lot of features that I've added to exegesis started as sudden thoughts that were captured in exegesis. In my experience, ideas are like seeds, and writing them down helps them grow. I might think nothing of a simple idea I capture one day, but a week later it might have renewed significance, and it could even spark new ideas.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8419994244550144},{"content":"Right now users can apply tags to paragraphs and highlights. I would like to allow users to apply tags to an entire page as well.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8419585571863468},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":0.8410786496914123},{"content":"I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]]","parent":"posts/untitled-9-24-2021.txt","score":0.8405779914061378},{"content":"Here's the thing - I don't think anyone really needs right text that badly. Italics and bold don't matter that much. The one thing I find myself missing a lot is titles, but you can do something similar with plaintext simply by having a number before a line, like so:","parent":"posts/Plaintext is your best friend.txt","score":0.8405514237261544},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8404844902666834},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8380760202278658},{"content":"In writing this essay, I checked everything tagged \"exegesis\" and \"personal-reflection\" in exegesis. I didn't tag those thoughts for the purpose of writing this essay, they were written down spontaneously. That they have helped me write this essay is serendipitous.","parent":"posts/Second Brains.txt","score":0.836946645998163}],"If you want some text to not show up in the search index (if it's private, or not very important, or any other reason), prepend the paragraph with two slashes. ":[{"content":"If you want some text to not show up in the search index (if it's private, or not very important, or any other reason), prepend the paragraph with two slashes.","parent":"posts/What is Nomad Hypertext.txt","score":1},{"content":"Sometimes, you want multiple paragraphs to be grouped together as if they were one. This might be because you're using new lines for emphasis, rather than as a split between ideas. \n\nTo group multiple paragraphs together, put a ~ before the starting paragraph and another ~ after the ending paragraph.  \n\nThis collection of three paragraphs is an example of how to do that.","parent":"posts/What is Nomad Hypertext.txt","score":0.8440769990697113},{"content":"Here's the thing - I don't think anyone really needs right text that badly. Italics and bold don't matter that much. The one thing I find myself missing a lot is titles, but you can do something similar with plaintext simply by having a number before a line, like so:","parent":"posts/Plaintext is your best friend.txt","score":0.843675715263514},{"content":"That's fine and all for most use cases, I've been using exegesis for months and it hasn't bothered me, until one specific scenario. That's when I have a titled note I want to keep private, but I also want to publish a note with that same title. Here's an example to illustrate what I mean: I have a page titled 'exegesis' in my private notes, where I have some notes on the general direction I want to send exegesis in. Ideally, I'd like to have a page titled 'exegesis' published publicly as well. However, I don't want to publish my private note, because there are some things in that note that I don't want to publish yet. There is no way for me to have a private note titled 'exegesis', and a public note titled 'exegesis' as well.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8406011168499702},{"content":", but it'd be terribly tedious to highlight the entire thing to tag it exegesis (not to mention, since overlapping tags are not supported, this would stop you from adding tags to smaller segments). It would be nice to be able to simply tag this page 'exegesis' and have it show up when filtering for the exegesis tag.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8382707424765524},{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8339369511825392},{"content":"One of my biggest pet peeves about exegesis right now is titling conflicts. All note titles must be unique, because when you leave a tag with a note's title, it will link you to that note. If you have multiple notes with the same title, then the app would not know where to direct you.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8319353281124472},{"content":"To solve this, I want to introduce a 'namespace' feature. Basically, note titles would only have to be unique within a particular 'namespace.' I could create a namespace titled 'private', and a namespace titled 'public', and have a note titled 'exegesis' in both. Then, I could publish the 'exegesis' note from the 'public' namespace only. Links would be bounded within their namespaces - a note with a tag to 'exegesis' in the 'public' namespace would only link to the 'exegesis' page in the 'public' namespace.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8316914684773611},{"content":"Right now users can apply tags to paragraphs and highlights. I would like to allow users to apply tags to an entire page as well.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8246778084637029},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.8224854563780231},{"content":"I was greatly inspired by two blogposts. The first, [Hyperlink Maximalism](https://thesephist.com/posts/hyperlink/) by Linus Lee talks about generating hyperlinks automatically between documents, and comes with a [demo](https://notation.app) that made a deep impression on me. To be honest, nomad hypertext is just Linus' demo using semantic search instead of full text search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8214500374813549},{"content":"The other thing I miss is links. You can still paste urls, however. It's ugly but it works.","parent":"posts/Plaintext is your best friend.txt","score":0.8208264555865767},{"content":"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links.","parent":"posts/Plaintext is your best friend.txt","score":0.8205829558378446},{"content":"It's pretty simple for the most part, you just write. If you want to see ideas that are related to a paragraph, click the # next to the paragraph.","parent":"posts/What is Nomad Hypertext.txt","score":0.819465864524461},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8180938045871403},{"content":"The flexibility and power and power of plaintext matters much more than the meagre aesthetic gains of rich text. I am genuinely convinced that bold, italics and titles add little to nothing to my experience of a notetaking app.","parent":"posts/Plaintext is your best friend.txt","score":0.817383712353105},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search\nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.8141419414928744},{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text.","parent":"posts/What is Nomad Hypertext.txt","score":0.8136809279384207},{"content":"Instead of allowing users to write bios for the public pages, I would like to let them mark one page as their \"bio page.\" That page would be published, and would be shown directly on their profile. Basically, instead of a simple plaintext bio, their bios could be an entire exegesis note. That way, they could include links to their favorite pages, their favorite tags, and explain them to anyone visiting their page.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8135688218432263},{"content":"I could instead create all these pages, and tag them with their parents. Then, from the parent note, you would able to see the linked notes (like the sub directories, in a file system).","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8121919684480714}],"Sometimes, you want multiple paragraphs to be grouped together as if they were one. This might be because you're using new lines for emphasis, rather than as a split between ideas. \n\nTo group multiple paragraphs together, put a ~ before the starting paragraph and another ~ after the ending paragraph.  \n\nThis collection of three paragraphs is an example of how to do that.":[{"content":"Sometimes, you want multiple paragraphs to be grouped together as if they were one. This might be because you're using new lines for emphasis, rather than as a split between ideas. \n\nTo group multiple paragraphs together, put a ~ before the starting paragraph and another ~ after the ending paragraph.  \n\nThis collection of three paragraphs is an example of how to do that.","parent":"posts/What is Nomad Hypertext.txt","score":0.9999999999999998},{"content":"It's pretty simple for the most part, you just write. If you want to see ideas that are related to a paragraph, click the # next to the paragraph.","parent":"posts/What is Nomad Hypertext.txt","score":0.8634347458944949},{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8531010334532511},{"content":"If you want some text to not show up in the search index (if it's private, or not very important, or any other reason), prepend the paragraph with two slashes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8440769990697113},{"content":"This is for scenarios where you do want to write in an organized manner. For example, right now, this entire page is about","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8396020586391885},{"content":"I've instead chosen to cluster them in groups, and rank the groups.","parent":"posts/Goals for Spring Quarter.txt","score":0.8389971053352618},{"content":"Here's the thing - I don't think anyone really needs right text that badly. Italics and bold don't matter that much. The one thing I find myself missing a lot is titles, but you can do something similar with plaintext simply by having a number before a line, like so:","parent":"posts/Plaintext is your best friend.txt","score":0.8389397292195395},{"content":"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.","parent":"posts/What is Nomad Hypertext.txt","score":0.831232241447966},{"content":"None of these thoughts will be very organized. That's kind of the point of [[exegesis]] anyways - to enable non linear, disorganized thinking.","parent":"posts/untitled-9-20-2021.txt","score":0.8300652381366447},{"content":", but it'd be terribly tedious to highlight the entire thing to tag it exegesis (not to mention, since overlapping tags are not supported, this would stop you from adding tags to smaller segments). It would be nice to be able to simply tag this page 'exegesis' and have it show up when filtering for the exegesis tag.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.827963729594379},{"content":"We are all familiar with the structure of a traditional nonfiction book - it is organized into chapters, separated topically, and each of those chapters consists of smaller subsections, each composed of paragraphs that introduce ideas in a linear and logical fashion. You read a book from start to end.","parent":"posts/Why I made exegesis.txt","score":0.8226688524251566},{"content":"Right now users can apply tags to paragraphs and highlights. I would like to allow users to apply tags to an entire page as well.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8193982201045651},{"content":"I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]]","parent":"posts/untitled-9-24-2021.txt","score":0.8193292618985356},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8192847186492167},{"content":"One of my biggest pet peeves about exegesis right now is titling conflicts. All note titles must be unique, because when you leave a tag with a note's title, it will link you to that note. If you have multiple notes with the same title, then the app would not know where to direct you.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.816430090475351},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8151145087963568},{"content":"Our minds were not built to handle such vast volumes of information. Faced with these unnatural circumstances, we turn towards external methods of storing and processing information colloquially referred to as \"notetaking,\" but existing notetaking methods, trapped in outdated dogma, can offer us little help. In most notetaking apps some abstraction of a \"notebook\" remains, a skeuomorphic ghost from our information-scarce past. Put your math thoughts in your math notebook. Put your science notes in your science notebook. Don't think thoughts out of order, or you'll have to switch notebooks to write them down. This notetaking paradigm comes from an age when the primary medium of information was a book, a single, continuous stream of information about a single topic.","parent":"posts/Manifesto.txt","score":0.8121163083237374},{"content":"The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well.","parent":"posts/Goals for Spring Quarter.txt","score":0.8117904569836357},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8117384480471789},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8098943971200873}],"~":[{"content":"A thousand suns","parent":"posts/Why I made exegesis.txt","score":0.8319412092112017},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8278526468544705},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8262986789560413},{"content":"You're viewing this on a statically generated blog using Yurt!","parent":"posts/What is Yurt.txt","score":0.8260014199682172},{"content":"\"The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again.\"[[personal-reflection]] [[quotes]] [[Capitalist-Realism]]","parent":"posts/untitled-9-20-2021.txt","score":0.8223588348016678},{"content":"\"From the moment I understood the weakness of my flesh, it disgusted me. I craved for strength and certainty of steel. I aspired to the purity of the blessed machine. Your kind cling to your flesh, as though it will not decay and fail you. One day the crude biomass you call a temple will wither and you will beg my kind to save you.\n\nBut I am already saved. For the Machine is immortal.\"\n\n- Magos Dominus Reditus, Warhammer 40k","parent":"posts/Second Brains.txt","score":0.8206241415459742},{"content":"[[philosophy]] [[deleuze]]","parent":"posts/untitled-9-30-2021.txt","score":0.8192152841997462},{"content":"Sitting in the MU again, this time with a view of the quad. Listening to \"The Time of the Season\" by the Zombies.","parent":"posts/untitled-9-24-2021.txt","score":0.8183824623083222},{"content":"Executing","parent":"posts/Goals for Spring Quarter.txt","score":0.8177347150596291},{"content":"I'm borrowing heavily from [[Zen and the Art of Motorcycle Repair]] here, obviously.","parent":"posts/untitled-9-30-2021.txt","score":0.8170123182828641},{"content":"Sometimes, you want multiple paragraphs to be grouped together as if they were one. This might be because you're using new lines for emphasis, rather than as a split between ideas. \n\nTo group multiple paragraphs together, put a ~ before the starting paragraph and another ~ after the ending paragraph.  \n\nThis collection of three paragraphs is an example of how to do that.","parent":"posts/What is Nomad Hypertext.txt","score":0.8168817487823052},{"content":"[[meta-acropolis proof of concept]] Maybe do the demo for [[metaphysics]] instead. It's a subject I actually care about, and I'm taking the course this quarter. Also, I finished number theory last quarter and I have no intention of touching it again if I don't have to. testing edits. 5","parent":"posts/untitled-1-4-2022.txt","score":0.8167884409523942},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8166671776230381},{"content":"This quote reflects a common strain of thinking in Silicon Valley, that our biological selves are hopeless broken, that we need to hack into our brains dopamine-systems and rewire them for maximal productivity, that everything natural is ripe for disruption. This thinking is especially prevalent with the recent rise of PKMs (personal knowledge management systems) like Roam and Notion. Here, an electronic notetaking app is the \"blessed machine\", and your natural memory is the \"flesh that will decay and fail you.\"","parent":"posts/Second Brains.txt","score":0.8143794586493673},{"content":"Code:","parent":"posts/Goals for Spring Quarter.txt","score":0.8143709919826895},{"content":"I'm taking a gap quarter this Spring to work on some personal projects. It is always better to have a plan than to have no plan, even if things don't work out your way, so here are some tentative goals for my gap quarter.","parent":"posts/Goals for Spring Quarter.txt","score":0.8140836497805376},{"content":"That was an interesting reply, and it really got me thinking. She said something along the lines of [[twitter]] being her favorite [[tools for thought]].","parent":"posts/untitled-9-24-2021.txt","score":0.813830911515195},{"content":"The fact that most people interact with computers through web and mobile was not some foregone conclusion. It took serious effort and ingenuity from really smart people to make these platforms accessible to regular people. Once upon a time, filesystems and personal computers were the dominant paradigm of computing, and it was web and mobile that were strange, inaccessible pipe dreams. Increasingly, the opposite is the case.","parent":"posts/The AI-first operating system of the future.txt","score":0.81372877865983},{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8135618415312197},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8134866602495796}],"There are lots of tools for thought out there with names inspired by great empires or their capitals: Roam (Rome) Research, Athens Research, Vienna Hypertext, etc. etc. I like all of these apps and have taken inspiration from them.\n\nBut isn't it strange that they have such imperial names? Tools for thought aren't about hierarchy and order, they're about freeing your thoughts to mingle with each other. It's less about ordering your thoughts into a hierarchical empire, and more about letting them wander freely, so that they might bear fruit. \n\nThat's why I picked the name nomad hypertext. ":[{"content":"There are lots of tools for thought out there with names inspired by great empires or their capitals: Roam (Rome) Research, Athens Research, Vienna Hypertext, etc. etc. I like all of these apps and have taken inspiration from them.\n\nBut isn't it strange that they have such imperial names? Tools for thought aren't about hierarchy and order, they're about freeing your thoughts to mingle with each other. It's less about ordering your thoughts into a hierarchical empire, and more about letting them wander freely, so that they might bear fruit. \n\nThat's why I picked the name nomad hypertext.","parent":"posts/What is Nomad Hypertext.txt","score":1.0000000000000002},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.9151239566033346},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search\nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.8978106699092607},{"content":"I was greatly inspired by two blogposts. The first, [Hyperlink Maximalism](https://thesephist.com/posts/hyperlink/) by Linus Lee talks about generating hyperlinks automatically between documents, and comes with a [demo](https://notation.app) that made a deep impression on me. To be honest, nomad hypertext is just Linus' demo using semantic search instead of full text search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8938355486476679},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8780618250536458},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.8667343820466186},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8627950583454194},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8624226361282945},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.859726370882545},{"content":"However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. \n\nFactoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8590567587884681},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.8581383208936642},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.8536743528038125},{"content":"On the other hand, hypertext is built around the idea of a hyperlink, which is just a link from one document to another. Think about Wikipedia, and how every page is rich with links and connections to other pages. It is incoherent to talk about reading Wikipedia \"from start to end.\" Books create linear paths from A to B, hypertext creates entire worlds ripe for exploration.","parent":"posts/Why I made exegesis.txt","score":0.8534720118602712},{"content":"Of course, this is a bit of a strawman. Nobody who works seriously in [[tools for thought]] really believes that tools for thought are limited to just note taking apps. Still, to the general public, and to casual followers, this seems to be the actual perception. It also seems fair to say that this perception is not entirely misguided - while not all tools for thought are note-taking apps, a disproportionate amount of them are.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8529070854639919},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.851534706717843},{"content":"Why are so many tools for thought note taking apps? How could the space move beyond note taking apps?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8511007935072386},{"content":"As I looked further into these tools, I found that some had taken to calling them [Second Brains](https://fortelabs.co/blog/basboverview/). I thought this was incredibly exciting. The term sounds cyberpunk; building a \"second brain\" sounds way cooler than building a \"note taking app.\" At the same time, something about it unsettled me.","parent":"posts/Second Brains.txt","score":0.8487082827902379},{"content":"In my view, the whole movement of [[tools for thought]] (Roam, personal knowledge management systems, etc, etc.) is to make computers help us think better. That was the point from the very start, it was what Steve Jobs meant when he called the computer \"a bicycle for the mind.\" In the last decade, we've seen the very opposite - the use of the computer as an extractive tool, a weapon to siphon attention and harvest data.","parent":"posts/Controlling what you see.txt","score":0.8486740749672911},{"content":"[[roam]] is a tool for rational thought. More broadly, any tool that subscribes to something like a Zettelkasten or Evergreen notes philosophy is a tool for rational thought. The selling point of a tool for rational thought is to manage knowledge - no wonder, since another commonly used name for these tools is PKM (Personal Knowledge Management).","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8465653479997984},{"content":"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links.","parent":"posts/Plaintext is your best friend.txt","score":0.8454510145969617}],"// Like this! This line will not show up in the index.":[{"content":"// Like this! This line will not show up in the index.","parent":"posts/What is Nomad Hypertext.txt","score":1.0000000000000002},{"content":"// Read this, liked it a lot.","parent":"posts/untitled-9-22-2021.txt","score":0.8624430738951786},{"content":"// 1. SECTION TITLE","parent":"posts/Plaintext is your best friend.txt","score":0.8594923680835932},{"content":"// Edit: 1/6/2021","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8501375681975426},{"content":"// ABOUT THE NAME","parent":"posts/What is Nomad Hypertext.txt","score":0.8453531465341716},{"content":"// SEMANTIC SEARCH IS ALL YOU NEED","parent":"posts/What is Nomad Hypertext.txt","score":0.8414526123288735},{"content":"// Key Features","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8319968365846729},{"content":"// MISTAKE 3: NOT BEING UNIX-PILLED ENOUGH","parent":"posts/The making of Nomad Hypertext.txt","score":0.8307794205048777},{"content":"// FREE AND OPEN SOURCE","parent":"posts/What is Nomad Hypertext.txt","score":0.8268625392736421},{"content":"// MISTAKE 1: JAVASCRIPT INSTEAD OF TYPESCRIPT","parent":"posts/The making of Nomad Hypertext.txt","score":0.8224342149532513},{"content":"// [https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q](https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q)","parent":"posts/untitled-9-22-2021.txt","score":0.8205781321383675},{"content":"// Reflections and originals","parent":"posts/On auteurs and language.txt","score":0.8191179648025417},{"content":"//\t\t\t|\t\t|___Scales to Practice","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8121219650801327},{"content":"// Context","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8120308880474301},{"content":"//\t\t\t|___Music Theory","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8101624253637378},{"content":"// Footnotes","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8093368950206751},{"content":"// Postscript","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8089089995046413},{"content":"// Namespaces","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.807801372945018},{"content":"// HOW TO USE NOMAD HYPERTEXT","parent":"posts/What is Nomad Hypertext.txt","score":0.8075847327569141},{"content":"// Connections","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.806788055148581}],"// ABOUT THE NAME":[{"content":"// ABOUT THE NAME","parent":"posts/What is Nomad Hypertext.txt","score":0.9999999999999998},{"content":"// Edit: 1/6/2021","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8649310341767135},{"content":"// Namespaces","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8572857489557622},{"content":"// 1. SECTION TITLE","parent":"posts/Plaintext is your best friend.txt","score":0.8559337049254032},{"content":"// FREE AND OPEN SOURCE","parent":"posts/What is Nomad Hypertext.txt","score":0.8549289936641548},{"content":"// Like this! This line will not show up in the index.","parent":"posts/What is Nomad Hypertext.txt","score":0.8453531465341716},{"content":"// SEMANTIC SEARCH IS ALL YOU NEED","parent":"posts/What is Nomad Hypertext.txt","score":0.8410314564465311},{"content":"// Read this, liked it a lot.","parent":"posts/untitled-9-22-2021.txt","score":0.8390897589525212},{"content":"// Key Features","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8348055616194804},{"content":"// Context","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8332308586485921},{"content":"// MISTAKE 3: NOT BEING UNIX-PILLED ENOUGH","parent":"posts/The making of Nomad Hypertext.txt","score":0.8316653050824783},{"content":"// [https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q](https://ava.substack.com/p/one-small-thing?token=eyJ1c2VyX2lkIjoxMDUwNzA4NywicG9zdF9pZCI6NDA3ODUwNjgsIl8iOiI4R2RYTiIsImlhdCI6MTYzMjM1NzQxNiwiZXhwIjoxNjMyMzYxMDE2LCJpc3MiOiJwdWItMjM0MTciLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.lHl23vruozg5jSB6kISO4zswiVGojLBM2UkPLlrmx_Q)","parent":"posts/untitled-9-22-2021.txt","score":0.8189126210115544},{"content":"// MISTAKE 1: JAVASCRIPT INSTEAD OF TYPESCRIPT","parent":"posts/The making of Nomad Hypertext.txt","score":0.8176852004473552},{"content":"// Bio pages","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8175081079925439},{"content":"// Community","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8165417968402121},{"content":"// MISTAKE 2: ELECTRON","parent":"posts/The making of Nomad Hypertext.txt","score":0.8124862649483557},{"content":"//\t\t\t|___Practice Routine","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8119403509298383},{"content":"// Connections","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8081879970693161},{"content":"// Long Term goals","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8081277190094033},{"content":"// Technology that controls you","parent":"posts/Giant Robots.txt","score":0.8074967448090685}],"I was greatly inspired by two blogposts. The first, [Hyperlink Maximalism](https://thesephist.com/posts/hyperlink/) by Linus Lee talks about generating hyperlinks automatically between documents, and comes with a [demo](https://notation.app) that made a deep impression on me. To be honest, nomad hypertext is just Linus' demo using semantic search instead of full text search.":[{"content":"I was greatly inspired by two blogposts. The first, [Hyperlink Maximalism](https://thesephist.com/posts/hyperlink/) by Linus Lee talks about generating hyperlinks automatically between documents, and comes with a [demo](https://notation.app) that made a deep impression on me. To be honest, nomad hypertext is just Linus' demo using semantic search instead of full text search.","parent":"posts/What is Nomad Hypertext.txt","score":1.0000000000000002},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.9330681709911436},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.9201685231839369},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search\nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.9126927767642926},{"content":"However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. \n\nFactoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.","parent":"posts/The making of Nomad Hypertext.txt","score":0.897222302727622},{"content":"The second would be [All you need is links](https://subconscious.substack.com/p/all-you-need-is-links) by Gordon Brander. He puts forth the case that you can implement pretty much any feature you might want a tool for thought to have, using only hyperlinks. I found the idea that you could create a myriad of functionality with just one powerful feature extremely fascinating. \n\nWhat he says about links, I believe to be true about semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8941360521364815},{"content":"There are lots of tools for thought out there with names inspired by great empires or their capitals: Roam (Rome) Research, Athens Research, Vienna Hypertext, etc. etc. I like all of these apps and have taken inspiration from them.\n\nBut isn't it strange that they have such imperial names? Tools for thought aren't about hierarchy and order, they're about freeing your thoughts to mingle with each other. It's less about ordering your thoughts into a hierarchical empire, and more about letting them wander freely, so that they might bear fruit. \n\nThat's why I picked the name nomad hypertext.","parent":"posts/What is Nomad Hypertext.txt","score":0.8938355486476679},{"content":"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links.","parent":"posts/Plaintext is your best friend.txt","score":0.8910253298367452},{"content":"On the other hand, hypertext is built around the idea of a hyperlink, which is just a link from one document to another. Think about Wikipedia, and how every page is rich with links and connections to other pages. It is incoherent to talk about reading Wikipedia \"from start to end.\" Books create linear paths from A to B, hypertext creates entire worlds ripe for exploration.","parent":"posts/Why I made exegesis.txt","score":0.8906899432937598},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8830939951497949},{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text.","parent":"posts/What is Nomad Hypertext.txt","score":0.8779396092063506},{"content":"Yurt is a static site generator, built off the same principles as Nomad Hypertext.","parent":"posts/What is Yurt.txt","score":0.8714360979268146},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.8640592360163517},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8624034401145444},{"content":"// HOW TO USE NOMAD HYPERTEXT","parent":"posts/What is Nomad Hypertext.txt","score":0.861444958749235},{"content":"I think eventually, I might want to deploy a blog with a full fledged backend, so users can query anything they'd like to my blog.","parent":"posts/What is Yurt.txt","score":0.8571713611235697},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt.txt","score":0.8542549748255164},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8492068747428096},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8484436874421065},{"content":"1. The current wave of backlink-focused apps have a compelling response to this objection, which is that they're not focused on just copying information, they're focused on capturing the connections between ideas. Fair enough. But why require the end user to manually copy information down? It seems that this could be done more effectively through an annotation layer.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8466743376771872}],"The second would be [All you need is links](https://subconscious.substack.com/p/all-you-need-is-links) by Gordon Brander. He puts forth the case that you can implement pretty much any feature you might want a tool for thought to have, using only hyperlinks. I found the idea that you could create a myriad of functionality with just one powerful feature extremely fascinating. \n\nWhat he says about links, I believe to be true about semantic search. ":[{"content":"The second would be [All you need is links](https://subconscious.substack.com/p/all-you-need-is-links) by Gordon Brander. He puts forth the case that you can implement pretty much any feature you might want a tool for thought to have, using only hyperlinks. I found the idea that you could create a myriad of functionality with just one powerful feature extremely fascinating. \n\nWhat he says about links, I believe to be true about semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.9999999999999998},{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text.","parent":"posts/What is Nomad Hypertext.txt","score":0.897346495962769},{"content":"I was greatly inspired by two blogposts. The first, [Hyperlink Maximalism](https://thesephist.com/posts/hyperlink/) by Linus Lee talks about generating hyperlinks automatically between documents, and comes with a [demo](https://notation.app) that made a deep impression on me. To be honest, nomad hypertext is just Linus' demo using semantic search instead of full text search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8941360521364815},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8800967819642292},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8794474329272655},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8791379402131292},{"content":"\"One of my perennial complaints about the current crop of “tools for thought” has been that most of them aren’t really about thinking per se, just about improving memory. We can take down information into apps like Roam Research or Notion and recall them easily later, but it’s an overstatement to call them tools for thought. Recollection is such a small, basic part of thinking! There is so much more to thinking than simply remembering something accurately. I think we can acknowledge the benefits these apps bring while also admitting that better tools for thought should help us do more with ideas than just remember and recall.\" [[quotes]] [[Linus Lee]] [[tools for thought]]","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8727390900742223},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.870213300739767},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search\nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.8649759709370585},{"content":"However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. \n\nFactoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8639621530792511},{"content":"That leads to a broader question: why is it that most [[tools for thought]] are also seen as \"note taking apps?\" The introduction of [[roam]] research has inspired a number of other products with the same core backlinking functionality - all of which bill themselves as both tools for thought and note taking apps. This implies that tools for thought and notetaking apps are synonymous, but nobody really thinks this; a decent amount of creators in the tools for thought space object to their creations being called \"note taking apps\", and even the ones who self-describe their projects as note taking apps insist that they're more than just that. This makes sense - the term \"[[tools for thought]]\" evokes something incredibly broad and ambitious, while note taking is a mundane (and arduous) activity. Indeed, it'd be a crying shame if tools for thought were limited to just note taking tools.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8614546908541324},{"content":"In [[On tools for thought: knowledge management vs creativity]], I argue that the main value add of [[tools for thought]] is that they enable [[personal-reflection]] and creativity, not that they help us manage knowledge. However, I think to actually capture this potential, [[tools for thought]] have to be social. This will be a big focus for [[exegesis]] moving forwards. [[devlog]]","parent":"posts/untitled-9-24-2021.txt","score":0.861264747602775},{"content":"Tools for creative thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8559277624817785},{"content":"I could instead create all these pages, and tag them with their parents. Then, from the parent note, you would able to see the linked notes (like the sub directories, in a file system).","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8555035515895562},{"content":"On the other hand, hypertext is built around the idea of a hyperlink, which is just a link from one document to another. Think about Wikipedia, and how every page is rich with links and connections to other pages. It is incoherent to talk about reading Wikipedia \"from start to end.\" Books create linear paths from A to B, hypertext creates entire worlds ripe for exploration.","parent":"posts/Why I made exegesis.txt","score":0.8508053836729248},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8504454163219866},{"content":"One of my earliest memories is of my dad showing me Wikipedia - this was before I really started reading real chapter books, and certainly before I started reading nonfiction chapter books. I spent a good deal of my childhood \"link surfing\" on Wikipedia. Every few months, I'd develop a sporadic obsession with a new concept: black holes, DNA, World War II, etc. etc. My guess is that it was this early exposure to hypertext that caused my thinking to become so non-linear.","parent":"posts/Why I made exegesis.txt","score":0.8492965502091484},{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8465829268321472},{"content":"Tools for rational thought","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8454545001004697},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8454477801068799}],"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search\nGives inspiration":[{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search\nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":1},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.9333090191893725},{"content":"I was greatly inspired by two blogposts. The first, [Hyperlink Maximalism](https://thesephist.com/posts/hyperlink/) by Linus Lee talks about generating hyperlinks automatically between documents, and comes with a [demo](https://notation.app) that made a deep impression on me. To be honest, nomad hypertext is just Linus' demo using semantic search instead of full text search.","parent":"posts/What is Nomad Hypertext.txt","score":0.9126927767642926},{"content":"However, when building Yurt, the static site builder for nomad hypertext, I found myself repeating a lot of logic. I found myself wanting to add features to the indexing engine, like being able to use cloud providers instead of local models (because doing all this processing locally can take ages!). In the future, I might want to use multimodal models, so I can see similarity between images, text, and audio. \n\nFactoring out the semantic search element of my app would have been the correct, unix-ey thing to do, and it would allow me to make these extensions in the future. I plan on doing this soon.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8983631716561449},{"content":"There are lots of tools for thought out there with names inspired by great empires or their capitals: Roam (Rome) Research, Athens Research, Vienna Hypertext, etc. etc. I like all of these apps and have taken inspiration from them.\n\nBut isn't it strange that they have such imperial names? Tools for thought aren't about hierarchy and order, they're about freeing your thoughts to mingle with each other. It's less about ordering your thoughts into a hierarchical empire, and more about letting them wander freely, so that they might bear fruit. \n\nThat's why I picked the name nomad hypertext.","parent":"posts/What is Nomad Hypertext.txt","score":0.8978106699092607},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.8846553221868368},{"content":"To be frank, I made some regrettable engineering decisions while making Nomad Hypertext. I built this during my Recurse Center batch and was focused on getting a working prototype out, so some shortcuts were taken. Nevertheless, reflecting back, I would say these shortcuts were not worth it. \n\nThe two big shortcuts I took were using Javascript instead of Typescript and using Electron instead of Tauri.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8750874150049902},{"content":"One last thing: There is a solution that combines the flexibility of plaintext with the aesthetics of rich text - Markdown! I don't think I'll support Markdown formatting in nomad hypertext, but for my static site generator Yurt, I will try to do that in the future. The utility would mostly be from having usable links.","parent":"posts/Plaintext is your best friend.txt","score":0.8651499441965289},{"content":"The second would be [All you need is links](https://subconscious.substack.com/p/all-you-need-is-links) by Gordon Brander. He puts forth the case that you can implement pretty much any feature you might want a tool for thought to have, using only hyperlinks. I found the idea that you could create a myriad of functionality with just one powerful feature extremely fascinating. \n\nWhat he says about links, I believe to be true about semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8649759709370585},{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text.","parent":"posts/What is Nomad Hypertext.txt","score":0.8575354857789923},{"content":"Yurt is a static site generator, built off the same principles as Nomad Hypertext.","parent":"posts/What is Yurt.txt","score":0.8529418886281901},{"content":"// HOW TO USE NOMAD HYPERTEXT","parent":"posts/What is Nomad Hypertext.txt","score":0.8443617091311654},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8442250347348669},{"content":"I think eventually, I might want to deploy a blog with a full fledged backend, so users can query anything they'd like to my blog.","parent":"posts/What is Yurt.txt","score":0.8425891716002534},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8416681291420937},{"content":"The future of rational tools for thought and PKMs probably look a lot less like [[roam]], and [more like projects that use AI to automatically link subjects for you](https://thesephist.com/posts/browser/). 2","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8415071335824871},{"content":"I want this new site to be a space for that.","parent":"posts/Fragments.txt","score":0.837079291296643},{"content":"Here's a radical statement: All applications should be tools for thought. Facebook should be a tool for keeping up with friends, Instagram should be a tool for browsing and sharing photographs. [[tools for thought]] [[Manifesto]]","parent":"posts/Controlling what you see.txt","score":0.836416374048534},{"content":"[[Quine]] believes many different ontologies are worth exploring, and that multiple can be fundamental in their own ways. [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8361604846803226},{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8335264720364189}]}