{"":[{"content":"Building tools","parent":"posts/untitled-9-20-2021.txt","score":0.8593290080388},{"content":"The club does 2 things.","parent":"posts/untitled-9-24-2021.txt","score":0.8589669169415844},{"content":"Induction","parent":"posts/untitled-9-22-2021.txt","score":0.8577220980911441},{"content":"Code:","parent":"posts/Goals for Spring Quarter.txt","score":0.856649564390397},{"content":"Executing","parent":"posts/Goals for Spring Quarter.txt","score":0.8556654491388678},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter.txt","score":0.8537043599402795},{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8514450468005932},{"content":"we live in a society","parent":"posts/untitled-9-30-2021.txt","score":0.8499151373626692},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter.txt","score":0.8497861585687644},{"content":"Learn a grappling art (because of quarantine, this will just be maintaining general fitness levels for now)","parent":"posts/Goals for Spring Quarter.txt","score":0.8496945903933114},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter.txt","score":0.8478182318510581},{"content":"Afternoon","parent":"posts/untitled-9-21-2021.txt","score":0.8472546071060495},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8467379006001533},{"content":"This is for scenarios where you do want to write in an organized manner. For example, right now, this entire page is about","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8466474388580029},{"content":"Focus[[focus]] [[focus-machine]] [[ideas]]","parent":"posts/untitled-9-24-2021.txt","score":0.8456538970968254},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8455300536527719},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8455138568311819},{"content":"I'm taking a gap quarter this Spring to work on some personal projects. It is always better to have a plan than to have no plan, even if things don't work out your way, so here are some tentative goals for my gap quarter.","parent":"posts/Goals for Spring Quarter.txt","score":0.8451682294721505},{"content":"Writing cascades","parent":"posts/untitled-10-1-2021.txt","score":0.8444322593169847},{"content":"Plaintext is your best friend.","parent":"posts/Plaintext is your best friend.txt","score":0.8437967333727141}],"I want to read more. I started reading a lot more in quarantine, but slowed down towards the end of 2020 because I was spending a lot more time on [[exegesis]]. Now that I have more time, I want to start a steady reading habit. The particular corner of [[twitter]] I hang around is fond of citing various philosophers and ideas, many of which I'm interested in, but have never taken the time to study closely. This year, I want to dig deeper into these ideas, go beyond surface-level Twitter philosophy memes and Youtube philosophy videos and read some proper primary sources. Around this time last year, I read Roger Scruton's A very short introduction to Kant. I want to tackle the Critique of Pure Reason sometime this year. I may live-blog my notes on exegesis (though I can't guarantee they'll be very good).":[{"content":"I want to read more. I started reading a lot more in quarantine, but slowed down towards the end of 2020 because I was spending a lot more time on [[exegesis]]. Now that I have more time, I want to start a steady reading habit. The particular corner of [[twitter]] I hang around is fond of citing various philosophers and ideas, many of which I'm interested in, but have never taken the time to study closely. This year, I want to dig deeper into these ideas, go beyond surface-level Twitter philosophy memes and Youtube philosophy videos and read some proper primary sources. Around this time last year, I read Roger Scruton's A very short introduction to Kant. I want to tackle the Critique of Pure Reason sometime this year. I may live-blog my notes on exegesis (though I can't guarantee they'll be very good).","parent":"posts/Reflections for the New Year.txt","score":1},{"content":"My aim in reading [[philosophy]] is more for general intellectual enrichment and to provide insights into my work, not philosophy for its own sake, so I feel fine with reading summaries as opposed to heavy primary literature (except where the primary literature interests me). For thinkers who are influential that don't interest me very much (like Kant), I've found summaries from the very short series and the Stanford Encyclopedia of Philosophy to be very helpful.","parent":"posts/untitled-9-21-2021.txt","score":0.9015920528487116},{"content":"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.","parent":"posts/Reflections for the New Year.txt","score":0.8817859524124787},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter.txt","score":0.8787100313361873},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8781828608663538},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.8769661998264531},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":0.8755933227477786},{"content":"Yesterday I picked up a copy of [[Habermas]], a very short introduction at a used bookstore, because I recognized the name and it was $2.50 (my bookshelf is littered with books I purchased for similar reasons). The last book I read in the series was the very short introduction to Kant by Roger Scruton, which I enjoyed thoroughly.","parent":"posts/untitled-9-21-2021.txt","score":0.8742769577439332},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8682022290557577},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8664209545923157},{"content":"I will write soon about my more long term goals for exegesis - both technical tasks I'd like to get done and my overall vision for the product.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8649098771765993},{"content":"I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.","parent":"posts/Reflections for the New Year.txt","score":0.8624445083186605},{"content":"Finally, I want to take my studies more seriously. Next quarter, I am taking upper division classes on statistics for CS, databases, and information interfaces. I am especially excited about the database class, since database design problems were a big part of what I struggled with while building exegesis. I am also excited about the information interfaces class - exegesis is really just one giant information interface, isn't it? I cannot say I am excited about the stats class, I have never been fond of or good at math, but I will try to brave it with a stiff upper lip. I am considering posting my notes for these classes on [[exegesis]], so I can share them with classmates.","parent":"posts/Reflections for the New Year.txt","score":0.8620156847751825},{"content":"What is the point of exegesis then? The point is serendipity - it's a place for me to capture little scraps of thought - ideas, feelings, anything that comes to you at the moment.","parent":"posts/Second Brains.txt","score":0.8616388833263366},{"content":"I've been reading Betraying Spinoza by Rebecca Goldstein. It's really good so far, an interesting combination of describing Spinoza the person biographically, describing his philosophy, and describing the tensions between those two aims.","parent":"posts/untitled-2-6-2022.txt","score":0.8606305353275987},{"content":"The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well.","parent":"posts/Goals for Spring Quarter.txt","score":0.859038883550422},{"content":"What do I use [[exegesis]] for? I use it like a journal. I write down thoughts about my life, ideas that I have, things that I'd like to do, reflections on my day, etc. etc. None of these things could be called knowledge, none of them could be called rational.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8588112088892039},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8583812195329045},{"content":"[https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/](https://www.davidbcalhoun.com/2016/quine-and-heidegger-against-reductionism/) [[reading-list]] [[metaphysics]]","parent":"posts/untitled-1-4-2022.txt","score":0.8566824908254376},{"content":"My favorite use of [[exegesis]] is to write down ideas that I have. I write about exegesis in exegesis, and a lot of features that I've added to exegesis started as sudden thoughts that were captured in exegesis. In my experience, ideas are like seeds, and writing them down helps them grow. I might think nothing of a simple idea I capture one day, but a week later it might have renewed significance, and it could even spark new ideas.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8565934553366226}],"I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.":[{"content":"I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.","parent":"posts/Reflections for the New Year.txt","score":1},{"content":"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]]","parent":"posts/untitled-9-20-2021.txt","score":0.9009356527865816},{"content":"To make regular progress towards personal projects, I'll be writing more on my development progress with [[exegesis]], under the tag [[devlog]]. I'll also be publishing another post soon on my plans for future features, and when I expect to release them by. I will do something similar with my other projects.","parent":"posts/Goals for Spring Quarter.txt","score":0.8978736759469089},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8973004712188722},{"content":"Working on exegesis was a grueling affair at times. I rewrote the schema multiple times, rewrote the backend from scratch 2 months before release, chased countless UI bugs, and manually patched abandoned NPM packages. Part of it may have been due to my inexperience, but [working with ](https://nichwch.medium.com/making-yana-e3fade3f56e7)[rich text](https://medium.engineering/why-contenteditable-is-terrible-122d8a40e480) is just a [difficult task](https://twitter.com/thesephist/status/1360298464349999108), period. At one point, I considered giving up after finding a rival writing app I thought I simply couldn't compete with - I have a copy of an unfinished essay I started writing on why I had given up tucked away somewhere.","parent":"posts/Prometheus.txt","score":0.8965715542855852},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter.txt","score":0.8955161191869158},{"content":"I'm using the terms 'alpha release' and 'beta release' here very roughly. That being said, my definition of a 'beta release' is something I consider 'full featured', whereas my conditions for an 'alpha release' were 'barely functional.' I set a deadline of new year's for the alpha release and barely made it. While exegesis is totally usable right now, there are a couple of features that it's lacking that I would like to patch before trying to onboard more users. Put another way, the 'beta release' is when I will feel comfortable enough with the product that I will dedicate time to promoting and marketing it to people.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.889410954525598},{"content":"I will write soon about my more long term goals for exegesis - both technical tasks I'd like to get done and my overall vision for the product.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8850831566099464},{"content":"If exegesis had image support, I'd draw a mockup, but alas we're not there yet.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8842348650408841},{"content":"This was reassuring, because it meant I had made something genuinely useful. In the past, I have made things I simply had no desire to use - one example is [JAFT](https://nichwch.medium.com/what-is-jaft-f543a4fad9d7), a time tracking app I made after making YANA (the predecessor to exegesis). I stopped using it after a bit, and didn't bother renewing the domain. I don't miss JAFT at all. The fact that I did miss exegesis on the days where it wasn't operational was a good sign.","parent":"posts/Second Brains.txt","score":0.881887426188904},{"content":"I have decided to remove namespaces from the list of features to have implemented before beta. The thinking is that this feature will only really be useful to people that have used exegesis for a while, and will not make that much of an impact for new users. I still plan on implementing it, but it will be after the beta release. I have included the original description of the feature below.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8818388656913692},{"content":"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.","parent":"posts/Reflections for the New Year.txt","score":0.8811835153141336},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.8811412849019897},{"content":"exegesis as crm [[exegesis]] [[ideas]]","parent":"posts/untitled-9-20-2021.txt","score":0.879337016602684},{"content":", but it'd be terribly tedious to highlight the entire thing to tag it exegesis (not to mention, since overlapping tags are not supported, this would stop you from adding tags to smaller segments). It would be nice to be able to simply tag this page 'exegesis' and have it show up when filtering for the exegesis tag.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.878003874673183},{"content":"I've found writing down tasks and decomposing them into smaller ones helps. Right now, I do this in [[exegesis]], which honestly feels somewhat suboptimal. I also have another side project called [https://focusmachine.app/](https://focusmachine.app/) to remind me of what I'm currently supposed to be focusing - it's really stupid, it just asks you what you want to work on and then spams you with a reminder to focus on that at user-inputted interval. [[focus]] [[focus-machine]] [[ideas]] [[exegesis]]","parent":"posts/untitled-9-24-2021.txt","score":0.8744979339616088},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8739975818833831},{"content":"exegesis has taken about a year to make. Including the development of its predecessor, YANA, it's taken about a year and a half. When I started making YANA the summer after my freshman year, I thought it'd be a small project; just a little utility for me to track my thoughts. I had no idea it'd balloon into such a large endeavor.","parent":"posts/Reflections on exegesis.txt","score":0.8738686026498178},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":0.8734707067265912},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8731467263882238}],"I want to get better at music. I went to [[piano]] classes as a kid and never really enjoyed them or took them seriously. Now I regret it. I also picked up guitar over quarantine, and want to get into a regular practice regimen for both of these instruments. For piano, I want to learn jazz, and how to improvise - I can't say I have much interest in building up my classical repertoire. For guitar, my current plan is to learn the blues, because I hear that's the root of many musical genres, and maybe branch off into rock or jazz later. A short term goal for both instruments is to familiarize myself with their scales. ":[{"content":"I want to get better at music. I went to [[piano]] classes as a kid and never really enjoyed them or took them seriously. Now I regret it. I also picked up guitar over quarantine, and want to get into a regular practice regimen for both of these instruments. For piano, I want to learn jazz, and how to improvise - I can't say I have much interest in building up my classical repertoire. For guitar, my current plan is to learn the blues, because I hear that's the root of many musical genres, and maybe branch off into rock or jazz later. A short term goal for both instruments is to familiarize myself with their scales.","parent":"posts/Reflections for the New Year.txt","score":1},{"content":"I have not really settled into a good practice schedule for either piano or guitar. For the past couple of weeks, I've neglected guitar after moving my electric keyboard into my room, though my piano progress has hardly been good either - I have spent the past couple months playing the same pentatonic licks over Autumn Leaves. My goal for both instruments is to learn a couple of jazz standards with my housemates so we can jam together more.","parent":"posts/Goals for Spring Quarter.txt","score":0.9293824104454254},{"content":"As far as a schedule goes, I'd like to learn something new on the piano/guitar (either online lessons or part of a song) at least twice a week (for each instrument). Noodling doesn't count towards this goal. For the harmonica, I'm working my way through some Youtube course I found, and I'd like to work through at least one lesson a week.","parent":"posts/Goals for Spring Quarter.txt","score":0.8854718991347181},{"content":"I fell in love with playing the guitar because it rewards this lack of an attention span. You can copy a riff in minutes. You can create a new riff in minutes. Picking up a guitar puts me in an instant flow state, because I can just screw around and play with ideas instantly. It feels like a REPL for musical ideas.","parent":"posts/Fragments.txt","score":0.8833433637071413},{"content":"Get good at guitar","parent":"posts/Goals for Spring Quarter.txt","score":0.8812713377735981},{"content":"Whether its noticing that two songs use the same chord progression, stealing a nice lick from your favorite blues guitarist, making a mashup of two of your favorite songs, or translating a song into a different genre, playing music is all about making connections. Unfortunately, the way we listen to music prevents us from doing this.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.8778388609996745},{"content":"The compromise that I've arrived at, and that I've tried so far with a decent amount of success, is to draw with my preferred medium (pen), in my own style, while also using a reference. I use the reference for the pose and some of the details, and use my imagination to make up the rest. This is infinitely more interesting for me, and doesn't feel like a dreary technical exercise. I've also given up on using pencil, or charcoal, or anything except pen. I used to harbor a lot of guilt over this, because shouldn't an artist be able to use any medium? Of course, this is ridiculous, it'd be like asking a musician to be familiar with every instrument. It makes far more sense to get really good with one medium than to be mediocre with multiple (feeling some cognitive dissonance here with my desire to learn both the [[piano]] and the [[guitar]]...). Of course, professional artists (and musicians) really should be learning multiple mediums, but I have no aspiration to be professional at either, only to have some fun. [[drawing]] [[piano]] [[guitar]]","parent":"posts/Reflections for the New Year.txt","score":0.8736076157999383},{"content":"Learn guitar at least 2 times a week","parent":"posts/Goals for Spring Quarter.txt","score":0.8696180290177934},{"content":"Get good at piano","parent":"posts/Goals for Spring Quarter.txt","score":0.8695871047689797},{"content":"This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year.","parent":"posts/Reflections for the New Year.txt","score":0.8615998843500813},{"content":"Learn piano at least 2 times a week","parent":"posts/Goals for Spring Quarter.txt","score":0.8557576760351095},{"content":"Here's an anecdote to illustrate my point: I picked up guitar at the start of quarantine. What inspired this? Was it a childhood dream of mine? Maybe I wanted to be like my favorite rock stars? Or was it just the boredom?","parent":"posts/Giant Robots.txt","score":0.8540152000639926},{"content":"I received a harmonica for my birthday. So far, I can play Oh Susannah, but I'd like to learn more.","parent":"posts/Goals for Spring Quarter.txt","score":0.8518549114403992},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter.txt","score":0.842989936745586},{"content":"Listening to music","parent":"posts/untitled-9-21-2021.txt","score":0.8421645505237857},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots.txt","score":0.8406791600466257},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8321554061860953},{"content":"Listening to [[music]] can either be a great aid to [[focus]], or a huge impediment. Sometimes it helps me get in the zone. When it happens, usually the music fades into the background and I'm not even noticing it - this is the sweet spot for focus. Music that I like too much actually distracts me, and music that I don't like enough bores me and I end up wasting time switching what music I listen to. Working without music doesn't seem to be an option at all. I hope maybe [[synesthesia]] will help change my music listening habits? [[personal-reflection]]","parent":"posts/untitled-9-21-2021.txt","score":0.8312531468960009},{"content":"I want to improve at drawing. Drawing is something I've always loved doing, my notebooks from middle school and high school have more doodles in them than proper notes. I never took it particularly seriously, and when life got busy, I'd stop drawing for months on end. However, when I returned, it was always still fun. In fact, every time I've tried to get into \"regular\" drawing practice, it's always been miserable. There's some strange effect here where the longer I go without drawing, the better my drawings tend to be, as if drawing ability were a fixed resource that took time to build up. [[drawing]]","parent":"posts/Reflections for the New Year.txt","score":0.8308219589335551},{"content":"Fast Jazz","parent":"posts/untitled-9-24-2021.txt","score":0.8261962651393229}],"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.":[{"content":"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.","parent":"posts/Reflections for the New Year.txt","score":1.0000000000000002},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter.txt","score":0.9145660614426169},{"content":"The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well.","parent":"posts/Goals for Spring Quarter.txt","score":0.9020404593410896},{"content":"In [[Reflections for the New Year]], I outlined some things I wanted to get done this year. In no particular order, my goals were to:","parent":"posts/Goals for Spring Quarter.txt","score":0.9016968026595494},{"content":"I will write soon about my more long term goals for exegesis - both technical tasks I'd like to get done and my overall vision for the product.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8963144370683301},{"content":"exegesis has taken about a year to make. Including the development of its predecessor, YANA, it's taken about a year and a half. When I started making YANA the summer after my freshman year, I thought it'd be a small project; just a little utility for me to track my thoughts. I had no idea it'd balloon into such a large endeavor.","parent":"posts/Reflections on exegesis.txt","score":0.8959490357225816},{"content":"To make regular progress towards personal projects, I'll be writing more on my development progress with [[exegesis]], under the tag [[devlog]]. I'll also be publishing another post soon on my plans for future features, and when I expect to release them by. I will do something similar with my other projects.","parent":"posts/Goals for Spring Quarter.txt","score":0.8922548608400528},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.8871434931888685},{"content":"This was reassuring, because it meant I had made something genuinely useful. In the past, I have made things I simply had no desire to use - one example is [JAFT](https://nichwch.medium.com/what-is-jaft-f543a4fad9d7), a time tracking app I made after making YANA (the predecessor to exegesis). I stopped using it after a bit, and didn't bother renewing the domain. I don't miss JAFT at all. The fact that I did miss exegesis on the days where it wasn't operational was a good sign.","parent":"posts/Second Brains.txt","score":0.8830692095708935},{"content":"My favorite use of [[exegesis]] is to write down ideas that I have. I write about exegesis in exegesis, and a lot of features that I've added to exegesis started as sudden thoughts that were captured in exegesis. In my experience, ideas are like seeds, and writing them down helps them grow. I might think nothing of a simple idea I capture one day, but a week later it might have renewed significance, and it could even spark new ideas.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8824125090066202},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":0.8818255895457385},{"content":"I want to read more. I started reading a lot more in quarantine, but slowed down towards the end of 2020 because I was spending a lot more time on [[exegesis]]. Now that I have more time, I want to start a steady reading habit. The particular corner of [[twitter]] I hang around is fond of citing various philosophers and ideas, many of which I'm interested in, but have never taken the time to study closely. This year, I want to dig deeper into these ideas, go beyond surface-level Twitter philosophy memes and Youtube philosophy videos and read some proper primary sources. Around this time last year, I read Roger Scruton's A very short introduction to Kant. I want to tackle the Critique of Pure Reason sometime this year. I may live-blog my notes on exegesis (though I can't guarantee they'll be very good).","parent":"posts/Reflections for the New Year.txt","score":0.8817859524124787},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.8811848460789857},{"content":"I want to continue working on [[exegesis]]. There are still a plethora of features I want to build into the app. I have wanted to build something like this for a long time - I sort of did with my last project [YANA](https://yananotes.com/), but the core text engine was so limited that I had to start over from scratch (the product of which is exegesis). I want to sort out a formal list of features before a beta release, and an eventual public release. I will probably use exegesis as a devlog of sorts as well.","parent":"posts/Reflections for the New Year.txt","score":0.8811835153141336},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8786022342866371},{"content":"I had some interesting ideas this morning on exegesis. The future of [[tools for thought]] should be social, and maybe people and profiles should be first order features in exegesis. Let me clarify what I mean by this. Right now, exegesis' model is very simple: you have pages, and you have tags that you can apply to pages and parts of pages. If there's a tag that has the same title as a page, clicking the tag will lead you to the page, and the page will show everywhere it's been linked. Simple, basic, backlinking. [[exegesis]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8783363351761782},{"content":"Why did it take so long? Part of it is just a lack of experience. While making exegesis, I changed the database schema countless times, wrote dozens of migrations, accidentally wiped my database once (thank God for RDS backups), and rewrote the backend from scratch 2 months before release. There was also a good amount of feature creep. Whenever I thought I was close to finished, something unexpected would pop up - I started writing this essay 3 months before I actually released exegesis. Whatever the reason, if you count development time on the predecessor to exegesis, I've spent almost a tenth of my life building this. The entire project clocks in at a couple thousand lines of code. It is the largest, most complex, and most difficult thing I have built so far in my life.  [The last time I worked on a project this long, it was the first video game I made back in my senior year of high school.](https://medium.com/@nichwch/machine-gods-devlog-1-166dff474366) Even then, it was really about 6 months of development total, with a huge gap in between because of school, and it was all made with no-code game development tools, because back then the idea of using actual code terrified me. [[exegesis]] [[personal-reflection]]","parent":"posts/Reflections on exegesis.txt","score":0.8755745007147839},{"content":"Finally, I want to take my studies more seriously. Next quarter, I am taking upper division classes on statistics for CS, databases, and information interfaces. I am especially excited about the database class, since database design problems were a big part of what I struggled with while building exegesis. I am also excited about the information interfaces class - exegesis is really just one giant information interface, isn't it? I cannot say I am excited about the stats class, I have never been fond of or good at math, but I will try to brave it with a stiff upper lip. I am considering posting my notes for these classes on [[exegesis]], so I can share them with classmates.","parent":"posts/Reflections for the New Year.txt","score":0.8749829386969963},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8740333977294761},{"content":"In some sense exegesis gave birth to itself, because I used it to organize my ideas about exegesis. On days where exegesis was not working because I had broken something while coding it, I noticed that I could not think as clearly. Its absence was felt.","parent":"posts/Second Brains.txt","score":0.8724691940282322}],"I want to learn a grappling art, preferable Judo or BJJ. I was part of my university's boxing club freshman year, and enjoyed it a lot, especially sparring. However, the risk of head trauma is not something I'm willing to risk in the long term. I hope a grappling art can capture the thrill of combat boxing brings without the risk of head trauma. Of course, there is an increased risk of joint damage instead, which is itself nothing to scoff at, but I'm willing to risk that much more than I am willing to risk brain injury. Between Judo and BJJ, I hear BJJ is much more 'practical', at least in an MMA context, but I find Judo throws to be so aesthetically pleasing. Of course, I can't do any of this until quarantine is over, so in the meantime I want to maintain a good level of fitness so I'll be ready. ":[{"content":"I want to learn a grappling art, preferable Judo or BJJ. I was part of my university's boxing club freshman year, and enjoyed it a lot, especially sparring. However, the risk of head trauma is not something I'm willing to risk in the long term. I hope a grappling art can capture the thrill of combat boxing brings without the risk of head trauma. Of course, there is an increased risk of joint damage instead, which is itself nothing to scoff at, but I'm willing to risk that much more than I am willing to risk brain injury. Between Judo and BJJ, I hear BJJ is much more 'practical', at least in an MMA context, but I find Judo throws to be so aesthetically pleasing. Of course, I can't do any of this until quarantine is over, so in the meantime I want to maintain a good level of fitness so I'll be ready.","parent":"posts/Reflections for the New Year.txt","score":0.9999999999999999},{"content":"Learn a grappling art (because of quarantine, this will just be maintaining general fitness levels for now)","parent":"posts/Goals for Spring Quarter.txt","score":0.9214956638859074},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter.txt","score":0.8324224928969285},{"content":"I want to improve at drawing. Drawing is something I've always loved doing, my notebooks from middle school and high school have more doodles in them than proper notes. I never took it particularly seriously, and when life got busy, I'd stop drawing for months on end. However, when I returned, it was always still fun. In fact, every time I've tried to get into \"regular\" drawing practice, it's always been miserable. There's some strange effect here where the longer I go without drawing, the better my drawings tend to be, as if drawing ability were a fixed resource that took time to build up. [[drawing]]","parent":"posts/Reflections for the New Year.txt","score":0.8180037307103473},{"content":"That being said, I think I've figured out a different drawing routine that will work this time. Past practice routines always centered around trying to copy other people's art, or doing realistic sketches/pose practice in pencil. I enjoy drawing without references the most, making things up as I go. Drawing from a reference is always boring and dreary for me. However, there's really no way to improve without using references. This is especially true since my biggest drawing deficiencies are not being able to draw people's faces well, portraying 3D shapes in a non-flat way, shading/cross-hatching, and posing figures naturally.[[drawing]]","parent":"posts/Reflections for the New Year.txt","score":0.8174136843698556},{"content":"The compromise that I've arrived at, and that I've tried so far with a decent amount of success, is to draw with my preferred medium (pen), in my own style, while also using a reference. I use the reference for the pose and some of the details, and use my imagination to make up the rest. This is infinitely more interesting for me, and doesn't feel like a dreary technical exercise. I've also given up on using pencil, or charcoal, or anything except pen. I used to harbor a lot of guilt over this, because shouldn't an artist be able to use any medium? Of course, this is ridiculous, it'd be like asking a musician to be familiar with every instrument. It makes far more sense to get really good with one medium than to be mediocre with multiple (feeling some cognitive dissonance here with my desire to learn both the [[piano]] and the [[guitar]]...). Of course, professional artists (and musicians) really should be learning multiple mediums, but I have no aspiration to be professional at either, only to have some fun. [[drawing]] [[piano]] [[guitar]]","parent":"posts/Reflections for the New Year.txt","score":0.8148985199562464},{"content":"Get better at drawing","parent":"posts/Goals for Spring Quarter.txt","score":0.8127505153387697},{"content":"Growing up, my main creative outlet was drawing. As soon as a pencil or pen touched my hand I would have to draw something - it was almost involuntary. Many school notebooks were ruined this way, many concerned teachers advised me to keep my homework free of doodles.","parent":"posts/Fragments.txt","score":0.8111038533710383},{"content":"I'm borrowing heavily from [[Zen and the Art of Motorcycle Repair]] here, obviously.","parent":"posts/untitled-9-30-2021.txt","score":0.8099317453338392},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8097522527564952},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter.txt","score":0.8048713845399924}],"That being said, I think I've figured out a different drawing routine that will work this time. Past practice routines always centered around trying to copy other people's art, or doing realistic sketches/pose practice in pencil. I enjoy drawing without references the most, making things up as I go. Drawing from a reference is always boring and dreary for me. However, there's really no way to improve without using references. This is especially true since my biggest drawing deficiencies are not being able to draw people's faces well, portraying 3D shapes in a non-flat way, shading/cross-hatching, and posing figures naturally.[[drawing]] ":[{"content":"That being said, I think I've figured out a different drawing routine that will work this time. Past practice routines always centered around trying to copy other people's art, or doing realistic sketches/pose practice in pencil. I enjoy drawing without references the most, making things up as I go. Drawing from a reference is always boring and dreary for me. However, there's really no way to improve without using references. This is especially true since my biggest drawing deficiencies are not being able to draw people's faces well, portraying 3D shapes in a non-flat way, shading/cross-hatching, and posing figures naturally.[[drawing]]","parent":"posts/Reflections for the New Year.txt","score":0.9999999999999999},{"content":"I want to improve at drawing. Drawing is something I've always loved doing, my notebooks from middle school and high school have more doodles in them than proper notes. I never took it particularly seriously, and when life got busy, I'd stop drawing for months on end. However, when I returned, it was always still fun. In fact, every time I've tried to get into \"regular\" drawing practice, it's always been miserable. There's some strange effect here where the longer I go without drawing, the better my drawings tend to be, as if drawing ability were a fixed resource that took time to build up. [[drawing]]","parent":"posts/Reflections for the New Year.txt","score":0.9346694484193044},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter.txt","score":0.9182875636399592},{"content":"The compromise that I've arrived at, and that I've tried so far with a decent amount of success, is to draw with my preferred medium (pen), in my own style, while also using a reference. I use the reference for the pose and some of the details, and use my imagination to make up the rest. This is infinitely more interesting for me, and doesn't feel like a dreary technical exercise. I've also given up on using pencil, or charcoal, or anything except pen. I used to harbor a lot of guilt over this, because shouldn't an artist be able to use any medium? Of course, this is ridiculous, it'd be like asking a musician to be familiar with every instrument. It makes far more sense to get really good with one medium than to be mediocre with multiple (feeling some cognitive dissonance here with my desire to learn both the [[piano]] and the [[guitar]]...). Of course, professional artists (and musicians) really should be learning multiple mediums, but I have no aspiration to be professional at either, only to have some fun. [[drawing]] [[piano]] [[guitar]]","parent":"posts/Reflections for the New Year.txt","score":0.9165880878970347},{"content":"Get better at drawing","parent":"posts/Goals for Spring Quarter.txt","score":0.9004114520669223},{"content":"Practice drawing 3 times a week","parent":"posts/Goals for Spring Quarter.txt","score":0.8816493257011863},{"content":"Growing up, my main creative outlet was drawing. As soon as a pencil or pen touched my hand I would have to draw something - it was almost involuntary. Many school notebooks were ruined this way, many concerned teachers advised me to keep my homework free of doodles.","parent":"posts/Fragments.txt","score":0.8706340768618905},{"content":"There was a problem with both of these outlets, however: my short attention span. I struggled to work on larger drawings, because I'd give up on them and start new doodles. The same happened with code projects.","parent":"posts/Fragments.txt","score":0.8511018617999383},{"content":"In my teen years, I found programming and videogame development, and that became my creative outlet for a while. I found a way to scan my drawings into digital files, and for a while that was my way of combining art and programming.","parent":"posts/Fragments.txt","score":0.8355604555580357},{"content":"If exegesis had image support, I'd draw a mockup, but alas we're not there yet.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8340387678442959},{"content":"For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8325763458634607},{"content":"Working on a refactor for [[exegesis]] and [[synesthesia]], thinking about how to budget time. Working strategy is to take estimate for each feature, and double the time for each to account for stupid roadblocks (wifi not working, interrupted by something, bad documentation, etc. etc.) [[code]] [[devlog]]","parent":"posts/untitled-9-21-2021.txt","score":0.8315932136487142},{"content":"These are my hobbies that I use to take a break from code related creative-work.","parent":"posts/Goals for Spring Quarter.txt","score":0.8314766299121181},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8313138521623032},{"content":"Learn a grappling art (because of quarantine, this will just be maintaining general fitness levels for now)","parent":"posts/Goals for Spring Quarter.txt","score":0.8309898720966917},{"content":"I'm borrowing heavily from [[Zen and the Art of Motorcycle Repair]] here, obviously.","parent":"posts/untitled-9-30-2021.txt","score":0.8295845392122487},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8257802067805378},{"content":"I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.","parent":"posts/Fragments.txt","score":0.8245531551534747},{"content":"I have not really settled into a good practice schedule for either piano or guitar. For the past couple of weeks, I've neglected guitar after moving my electric keyboard into my room, though my piano progress has hardly been good either - I have spent the past couple months playing the same pentatonic licks over Autumn Leaves. My goal for both instruments is to learn a couple of jazz standards with my housemates so we can jam together more.","parent":"posts/Goals for Spring Quarter.txt","score":0.8233570154213101},{"content":"This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year.","parent":"posts/Reflections for the New Year.txt","score":0.8207156659572767}],"I want to learn more code. Working on [[exegesis]] over the course of a year, I saw my coding ability improve substantially. Towards the last 2 months, while rewriting a part of the codebase, I found myself dumbfounded by some of the decisions and patterns I had used a year earlier. The code I wrote towards the end was noticeably cleaner and more maintainable, mostly because I had familiarized myself with [[React]] hooks. Learning NextJS and GraphQL was also very rewarding, and both technologies were used extensively in the final version of exegesis. Looking forwards, I am thinking about learning Go, Clojure and maybe Rust. Go is the most practical one of all these for my purposes, and could open up a lot of job offers. Clojure is the most interesting from a theoretical standpoint, since I've never used a lisp or functional language. Rust is interesting because I hate systems/low-level programming, but I suspect that might only be because I hate C, and maybe Rust's more modern features will sell me on it. ":[{"content":"I want to learn more code. Working on [[exegesis]] over the course of a year, I saw my coding ability improve substantially. Towards the last 2 months, while rewriting a part of the codebase, I found myself dumbfounded by some of the decisions and patterns I had used a year earlier. The code I wrote towards the end was noticeably cleaner and more maintainable, mostly because I had familiarized myself with [[React]] hooks. Learning NextJS and GraphQL was also very rewarding, and both technologies were used extensively in the final version of exegesis. Looking forwards, I am thinking about learning Go, Clojure and maybe Rust. Go is the most practical one of all these for my purposes, and could open up a lot of job offers. Clojure is the most interesting from a theoretical standpoint, since I've never used a lisp or functional language. Rust is interesting because I hate systems/low-level programming, but I suspect that might only be because I hate C, and maybe Rust's more modern features will sell me on it.","parent":"posts/Reflections for the New Year.txt","score":0.9999999999999998},{"content":"The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well.","parent":"posts/Goals for Spring Quarter.txt","score":0.8783799144391577},{"content":"I opted to use Javascript instead of Typescript out of mix of curiosity and laziness. Like most people, I was introduced to Javascript before I was introduced to Typescript. Like most people, I suffered through many null errors and was relieved when I discovered that the Typescript compiler could save me from many of them. Like most people, though I am grateful for Typescript, I find it occasionally cumbersome.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8752240958398452},{"content":"Learn more code (new languages, new frameworks, new databases, fancy tech like blockchain and ML, etc. etc.)","parent":"posts/Goals for Spring Quarter.txt","score":0.8743806249150559},{"content":"Learning Javascript, I never took notes, because all the reference docs were online anyways. Besides, the difficult part of programming isn't remembering APIs, it's the process of taking an idea and building it out, and there's no way to get better at that except by building. There's a reason most university CS courses don't test memorization heavily and instead focus on having students build projects. I suspect this is true for a lot of subjects.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8676263488307266},{"content":"This is not the case for programming. Making better tools for programming (new languages, new frameworks, new libraries) itself requires programming, and while making programming tools is different in important respects from writing regular programs, it is still programming. Making guitars is not playing guitars, making paints is not painting, but making better programming tools is programming. Programming, then, is an, intrinsically recursive creative medium.","parent":"posts/Prometheus.txt","score":0.864737499590764},{"content":"These are my hobbies that I use to take a break from code related creative-work.","parent":"posts/Goals for Spring Quarter.txt","score":0.8626215241654147},{"content":"I want to clarify that I'm not bullish at all on no-code. I think \"no-code\" and \"low-code\" are the wrong way to frame things. There is a place for tools like this, but it's more productive to think of them as \"visual developer tools.\"[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8606351314275258},{"content":"Working on exegesis was a grueling affair at times. I rewrote the schema multiple times, rewrote the backend from scratch 2 months before release, chased countless UI bugs, and manually patched abandoned NPM packages. Part of it may have been due to my inexperience, but [working with ](https://nichwch.medium.com/making-yana-e3fade3f56e7)[rich text](https://medium.engineering/why-contenteditable-is-terrible-122d8a40e480) is just a [difficult task](https://twitter.com/thesephist/status/1360298464349999108), period. At one point, I considered giving up after finding a rival writing app I thought I simply couldn't compete with - I have a copy of an unfinished essay I started writing on why I had given up tucked away somewhere.","parent":"posts/Prometheus.txt","score":0.8586627742950396},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter.txt","score":0.8559314580434614},{"content":"Why did it take so long? Part of it is just a lack of experience. While making exegesis, I changed the database schema countless times, wrote dozens of migrations, accidentally wiped my database once (thank God for RDS backups), and rewrote the backend from scratch 2 months before release. There was also a good amount of feature creep. Whenever I thought I was close to finished, something unexpected would pop up - I started writing this essay 3 months before I actually released exegesis. Whatever the reason, if you count development time on the predecessor to exegesis, I've spent almost a tenth of my life building this. The entire project clocks in at a couple thousand lines of code. It is the largest, most complex, and most difficult thing I have built so far in my life.  [The last time I worked on a project this long, it was the first video game I made back in my senior year of high school.](https://medium.com/@nichwch/machine-gods-devlog-1-166dff474366) Even then, it was really about 6 months of development total, with a huge gap in between because of school, and it was all made with no-code game development tools, because back then the idea of using actual code terrified me. [[exegesis]] [[personal-reflection]]","parent":"posts/Reflections on exegesis.txt","score":0.8554242995107059},{"content":"In any case I wanted to try something new because that's what Recurse is all about, so I tried making a project with just JS and JSDoc for some semblance of type safety.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8552024301844935},{"content":"I read Rich Harris' twitter thread on how Javascript with JSDoc is actually pretty good, and decided to give it a shot. To be clear, I'm not blaming Rich Harris for my choice - he qualified his point, saying JS with JSDoc is preferable to Typescript for library development, because not having an intermediate build step makes it easier to reproduce bugs in a REPL. He still recommends using Typescript for projects (I think), so I was acting against his advice here.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8532930485375612},{"content":"This was reassuring, because it meant I had made something genuinely useful. In the past, I have made things I simply had no desire to use - one example is [JAFT](https://nichwch.medium.com/what-is-jaft-f543a4fad9d7), a time tracking app I made after making YANA (the predecessor to exegesis). I stopped using it after a bit, and didn't bother renewing the domain. I don't miss JAFT at all. The fact that I did miss exegesis on the days where it wasn't operational was a good sign.","parent":"posts/Second Brains.txt","score":0.8530314875641559},{"content":"The results were... mixed. I did get to move faster at the start, but started running into more and more type-related bugs as development went on. If I were to do this project again, I'd stick to Typescript.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8529366514478323},{"content":"That last project had a significant effect on me. Back in high school, I was heavily involved in Model UN and other political clubs. Making the [game](https://nichwch.itch.io/machinegods) made me realize it was making things and not winning arguments that really made me happier. It was also what convinced me that programming could be something more than rote problem solving, and even be a genuine creative medium. It was why I switched my major from Economics to Computer Science in college.[[personal-reflection]]","parent":"posts/Reflections on exegesis.txt","score":0.8528761799326172},{"content":"I desperately want programming to feel like this.","parent":"posts/Fragments.txt","score":0.8513476534400438},{"content":"For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.8508197191296287},{"content":"I avoided this IPC-executable approach because I thought it'd be really complicated. To some extent, this was the correct decision - I'm glad I got a MVP of my project out during my time at Recurse.","parent":"posts/The making of Nomad Hypertext.txt","score":0.8505137613699641},{"content":"To make regular progress towards personal projects, I'll be writing more on my development progress with [[exegesis]], under the tag [[devlog]]. I'll also be publishing another post soon on my plans for future features, and when I expect to release them by. I will do something similar with my other projects.","parent":"posts/Goals for Spring Quarter.txt","score":0.8501740131390558}],"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this. ":[{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":1},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.9168586558988778},{"content":"I will write soon about my more long term goals for exegesis - both technical tasks I'd like to get done and my overall vision for the product.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.9148932346181599},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.9111204891428577},{"content":"My favorite use of [[exegesis]] is to write down ideas that I have. I write about exegesis in exegesis, and a lot of features that I've added to exegesis started as sudden thoughts that were captured in exegesis. In my experience, ideas are like seeds, and writing them down helps them grow. I might think nothing of a simple idea I capture one day, but a week later it might have renewed significance, and it could even spark new ideas.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.902496731225661},{"content":"What do I use [[exegesis]] for? I use it like a journal. I write down thoughts about my life, ideas that I have, things that I'd like to do, reflections on my day, etc. etc. None of these things could be called knowledge, none of them could be called rational.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.899740689862063},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter.txt","score":0.8973679325455736},{"content":"If I start an exegesis brain dump (what I call my [[journal]] entries when I post them to twitter) and post it, it makes me more likely to continue writing in it throughout the day. Once I start writing, more thoughts and ideas come to me. It's as if my brain suddenly realizes there's an outlet for thoughts, and so it generates more of them. Having good conversations has a similar effect. [[writing]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8955410002462297},{"content":"On the other hand, creative tools for thought are by definition focused on something you could never find on Google - your ideas and experiences. If you want to link your life experiences to your ideas and other content, you're going to have to write it down. For this reason, I think the future of backlink focused writing apps should be focused on creative output, not Personal Knowledge Management. It's the direction I'll be taking [[exegesis]] in the future.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8943554384333204},{"content":"Exegesis is the Apple Notes to Roam Research's Microsoft Word. It is less powerful, but it is simpler. A notetaking app should not force your mind to conform to it, it should conform to your mind. Personally, I prefer having an open document to write into over a bullet point system, even if the latter allows for more complex queries and notetaking systems. Some people hate both and prefer the simplicity of pen and paper. Do what works for you.","parent":"posts/Second Brains.txt","score":0.8931165812025401},{"content":"The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well.","parent":"posts/Goals for Spring Quarter.txt","score":0.8922947048100726},{"content":"What is the point of exegesis then? The point is serendipity - it's a place for me to capture little scraps of thought - ideas, feelings, anything that comes to you at the moment.","parent":"posts/Second Brains.txt","score":0.8917649142726086},{"content":"In writing this essay, I checked everything tagged \"exegesis\" and \"personal-reflection\" in exegesis. I didn't tag those thoughts for the purpose of writing this essay, they were written down spontaneously. That they have helped me write this essay is serendipitous.","parent":"posts/Second Brains.txt","score":0.8895885686567997},{"content":"Having talked to some users, it seems they use it the same way. Some have used [[exegesis]] to write short stories, other use it to write rap verses, but at the end of the day the focus is more on creativity rather than knowledge.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8883864012555719},{"content":"Also encouraging was the fact that I started hearing about similar notetaking apps a couple months into developing exegesis. Apps like Roam Research, and Obsidian were making waves on Twitter, and were taking a similar approach to nonlinear writing that I wanted to take exegesis in. This proved that I wasn't alone in needing this kind of product.","parent":"posts/Second Brains.txt","score":0.8876432059902873},{"content":"Eventually I want exegesis to be a social platform - you can already publish notes, but I want social features like profiles, groups, follows, etc. etc. Similar tools like [[roam]] can already be used as CRMs. So can exegesis. But, if I'm going to be building profiles into the app for social features, it may make sense to build additional affordances around managing people and relationships. For example, hovering over a link to a person could show all their social media profiles, in addition to places where you've tagged them in your notes.[[exegesis]] [[ideas]] [[roam]]","parent":"posts/untitled-9-20-2021.txt","score":0.887371823364764},{"content":"Directly relevant to exegesis, I was just speaking earlier about making social [[tools for thought]]. An interesting question to consider while creating this new social [[exegesis]]: How do I avoid making an echo-chamber platform susceptible to Curtis' critique, while fulfilling Fischer's vision for a web that can \"generate new discourse networks that have no correlate in the social field outside cyberspace?\" [[exegesis]] [[questions]] [[quotes]] [[Capitalist-Realism]] [[tools for thought]]","parent":"posts/untitled-9-20-2021.txt","score":0.8864062328547754},{"content":"To make regular progress towards personal projects, I'll be writing more on my development progress with [[exegesis]], under the tag [[devlog]]. I'll also be publishing another post soon on my plans for future features, and when I expect to release them by. I will do something similar with my other projects.","parent":"posts/Goals for Spring Quarter.txt","score":0.8863114510639207},{"content":"exegesis as crm [[exegesis]] [[ideas]]","parent":"posts/untitled-9-20-2021.txt","score":0.8846687390219252},{"content":"There are some additional benefits to this approach. Eventually, I would like to allow writers to monetize their blogs on exegesis, like Substack but with networked posts. With namespaces, they could sell multiple levels of subscriptions, each one allowing access to a different namespace.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8818525509615013}],"I want to improve at drawing. Drawing is something I've always loved doing, my notebooks from middle school and high school have more doodles in them than proper notes. I never took it particularly seriously, and when life got busy, I'd stop drawing for months on end. However, when I returned, it was always still fun. In fact, every time I've tried to get into \"regular\" drawing practice, it's always been miserable. There's some strange effect here where the longer I go without drawing, the better my drawings tend to be, as if drawing ability were a fixed resource that took time to build up. [[drawing]] ":[{"content":"I want to improve at drawing. Drawing is something I've always loved doing, my notebooks from middle school and high school have more doodles in them than proper notes. I never took it particularly seriously, and when life got busy, I'd stop drawing for months on end. However, when I returned, it was always still fun. In fact, every time I've tried to get into \"regular\" drawing practice, it's always been miserable. There's some strange effect here where the longer I go without drawing, the better my drawings tend to be, as if drawing ability were a fixed resource that took time to build up. [[drawing]]","parent":"posts/Reflections for the New Year.txt","score":1},{"content":"That being said, I think I've figured out a different drawing routine that will work this time. Past practice routines always centered around trying to copy other people's art, or doing realistic sketches/pose practice in pencil. I enjoy drawing without references the most, making things up as I go. Drawing from a reference is always boring and dreary for me. However, there's really no way to improve without using references. This is especially true since my biggest drawing deficiencies are not being able to draw people's faces well, portraying 3D shapes in a non-flat way, shading/cross-hatching, and posing figures naturally.[[drawing]]","parent":"posts/Reflections for the New Year.txt","score":0.9346694484193044},{"content":"Get better at drawing","parent":"posts/Goals for Spring Quarter.txt","score":0.9310856340866397},{"content":"The compromise that I've arrived at, and that I've tried so far with a decent amount of success, is to draw with my preferred medium (pen), in my own style, while also using a reference. I use the reference for the pose and some of the details, and use my imagination to make up the rest. This is infinitely more interesting for me, and doesn't feel like a dreary technical exercise. I've also given up on using pencil, or charcoal, or anything except pen. I used to harbor a lot of guilt over this, because shouldn't an artist be able to use any medium? Of course, this is ridiculous, it'd be like asking a musician to be familiar with every instrument. It makes far more sense to get really good with one medium than to be mediocre with multiple (feeling some cognitive dissonance here with my desire to learn both the [[piano]] and the [[guitar]]...). Of course, professional artists (and musicians) really should be learning multiple mediums, but I have no aspiration to be professional at either, only to have some fun. [[drawing]] [[piano]] [[guitar]]","parent":"posts/Reflections for the New Year.txt","score":0.9148257739586376},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter.txt","score":0.9105197011133626},{"content":"Growing up, my main creative outlet was drawing. As soon as a pencil or pen touched my hand I would have to draw something - it was almost involuntary. Many school notebooks were ruined this way, many concerned teachers advised me to keep my homework free of doodles.","parent":"posts/Fragments.txt","score":0.9001534010041821},{"content":"Practice drawing 3 times a week","parent":"posts/Goals for Spring Quarter.txt","score":0.8968706023782909},{"content":"There was a problem with both of these outlets, however: my short attention span. I struggled to work on larger drawings, because I'd give up on them and start new doodles. The same happened with code projects.","parent":"posts/Fragments.txt","score":0.8736245530557565},{"content":"In my teen years, I found programming and videogame development, and that became my creative outlet for a while. I found a way to scan my drawings into digital files, and for a while that was my way of combining art and programming.","parent":"posts/Fragments.txt","score":0.850949675470227},{"content":"I have not really settled into a good practice schedule for either piano or guitar. For the past couple of weeks, I've neglected guitar after moving my electric keyboard into my room, though my piano progress has hardly been good either - I have spent the past couple months playing the same pentatonic licks over Autumn Leaves. My goal for both instruments is to learn a couple of jazz standards with my housemates so we can jam together more.","parent":"posts/Goals for Spring Quarter.txt","score":0.8407390688147519},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8363110698657539},{"content":"This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year.","parent":"posts/Reflections for the New Year.txt","score":0.8354517554013701},{"content":"Learn a grappling art (because of quarantine, this will just be maintaining general fitness levels for now)","parent":"posts/Goals for Spring Quarter.txt","score":0.833503864672353},{"content":"Hobbies:","parent":"posts/Goals for Spring Quarter.txt","score":0.8331578594971147},{"content":"I want to get better at music. I went to [[piano]] classes as a kid and never really enjoyed them or took them seriously. Now I regret it. I also picked up guitar over quarantine, and want to get into a regular practice regimen for both of these instruments. For piano, I want to learn jazz, and how to improvise - I can't say I have much interest in building up my classical repertoire. For guitar, my current plan is to learn the blues, because I hear that's the root of many musical genres, and maybe branch off into rock or jazz later. A short term goal for both instruments is to familiarize myself with their scales.","parent":"posts/Reflections for the New Year.txt","score":0.8308219589335551},{"content":"These are my hobbies that I use to take a break from code related creative-work.","parent":"posts/Goals for Spring Quarter.txt","score":0.8292457650162111},{"content":"For writing, I firmly believe it's pointless to write for the sake of writing - it's important to do things first, so you have something to write about. That being said, it's also useful to write regularly to reflect on things, so I want to write at least once a week (an hour or so a session).","parent":"posts/Goals for Spring Quarter.txt","score":0.8278993701728597},{"content":"I think it's important to have free time to just mess around and be bored, and explore dumb things that might turn out to be not so dumb - after all, \"boredom is that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Every activity I eventually took seriously - Model UN in high school, programming in college - started out as an casual hobby I never planned to take seriously. So, I'd rather have slow progress towards my goals and a sizeable chunk of time to mess around, than to fill my days to the point where I have no time to explore at all.","parent":"posts/Goals for Spring Quarter.txt","score":0.8271437352992764},{"content":"I did not do a braindump yesterday, the words did not flow easily. Best not to force these things. [[journal]]","parent":"posts/untitled-9-24-2021.txt","score":0.8269537803250149},{"content":"I've been working on notetaking apps for years now. I starting working on the first one on the bus back from my internship. I had an idea for a simple interaction - users should be able to highlight a piece of text, then add tags to that text. I distinctly remember thinking to myself, \"That should be a piece of cake! I should be able to finish it during the 45 minute bus  ride.\"\n\n\nIt ended up taking the rest of the summer. I was 19, naive, and had no idea what a nightmare the contenteditable HTML standard was.","parent":"posts/Plaintext is your best friend.txt","score":0.8265310429613432}],"This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year. ":[{"content":"This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year.","parent":"posts/Reflections for the New Year.txt","score":1.0000000000000002},{"content":"I do think, however, that it's important to have priorities. In the first draft of this, I ordered each of those goals in a list of priorities from top to bottom, but I don't think that was a good way of looking at it. For one, a lot of them are highly related - for example, working on personal projects and learning to code.","parent":"posts/Goals for Spring Quarter.txt","score":0.8854341538269724},{"content":"I want to return to my roots. I want to get excited by little ideas and not worry about scaling them, or fitting them into a huge vision, or turning them into legible accomplishments. I still want to be ambitious, but I don't want to let my ambition choke my creativity.","parent":"posts/Fragments.txt","score":0.8798100698323482},{"content":"I have not really settled into a good practice schedule for either piano or guitar. For the past couple of weeks, I've neglected guitar after moving my electric keyboard into my room, though my piano progress has hardly been good either - I have spent the past couple months playing the same pentatonic licks over Autumn Leaves. My goal for both instruments is to learn a couple of jazz standards with my housemates so we can jam together more.","parent":"posts/Goals for Spring Quarter.txt","score":0.87655078538404},{"content":"I think it's important to have free time to just mess around and be bored, and explore dumb things that might turn out to be not so dumb - after all, \"boredom is that disagreeable 'windless calm' of the soul that precedes a happy voyage and cheerful winds.\" Every activity I eventually took seriously - Model UN in high school, programming in college - started out as an casual hobby I never planned to take seriously. So, I'd rather have slow progress towards my goals and a sizeable chunk of time to mess around, than to fill my days to the point where I have no time to explore at all.","parent":"posts/Goals for Spring Quarter.txt","score":0.8755137928230717},{"content":"Priority 2: Activities that are a break from code-related creative work (piano, guitar, fiction/nonfiction reading, drawing, fitness)","parent":"posts/Goals for Spring Quarter.txt","score":0.8723395965812486},{"content":"In [[Reflections for the New Year]], I outlined some things I wanted to get done this year. In no particular order, my goals were to:","parent":"posts/Goals for Spring Quarter.txt","score":0.8707978484560206},{"content":"As far as a schedule goes, I'd like to learn something new on the piano/guitar (either online lessons or part of a song) at least twice a week (for each instrument). Noodling doesn't count towards this goal. For the harmonica, I'm working my way through some Youtube course I found, and I'd like to work through at least one lesson a week.","parent":"posts/Goals for Spring Quarter.txt","score":0.8677188597270996},{"content":"I stopped working on little projects. The voice in my head that would get excited by little hints of an idea was drowned out by demands that everything be in the service of something ambitious, something legible, something monetizable. I let my ambition trap me.","parent":"posts/Fragments.txt","score":0.8632946713280368},{"content":"I want to get better at music. I went to [[piano]] classes as a kid and never really enjoyed them or took them seriously. Now I regret it. I also picked up guitar over quarantine, and want to get into a regular practice regimen for both of these instruments. For piano, I want to learn jazz, and how to improvise - I can't say I have much interest in building up my classical repertoire. For guitar, my current plan is to learn the blues, because I hear that's the root of many musical genres, and maybe branch off into rock or jazz later. A short term goal for both instruments is to familiarize myself with their scales.","parent":"posts/Reflections for the New Year.txt","score":0.8615998843500813},{"content":"I fell in love with playing the guitar because it rewards this lack of an attention span. You can copy a riff in minutes. You can create a new riff in minutes. Picking up a guitar puts me in an instant flow state, because I can just screw around and play with ideas instantly. It feels like a REPL for musical ideas.","parent":"posts/Fragments.txt","score":0.857568770599002},{"content":"I'm taking a gap quarter this Spring to work on some personal projects. It is always better to have a plan than to have no plan, even if things don't work out your way, so here are some tentative goals for my gap quarter.","parent":"posts/Goals for Spring Quarter.txt","score":0.8555796671094925},{"content":"I will write soon about my more long term goals for exegesis - both technical tasks I'd like to get done and my overall vision for the product.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.8554848038334146},{"content":"The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well.","parent":"posts/Goals for Spring Quarter.txt","score":0.8549921949947893},{"content":"I want to enter all the \"weekly\" goals into a calendar on Sunday, and then check every week how I've been measuring up against them. Here's a quick summary of them:","parent":"posts/Goals for Spring Quarter.txt","score":0.8547649581017135},{"content":"This project, too, has had a large effect on me - you can't work on something for a year and not have it affect you. I started this project sitting in a coffee shop; now I haven't sat in one for months. I know this sounds like navel gazing, but I've worked on this project through a pandemic, civil unrest, and statewide wildfires. Now it's finished, and I almost feel a little bittersweet releasing it.","parent":"posts/Reflections on exegesis.txt","score":0.8536743727446645},{"content":"Priority 1: Code-related creative work (continue work on exegesis, other personal projects, learn more code, write more)","parent":"posts/Goals for Spring Quarter.txt","score":0.8532610931318436},{"content":"I do think it's far from clear which schedule is better, at least personally speaking.[[focus]] [[personal-reflection]]","parent":"posts/untitled-10-1-2021.txt","score":0.8530582370037691},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots.txt","score":0.8519885899503875},{"content":"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.","parent":"posts/Reflections for the New Year.txt","score":0.851229995013543}],"The compromise that I've arrived at, and that I've tried so far with a decent amount of success, is to draw with my preferred medium (pen), in my own style, while also using a reference. I use the reference for the pose and some of the details, and use my imagination to make up the rest. This is infinitely more interesting for me, and doesn't feel like a dreary technical exercise. I've also given up on using pencil, or charcoal, or anything except pen. I used to harbor a lot of guilt over this, because shouldn't an artist be able to use any medium? Of course, this is ridiculous, it'd be like asking a musician to be familiar with every instrument. It makes far more sense to get really good with one medium than to be mediocre with multiple (feeling some cognitive dissonance here with my desire to learn both the [[piano]] and the [[guitar]]...). Of course, professional artists (and musicians) really should be learning multiple mediums, but I have no aspiration to be professional at either, only to have some fun. [[drawing]] [[piano]] [[guitar]] ":[{"content":"The compromise that I've arrived at, and that I've tried so far with a decent amount of success, is to draw with my preferred medium (pen), in my own style, while also using a reference. I use the reference for the pose and some of the details, and use my imagination to make up the rest. This is infinitely more interesting for me, and doesn't feel like a dreary technical exercise. I've also given up on using pencil, or charcoal, or anything except pen. I used to harbor a lot of guilt over this, because shouldn't an artist be able to use any medium? Of course, this is ridiculous, it'd be like asking a musician to be familiar with every instrument. It makes far more sense to get really good with one medium than to be mediocre with multiple (feeling some cognitive dissonance here with my desire to learn both the [[piano]] and the [[guitar]]...). Of course, professional artists (and musicians) really should be learning multiple mediums, but I have no aspiration to be professional at either, only to have some fun. [[drawing]] [[piano]] [[guitar]]","parent":"posts/Reflections for the New Year.txt","score":1},{"content":"That being said, I think I've figured out a different drawing routine that will work this time. Past practice routines always centered around trying to copy other people's art, or doing realistic sketches/pose practice in pencil. I enjoy drawing without references the most, making things up as I go. Drawing from a reference is always boring and dreary for me. However, there's really no way to improve without using references. This is especially true since my biggest drawing deficiencies are not being able to draw people's faces well, portraying 3D shapes in a non-flat way, shading/cross-hatching, and posing figures naturally.[[drawing]]","parent":"posts/Reflections for the New Year.txt","score":0.9165880878970347},{"content":"I want to improve at drawing. Drawing is something I've always loved doing, my notebooks from middle school and high school have more doodles in them than proper notes. I never took it particularly seriously, and when life got busy, I'd stop drawing for months on end. However, when I returned, it was always still fun. In fact, every time I've tried to get into \"regular\" drawing practice, it's always been miserable. There's some strange effect here where the longer I go without drawing, the better my drawings tend to be, as if drawing ability were a fixed resource that took time to build up. [[drawing]]","parent":"posts/Reflections for the New Year.txt","score":0.9148257739586376},{"content":"For drawing, I'd like to practice drawing reference images in my own style 3 times a week, with a focus on drawing more three dimensionally, drawing people/poses, and using color.","parent":"posts/Goals for Spring Quarter.txt","score":0.9054744881296208},{"content":"I have not really settled into a good practice schedule for either piano or guitar. For the past couple of weeks, I've neglected guitar after moving my electric keyboard into my room, though my piano progress has hardly been good either - I have spent the past couple months playing the same pentatonic licks over Autumn Leaves. My goal for both instruments is to learn a couple of jazz standards with my housemates so we can jam together more.","parent":"posts/Goals for Spring Quarter.txt","score":0.874246791909893},{"content":"I want to get better at music. I went to [[piano]] classes as a kid and never really enjoyed them or took them seriously. Now I regret it. I also picked up guitar over quarantine, and want to get into a regular practice regimen for both of these instruments. For piano, I want to learn jazz, and how to improvise - I can't say I have much interest in building up my classical repertoire. For guitar, my current plan is to learn the blues, because I hear that's the root of many musical genres, and maybe branch off into rock or jazz later. A short term goal for both instruments is to familiarize myself with their scales.","parent":"posts/Reflections for the New Year.txt","score":0.8736076157999383},{"content":"Get better at drawing","parent":"posts/Goals for Spring Quarter.txt","score":0.8669231580684057},{"content":"Growing up, my main creative outlet was drawing. As soon as a pencil or pen touched my hand I would have to draw something - it was almost involuntary. Many school notebooks were ruined this way, many concerned teachers advised me to keep my homework free of doodles.","parent":"posts/Fragments.txt","score":0.8664434039544601},{"content":"Practice drawing 3 times a week","parent":"posts/Goals for Spring Quarter.txt","score":0.860819513258056},{"content":"Higher-order creativity","parent":"posts/Prometheus.txt","score":0.8542621110604786},{"content":"There is at least one creative medium for which this is not true, however, and that is programming. Here is a unique and strange property of programming: Making tools to program better itself involves programming. This is not true for music or art - the process of making a guitar is not the art of playing the guitar, the process of making paints is not the art of painting, and while luthiers and paint-makers are certainly artists in their own right (and are often good at playing the guitar and painting, respectively), they practice an art that is distinct from the art that they enable.","parent":"posts/Prometheus.txt","score":0.8519406873379682},{"content":"This is a lot. I doubt I'll be able to do all of this, and if I fall short on time, I'll have to cut back on some of these activities. They are not listed in order of importance, I plan on figuring that out at a later date. What is important to me is that I actually think about what I want to do, and the priorities for them. It's all to easy to spend a day noodling on guitar, wanting to get better solely because I saw some guy play a fancy solo on Youtube, or to spend a day learning a programming language I'll never use because someone on Twitter praised it. This is a recipe for mediocrity, because progress takes sustained practice, and I can't sustain these sorts of \"inspirations.\" Instead, I want to think slowly and deliberately about what I want to get better at, and stick to a slow and steady plan to improve at it. That is my \"big-picture\" goal for this year.","parent":"posts/Reflections for the New Year.txt","score":0.8483729773694862},{"content":"Ironically, minimalism is far from simple, and there are a lot of different flavors of it. Here are a couple of examples of different minimal styles of writing. There's the terse, masculine minimalism of a writer like Hemingway: the minimalism of a distant father, fond of whiskey and cigars, who sees the use of words as emotive and thus avoids them. There's the technical minimalism of an author like Paul Graham, a minimalism that treats words like code, moving parts in a machine to be optimized away, possible sources of error to be eliminated. Then there's the pragmatic businesslike minimalism of online writers seeking a platform like David Perell, who view each word as effort expended by a possible reader, and therefore something to be minimized as well. These are only a couple examples of minimalism in one medium, writing - if we examine the visual and musical arts as well there are far more.","parent":"posts/Minimalism.txt","score":0.8453527732295998},{"content":"These are my hobbies that I use to take a break from code related creative-work.","parent":"posts/Goals for Spring Quarter.txt","score":0.8429552757256538},{"content":"There was a problem with both of these outlets, however: my short attention span. I struggled to work on larger drawings, because I'd give up on them and start new doodles. The same happened with code projects.","parent":"posts/Fragments.txt","score":0.84265713192351},{"content":"I fell in love with playing the guitar because it rewards this lack of an attention span. You can copy a riff in minutes. You can create a new riff in minutes. Picking up a guitar puts me in an instant flow state, because I can just screw around and play with ideas instantly. It feels like a REPL for musical ideas.","parent":"posts/Fragments.txt","score":0.841128504182274},{"content":"Whether its noticing that two songs use the same chord progression, stealing a nice lick from your favorite blues guitarist, making a mashup of two of your favorite songs, or translating a song into a different genre, playing music is all about making connections. Unfortunately, the way we listen to music prevents us from doing this.","parent":"posts/Context and community makes music more enjoyable, and it's missing from modern streaming services.txt","score":0.84102184799336},{"content":"Neither perspective is completely correct. The reality is that there is a tradeoff between the approach of creative collaboration and the approach of an auteur. What creative collaborators gain through specialization and the combination of talents, they lose in the fidelity of their ideas' expression; what the auteur loses through not being able to harness others' talents, he gains through the ability to express an idea to its fullest. Naturally, the more talents the auteur is able to accrue, the less he needs others, and the more worthwhile the tradeoff of solo work becomes.","parent":"posts/On auteurs and language.txt","score":0.8393110158037554},{"content":"None of the above. I got a targeted Facebook ad for Fender's free online guitar course. I remember this very distinctly as the moment I decided to learn guitar; I had never really thought much about it at all before that. Deep within the entrails of Facebook's recommendation engine, some algorithm made an educated guess that I'd enjoy picking up the guitar - and it was right. For all the horrible things Facebook has done, this was a real positive-sum, Pareto optimal moment. Zuck got his advertising check, and I got a new hobby. And for all that has been blamed on the internet, I owe it everything. Everything that I love doing, I have learned to some extent from the internet, whether it be the web development skills that I built exegesis with, my amateur interest in philosophy, my childhood love for art, or my newfound interest in guitar. I believe it is mankind's most beautiful invention.","parent":"posts/Giant Robots.txt","score":0.8384052759579408},{"content":"For example, I'm starting to suspect that no styling library is going to provide a good experience, because the fundamental pain point is trying to express a visual idea with a text-based set of rules. A styling library can provide some affordances that make things easier - easy theming, dark mode, conditional styles, etc. etc - but the fundamental painful experience of trying to express a visual idea in code cannot be ameliorated with better code tools.[[code]] [[ideas]] [[tools for thought]]","parent":"posts/untitled-9-24-2021.txt","score":0.83839438500164}],"Finally, I want to take my studies more seriously. Next quarter, I am taking upper division classes on statistics for CS, databases, and information interfaces. I am especially excited about the database class, since database design problems were a big part of what I struggled with while building exegesis. I am also excited about the information interfaces class - exegesis is really just one giant information interface, isn't it? I cannot say I am excited about the stats class, I have never been fond of or good at math, but I will try to brave it with a stiff upper lip. I am considering posting my notes for these classes on [[exegesis]], so I can share them with classmates. ":[{"content":"Finally, I want to take my studies more seriously. Next quarter, I am taking upper division classes on statistics for CS, databases, and information interfaces. I am especially excited about the database class, since database design problems were a big part of what I struggled with while building exegesis. I am also excited about the information interfaces class - exegesis is really just one giant information interface, isn't it? I cannot say I am excited about the stats class, I have never been fond of or good at math, but I will try to brave it with a stiff upper lip. I am considering posting my notes for these classes on [[exegesis]], so I can share them with classmates.","parent":"posts/Reflections for the New Year.txt","score":1.0000000000000002},{"content":"I originally thought of [[exegesis]] as a tool for rational thought as well - I wanted to use it to organize my notes, and hoped it would make me better at retaining information at school. After more than a year of using it, it turns out I almost never use it for either of those things.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8848760810903787},{"content":"Here's a mystery that's been on my mind for a while now: I never take notes in class, I never use [[exegesis]] to take notes, so how is it that I ended up making something that most people would classify as a \"note taking app\"?","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8839053171236729},{"content":"Many of my ideas are in service of a singular dream: having the ability to combine incoherent fragments of creative inspiration into a cohesive organized whole. exegesis is about enabling that with writing. I hope the design of this site will help me do that with interface ideas.","parent":"posts/Fragments.txt","score":0.8825127999457131},{"content":"Exegesis is the Apple Notes to Roam Research's Microsoft Word. It is less powerful, but it is simpler. A notetaking app should not force your mind to conform to it, it should conform to your mind. Personally, I prefer having an open document to write into over a bullet point system, even if the latter allows for more complex queries and notetaking systems. Some people hate both and prefer the simplicity of pen and paper. Do what works for you.","parent":"posts/Second Brains.txt","score":0.8813820005657451},{"content":"I want to try something: just posting a mind dump on [[exegesis]] every morning. I've had a theory for a while now that the best use case for exegesis is journaling, and this would be a good way to put it to the test. It will also be a good way for me to share my ideas with the world.","parent":"posts/untitled-9-20-2021.txt","score":0.8801103828838294},{"content":"I may take a typography class this quarter. It's not required for graduation, but I figure it could help me design better products, and maybe make [[exegesis]] look prettier.","parent":"posts/untitled-9-22-2021.txt","score":0.8788574051093736},{"content":"The main focus here is personal projects - learning more code and writing more are auxiliary activities that help this end. First among these personal projects is [[exegesis]], but I have a number of other personal projects that I want to work on as well.","parent":"posts/Goals for Spring Quarter.txt","score":0.8785386473260949},{"content":"Continue working on exegesis (and maybe some other personal projects)","parent":"posts/Goals for Spring Quarter.txt","score":0.8774147523650789},{"content":"The first year of this strange new decade is over. Personally, however, the end of the this year is less significant to me than the release of [[exegesis]]. A lot of my time was spent developing this project over the last year, and now that it's finished, I have a lot more time to spend on other activities. I'm not really big on resolutions, but I do want to reflect a little on everything. Of course, I anticipate [[exegesis]] will help me organize my new endeavors.","parent":"posts/Reflections for the New Year.txt","score":0.8749829386969963},{"content":"What do I use [[exegesis]] for? I use it like a journal. I write down thoughts about my life, ideas that I have, things that I'd like to do, reflections on my day, etc. etc. None of these things could be called knowledge, none of them could be called rational.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8748916809253059},{"content":"If this sounds silly, that's because it is. Reality check: note taking apps are just note taking apps; it is supremely arrogant to think that you think you can replicate with a couple KLOCs of javascript code what took evolution thousands of years to perfect. I have stopped thinking about exegesis as a personal knowledge management system or a notetaking app. For me it is the mental equivalent of [perpetual stew](https://en.wikipedia.org/wiki/Perpetual_stew) - I leave it on the stove and toss ideas in whenever its convenient. The effortlessness is the point; if I ever find myself drawing a diagram to have to figure out how to use it, that defeats the purpose of the whole thing.","parent":"posts/Second Brains.txt","score":0.8726880319052434},{"content":"I want to write more. I don't really care about writing \"better\" or more \"professionally\", because I don't write for a living, and I'm not really interested in selling people on my opinions. Instead, I want to write to broadcast my interests, so I can attract others who have similar interests. Hopefully, [[exegesis]] will be an able and capable platform for me to do this.","parent":"posts/Reflections for the New Year.txt","score":0.872404296287091},{"content":"It's been rewarding seeing how the more [[philosophy]] I read, the more complex texts I'm able to understand. I think the [[metaphysics]] class I'm taking right now has helped illuminate some of the concepts as well.","parent":"posts/untitled-2-6-2022.txt","score":0.8696882829539873},{"content":"My favorite use of [[exegesis]] is to write down ideas that I have. I write about exegesis in exegesis, and a lot of features that I've added to exegesis started as sudden thoughts that were captured in exegesis. In my experience, ideas are like seeds, and writing them down helps them grow. I might think nothing of a simple idea I capture one day, but a week later it might have renewed significance, and it could even spark new ideas.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8691057980262684},{"content":"We shape technology, but technology shapes us as well. Our thought processes have come to resemble the disorganized, amorphous, nonlinear streams that we consume information with. When was the last time you really felt focused? [[exegesis]] is a tool designed for the brave new world we find ourselves living in. Instead of resisting the increasingly disorganized information ecosystem of the modern world, it embraces it. It is designed to help you make sense of chaos.","parent":"posts/Manifesto.txt","score":0.8689392454891773},{"content":"exegesis as crm [[exegesis]] [[ideas]]","parent":"posts/untitled-9-20-2021.txt","score":0.8680868660289716},{"content":"I will write soon about my more long term goals for exegesis - both technical tasks I'd like to get done and my overall vision for the product.","parent":"posts/Roadmap to exegesis' beta release.txt","score":0.867706766702146},{"content":"In other words, I don't use [[exegesis]] as a PKM at all, because very little of what I write in exegesis could be considered \"knowledge.\" I don't use it as a memory aide either, because when I'm learning something I almost never take notes. Instead, it's a way for me to form connections between ideas and reflections that I have. It's a tool for creative thought.","parent":"posts/On tools for thought: knowledge management vs creativity.txt","score":0.8672662710033465},{"content":"Also encouraging was the fact that I started hearing about similar notetaking apps a couple months into developing exegesis. Apps like Roam Research, and Obsidian were making waves on Twitter, and were taking a similar approach to nonlinear writing that I wanted to take exegesis in. This proved that I wasn't alone in needing this kind of product.","parent":"posts/Second Brains.txt","score":0.8647878234537654}]}