{"":[{"content":"Next to every paragraph, there is a button that will show you other related paragraphs from your other notes.","parent":"posts/What is Nomad Hypertext.txt","score":0.8514450468005932},{"content":"Nomad Hypertext is a writing app built around semantic search.","parent":"posts/What is Nomad Hypertext.txt","score":0.8455138568311819},{"content":"You're viewing this on a statically generated blog using Yurt!","parent":"posts/What is Yurt.txt","score":0.8352868364347527},{"content":"Yurt is a static site generator, built off the same principles as Nomad Hypertext.","parent":"posts/What is Yurt.txt","score":0.83147189188003},{"content":"It does this by dividing your notes up into paragraph-sized blocks and indexing them into a vector database with an AI embedding model.","parent":"posts/What is Nomad Hypertext.txt","score":0.8308738608102689},{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8286014862219001},{"content":"At build time, it embeds all your posts into vectors and puts them into a vector database. Then, for each paragraph in a post, it queries the vector database for the 20 most similar paragraphs from all your notes. It stores these in a precomputed index. It then statically generates a blog for you (like Gatsby or any other static site generator), and uses this index so users can see related ideas when they click on a paragraph.","parent":"posts/What is Yurt.txt","score":0.82507608178487},{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text. Semantic search is all you need!","parent":"posts/What is Nomad Hypertext.txt","score":0.8244515437960355},{"content":"The app is free and open source. Notes are stored as plain text files, which means you are free to use tools like git to sync them across multiple devices, and free to port your notes over to other apps if you wish.","parent":"posts/What is Nomad Hypertext.txt","score":0.8229781287130151},{"content":"I'll end with a haiku. \n\nNomad Hypertext\nPowered by semantic search \nGives inspiration","parent":"posts/What is Nomad Hypertext.txt","score":0.8171806181110879},{"content":"I think eventually, I might want to deploy a blog with a full fledged backend, so users can query anything they'd like to my blog.","parent":"posts/What is Yurt.txt","score":0.8124904819875103},{"content":"There are pros and cons to this approach. The biggest pro is that it generates a static blog. There's no backend to maintain, and it's quite lightweight and loads fast, while also providing the benefit of semantic hyperlinks. The con is that since the index is precomputed, you can't search for arbitrary things like you can in nomad hypertext.","parent":"posts/What is Yurt.txt","score":0.8052637922392895}],"The usual way to think about technology, software, and startups is that they solve problems, and so it follows then that the best way to create a new technology is to find a problem people have and solve it. This is not a bad approach to take, and it's been successful for many people. Still, I think it's too narrow.":[{"content":"It uses neural search to show you how your ideas are connected to each other. This is done offline and privately on your computer, entirely on your machine.","parent":"posts/What is Nomad Hypertext.txt","score":0.8318598407528539},{"content":"The basic idea here is that semantic search functions better than backlinking, tags, or folders at helping you see connections between your ideas. It is also much simpler to implement. With backlinks and tags, you often need specialized file types, but semantic search works on top of plain text. Semantic search is all you need!","parent":"posts/What is Nomad Hypertext.txt","score":0.8103904719035427},{"content":"I think eventually, I might want to deploy a blog with a full fledged backend, so users can query anything they'd like to my blog.","parent":"posts/What is Yurt.txt","score":0.8067091544652751}],"There is a particular kind of second order effect that is of special interest: technologies can create entire new types of people. Instagram created the influencer, Youtube produced the Youtuber, Soundcloud spawned its own eponymous kind of rapper. The more extreme political factions in America trace their lineages to 4Chan and Tumblr. To give an older example, the factory birthed the proletariat a century ago. ":[{"content":"You're viewing this on a statically generated blog using Yurt!","parent":"posts/What is Yurt.txt","score":0.8002601597216477}],"I don't just mean that technologies create new sorts of jobs, which is a true statement but in my opinion understates the significance of what is being done. Each of the examples given above did not merely create a new kind of occupation - they created a nexus of richly interlinked cultural artifacts, characters, and identities. The introduction of the social media influencer did far more than just introduce a new kind of occupation. It also created a new social hierarchy, threatened old social hierarchies (the beef between old Hollywood elites and new internet stars, etc. etc.), [influenced the goals of an entire generation](https://www.fastcompany.com/90432765/why-do-kids-want-to-be-influencers), and resulted in a reordering of values where old values like modesty and moderation gave way to exuberance and excess. The sum of these new hierarchies, values, and occupations is the creation of a new type of person.":[],"Traditional market research asks the question, what sorts of people would use our product? A useful question, to be sure, but the more interesting one is what new sort of person would our product create? ":[],"The problem with the view that technology is meant to solve problems is that technology always ends up doing so much more than that. Take any technology and its original intended purpose (fire, automobiles, airplanes, etc.) and you will find it has created a cascade of second order effects far beyond what it was originally intended to do. Sometimes these impacts are good, sometimes they're bad, sometimes they're just strange. ":[],"Of course, it is impossible to create a new kind of person out of thin air. Without traction with existing customers, it is impossible to gain the momentum needed to have enough cultural impact to create a new type of person. The synthesis between these two extremes is this: an innovative product is not one that merely solves problems for an existing kind of person, or one that creates an entirely new kind of person. Rather, it recognizes some kind of latent potential in existing people, and then transforms them into a new kind of person. For example, influencers did not exist when Instagram was created. However, there were people who wanted to share their photos with the world, and people that wanted to be recognized for their photos/beauty - it was this latent potential that Instagram unleashed.":[]}